module Cldr.Arabic exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Arabic.

    AD أندورا
    AE الإمارات العربية المتحدة
    AF أفغانستان
    AG أنتيغوا وبربودا
    AI أنغويلا
    AL ألبانيا
    AM أرمينيا
    AO أنغولا
    AQ أنتاركتيكا
    AR الأرجنتين
    AS ساموا الأمريكية
    AT النمسا
    AU أستراليا
    AW أروبا
    AX جزر آلاند
    AZ أذربيجان
    BA البوسنة والهرسك
    BB بربادوس
    BD بنغلاديش
    BE بلجيكا
    BF بوركينا فاسو
    BG بلغاريا
    BH البحرين
    BI بوروندي
    BJ بنين
    BL سان بارتليمي
    BM برمودا
    BN بروناي
    BO بوليفيا
    BQ هولندا الكاريبية
    BR البرازيل
    BS جزر البهاما
    BT بوتان
    BV جزيرة بوفيه
    BW بوتسوانا
    BY بيلاروس
    BZ بليز
    CA كندا
    CC جزر كوكوس (كيلينغ)
    CD جمهورية الكونغو الديمقراطية
    CF جمهورية أفريقيا الوسطى
    CG جمهورية الكونغو
    CH سويسرا
    CI ساحل العاج
    CK جزر كوك
    CL تشيلي
    CM الكاميرون
    CN الصين
    CO كولومبيا
    CR كوستاريكا
    CU كوبا
    CV الرأس الأخضر
    CW كوراساو
    CX جزيرة كريسماس
    CY قبرص
    CZ جمهورية التشيك
    DE ألمانيا
    DJ جيبوتي
    DK الدانمرك
    DM دومينيكا
    DO جمهورية الدومينيكان
    DZ الجزائر
    EC الإكوادور
    EE إستونيا
    EG مصر
    EH الصحراء الغربية
    ER إريتريا
    ES إسبانيا
    ET إثيوبيا
    FI فنلندا
    FJ فيجي
    FK جزر فوكلاند
    FM ميكرونيزيا
    FO جزر فارو
    FR فرنسا
    GA الغابون
    GB المملكة المتحدة
    GD غرينادا
    GE جورجيا
    GF غويانا الفرنسية
    GG غيرنزي
    GH غانا
    GI جبل طارق
    GL غرينلاند
    GM غامبيا
    GN غينيا
    GP غوادلوب
    GQ غينيا الاستوائية
    GR اليونان
    GS جورجيا الجنوبية وجزر ساندويتش الجنوبية
    GT غواتيمالا
    GU غوام
    GW غينيا بيساو
    GY غيانا
    HK هونغ كونغ
    HM جزيرة هيرد وجزر ماكدونالد
    HN هندوراس
    HR كرواتيا
    HT هايتي
    HU هنغاريا
    ID إندونيسيا
    IE أيرلندا
    IL إسرائيل
    IM جزيرة مان
    IN الهند
    IO الإقليم البريطاني في المحيط الهندي
    IQ العراق
    IR إيران
    IS آيسلندا
    IT إيطاليا
    JE جيرسي
    JM جامايكا
    JO الأردن
    JP اليابان
    KE كينيا
    KG قيرغيزستان
    KH كمبوديا
    KI كيريباتي
    KM جزر القمر
    KN سانت كيتس ونيفيس
    KP كوريا الشمالية
    KR كوريا الجنوبية
    KW الكويت
    KY جزر كايمان
    KZ كازاخستان
    LA لاوس
    LB لبنان
    LC سانت لوسيا
    LI ليختنشتاين
    LK سريلانكا
    LR ليبيريا
    LS ليسوتو
    LT ليتوانيا
    LU لوكسمبورغ
    LV لاتفيا
    LY ليبيا
    MA المغرب
    MC موناكو
    MD مولدوفا
    ME الجبل الأسود
    MF سان مارتن
    MG مدغشقر
    MH جزر مارشال
    MK مقدونيا الشمالية
    ML مالي
    MM ميانمار (بورما)
    MN منغوليا
    MO مكاو
    MP جزر ماريانا الشمالية
    MQ جزر المارتينيك
    MR موريتانيا
    MS مونتسرات
    MT مالطا
    MU موريشيوس
    MV جزر المالديف
    MW ملاوي
    MX المكسيك
    MY ماليزيا
    MZ موزمبيق
    NA ناميبيا
    NC كاليدونيا الجديدة
    NE النيجر
    NF جزيرة نورفولك
    NG نيجيريا
    NI نيكاراغوا
    NL هولندا
    NO النرويج
    NP نيبال
    NR ناورو
    NU نيوي
    NZ نيوزيلندا
    OM عُمان
    PA بنما
    PE بيرو
    PF بولينيزيا الفرنسية
    PG بابوا غينيا الجديدة
    PH الفلبين
    PK باكستان
    PL بولندا
    PM سان بيير ومكويلون
    PN جزر بيتكيرن
    PR بورتوريكو
    PS فلسطين
    PT البرتغال
    PW بالاو
    PY باراغواي
    QA قطر
    RE روينيون
    RO رومانيا
    RS صربيا
    RU روسيا
    RW رواندا
    SA المملكة العربية السعودية
    SB جزر سليمان
    SC سيشل
    SD السودان
    SE السويد
    SG سنغافورة
    SH سانت هيلينا
    SI سلوفينيا
    SJ سفالبارد وجان ماين
    SK سلوفاكيا
    SL سيراليون
    SM سان مارينو
    SN السنغال
    SO الصومال
    SR سورينام
    SS جنوب السودان
    ST ساو تومي وبرينسيبي
    SV السلفادور
    SX سانت مارتن
    SY سوريا
    SZ إسواتيني
    TC جزر توركس وكايكوس
    TD تشاد
    TF الأقاليم الجنوبية الفرنسية
    TG توغو
    TH تايلاند
    TJ طاجيكستان
    TK توكيلو
    TL تيمور الشرقية
    TM تركمانستان
    TN تونس
    TO تونغا
    TR تركيا
    TT ترينيداد وتوباغو
    TV توفالو
    TW تايوان
    TZ تنزانيا
    UA أوكرانيا
    UG أوغندا
    UM جزر الولايات المتحدة النائية
    US الولايات المتحدة
    UY أورغواي
    UZ أوزبكستان
    VA الفاتيكان
    VC سانت فنسنت وجزر غرينادين
    VE فنزويلا
    VG جزر فيرجن البريطانية
    VI جزر فيرجن التابعة للولايات المتحدة
    VN فيتنام
    VU فانواتو
    WF جزر والس وفوتونا
    WS ساموا
    XK كوسوفو
    YE اليمن
    YT مايوت
    ZA جنوب أفريقيا
    ZM زامبيا
    ZW زيمبابوي
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "أندورا"

        Cldr.AE ->
            "الإمارات العربية المتحدة"

        Cldr.AF ->
            "أفغانستان"

        Cldr.AG ->
            "أنتيغوا وبربودا"

        Cldr.AI ->
            "أنغويلا"

        Cldr.AL ->
            "ألبانيا"

        Cldr.AM ->
            "أرمينيا"

        Cldr.AO ->
            "أنغولا"

        Cldr.AQ ->
            "أنتاركتيكا"

        Cldr.AR ->
            "الأرجنتين"

        Cldr.AS ->
            "ساموا الأمريكية"

        Cldr.AT ->
            "النمسا"

        Cldr.AU ->
            "أستراليا"

        Cldr.AW ->
            "أروبا"

        Cldr.AX ->
            "جزر آلاند"

        Cldr.AZ ->
            "أذربيجان"

        Cldr.BA ->
            "البوسنة والهرسك"

        Cldr.BB ->
            "بربادوس"

        Cldr.BD ->
            "بنغلاديش"

        Cldr.BE ->
            "بلجيكا"

        Cldr.BF ->
            "بوركينا فاسو"

        Cldr.BG ->
            "بلغاريا"

        Cldr.BH ->
            "البحرين"

        Cldr.BI ->
            "بوروندي"

        Cldr.BJ ->
            "بنين"

        Cldr.BL ->
            "سان بارتليمي"

        Cldr.BM ->
            "برمودا"

        Cldr.BN ->
            "بروناي"

        Cldr.BO ->
            "بوليفيا"

        Cldr.BQ ->
            "هولندا الكاريبية"

        Cldr.BR ->
            "البرازيل"

        Cldr.BS ->
            "جزر البهاما"

        Cldr.BT ->
            "بوتان"

        Cldr.BV ->
            "جزيرة بوفيه"

        Cldr.BW ->
            "بوتسوانا"

        Cldr.BY ->
            "بيلاروس"

        Cldr.BZ ->
            "بليز"

        Cldr.CA ->
            "كندا"

        Cldr.CC ->
            "جزر كوكوس (كيلينغ)"

        Cldr.CD ->
            "جمهورية الكونغو الديمقراطية"

        Cldr.CF ->
            "جمهورية أفريقيا الوسطى"

        Cldr.CG ->
            "جمهورية الكونغو"

        Cldr.CH ->
            "سويسرا"

        Cldr.CI ->
            "ساحل العاج"

        Cldr.CK ->
            "جزر كوك"

        Cldr.CL ->
            "تشيلي"

        Cldr.CM ->
            "الكاميرون"

        Cldr.CN ->
            "الصين"

        Cldr.CO ->
            "كولومبيا"

        Cldr.CR ->
            "كوستاريكا"

        Cldr.CU ->
            "كوبا"

        Cldr.CV ->
            "الرأس الأخضر"

        Cldr.CW ->
            "كوراساو"

        Cldr.CX ->
            "جزيرة كريسماس"

        Cldr.CY ->
            "قبرص"

        Cldr.CZ ->
            "جمهورية التشيك"

        Cldr.DE ->
            "ألمانيا"

        Cldr.DJ ->
            "جيبوتي"

        Cldr.DK ->
            "الدانمرك"

        Cldr.DM ->
            "دومينيكا"

        Cldr.DO ->
            "جمهورية الدومينيكان"

        Cldr.DZ ->
            "الجزائر"

        Cldr.EC ->
            "الإكوادور"

        Cldr.EE ->
            "إستونيا"

        Cldr.EG ->
            "مصر"

        Cldr.EH ->
            "الصحراء الغربية"

        Cldr.ER ->
            "إريتريا"

        Cldr.ES ->
            "إسبانيا"

        Cldr.ET ->
            "إثيوبيا"

        Cldr.FI ->
            "فنلندا"

        Cldr.FJ ->
            "فيجي"

        Cldr.FK ->
            "جزر فوكلاند"

        Cldr.FM ->
            "ميكرونيزيا"

        Cldr.FO ->
            "جزر فارو"

        Cldr.FR ->
            "فرنسا"

        Cldr.GA ->
            "الغابون"

        Cldr.GB ->
            "المملكة المتحدة"

        Cldr.GD ->
            "غرينادا"

        Cldr.GE ->
            "جورجيا"

        Cldr.GF ->
            "غويانا الفرنسية"

        Cldr.GG ->
            "غيرنزي"

        Cldr.GH ->
            "غانا"

        Cldr.GI ->
            "جبل طارق"

        Cldr.GL ->
            "غرينلاند"

        Cldr.GM ->
            "غامبيا"

        Cldr.GN ->
            "غينيا"

        Cldr.GP ->
            "غوادلوب"

        Cldr.GQ ->
            "غينيا الاستوائية"

        Cldr.GR ->
            "اليونان"

        Cldr.GS ->
            "جورجيا الجنوبية وجزر ساندويتش الجنوبية"

        Cldr.GT_ ->
            "غواتيمالا"

        Cldr.GU ->
            "غوام"

        Cldr.GW ->
            "غينيا بيساو"

        Cldr.GY ->
            "غيانا"

        Cldr.HK ->
            "هونغ كونغ"

        Cldr.HM ->
            "جزيرة هيرد وجزر ماكدونالد"

        Cldr.HN ->
            "هندوراس"

        Cldr.HR ->
            "كرواتيا"

        Cldr.HT ->
            "هايتي"

        Cldr.HU ->
            "هنغاريا"

        Cldr.ID ->
            "إندونيسيا"

        Cldr.IE ->
            "أيرلندا"

        Cldr.IL ->
            "إسرائيل"

        Cldr.IM ->
            "جزيرة مان"

        Cldr.IN ->
            "الهند"

        Cldr.IO ->
            "الإقليم البريطاني في المحيط الهندي"

        Cldr.IQ ->
            "العراق"

        Cldr.IR ->
            "إيران"

        Cldr.IS ->
            "آيسلندا"

        Cldr.IT ->
            "إيطاليا"

        Cldr.JE ->
            "جيرسي"

        Cldr.JM ->
            "جامايكا"

        Cldr.JO ->
            "الأردن"

        Cldr.JP ->
            "اليابان"

        Cldr.KE ->
            "كينيا"

        Cldr.KG ->
            "قيرغيزستان"

        Cldr.KH ->
            "كمبوديا"

        Cldr.KI ->
            "كيريباتي"

        Cldr.KM ->
            "جزر القمر"

        Cldr.KN ->
            "سانت كيتس ونيفيس"

        Cldr.KP ->
            "كوريا الشمالية"

        Cldr.KR ->
            "كوريا الجنوبية"

        Cldr.KW ->
            "الكويت"

        Cldr.KY ->
            "جزر كايمان"

        Cldr.KZ ->
            "كازاخستان"

        Cldr.LA ->
            "لاوس"

        Cldr.LB ->
            "لبنان"

        Cldr.LC ->
            "سانت لوسيا"

        Cldr.LI ->
            "ليختنشتاين"

        Cldr.LK ->
            "سريلانكا"

        Cldr.LR ->
            "ليبيريا"

        Cldr.LS ->
            "ليسوتو"

        Cldr.LT_ ->
            "ليتوانيا"

        Cldr.LU ->
            "لوكسمبورغ"

        Cldr.LV ->
            "لاتفيا"

        Cldr.LY ->
            "ليبيا"

        Cldr.MA ->
            "المغرب"

        Cldr.MC ->
            "موناكو"

        Cldr.MD ->
            "مولدوفا"

        Cldr.ME ->
            "الجبل الأسود"

        Cldr.MF ->
            "سان مارتن"

        Cldr.MG ->
            "مدغشقر"

        Cldr.MH ->
            "جزر مارشال"

        Cldr.MK ->
            "مقدونيا الشمالية"

        Cldr.ML ->
            "مالي"

        Cldr.MM ->
            "ميانمار (بورما)"

        Cldr.MN ->
            "منغوليا"

        Cldr.MO ->
            "مكاو"

        Cldr.MP ->
            "جزر ماريانا الشمالية"

        Cldr.MQ ->
            "جزر المارتينيك"

        Cldr.MR ->
            "موريتانيا"

        Cldr.MS ->
            "مونتسرات"

        Cldr.MT ->
            "مالطا"

        Cldr.MU ->
            "موريشيوس"

        Cldr.MV ->
            "جزر المالديف"

        Cldr.MW ->
            "ملاوي"

        Cldr.MX ->
            "المكسيك"

        Cldr.MY ->
            "ماليزيا"

        Cldr.MZ ->
            "موزمبيق"

        Cldr.NA ->
            "ناميبيا"

        Cldr.NC ->
            "كاليدونيا الجديدة"

        Cldr.NE ->
            "النيجر"

        Cldr.NF ->
            "جزيرة نورفولك"

        Cldr.NG ->
            "نيجيريا"

        Cldr.NI ->
            "نيكاراغوا"

        Cldr.NL ->
            "هولندا"

        Cldr.NO ->
            "النرويج"

        Cldr.NP ->
            "نيبال"

        Cldr.NR ->
            "ناورو"

        Cldr.NU ->
            "نيوي"

        Cldr.NZ ->
            "نيوزيلندا"

        Cldr.OM ->
            "عُمان"

        Cldr.PA ->
            "بنما"

        Cldr.PE ->
            "بيرو"

        Cldr.PF ->
            "بولينيزيا الفرنسية"

        Cldr.PG ->
            "بابوا غينيا الجديدة"

        Cldr.PH ->
            "الفلبين"

        Cldr.PK ->
            "باكستان"

        Cldr.PL ->
            "بولندا"

        Cldr.PM ->
            "سان بيير ومكويلون"

        Cldr.PN ->
            "جزر بيتكيرن"

        Cldr.PR ->
            "بورتوريكو"

        Cldr.PS ->
            "فلسطين"

        Cldr.PT ->
            "البرتغال"

        Cldr.PW ->
            "بالاو"

        Cldr.PY ->
            "باراغواي"

        Cldr.QA ->
            "قطر"

        Cldr.RE ->
            "روينيون"

        Cldr.RO ->
            "رومانيا"

        Cldr.RS ->
            "صربيا"

        Cldr.RU ->
            "روسيا"

        Cldr.RW ->
            "رواندا"

        Cldr.SA ->
            "المملكة العربية السعودية"

        Cldr.SB ->
            "جزر سليمان"

        Cldr.SC ->
            "سيشل"

        Cldr.SD ->
            "السودان"

        Cldr.SE ->
            "السويد"

        Cldr.SG ->
            "سنغافورة"

        Cldr.SH ->
            "سانت هيلينا"

        Cldr.SI ->
            "سلوفينيا"

        Cldr.SJ ->
            "سفالبارد وجان ماين"

        Cldr.SK ->
            "سلوفاكيا"

        Cldr.SL ->
            "سيراليون"

        Cldr.SM ->
            "سان مارينو"

        Cldr.SN ->
            "السنغال"

        Cldr.SO ->
            "الصومال"

        Cldr.SR ->
            "سورينام"

        Cldr.SS ->
            "جنوب السودان"

        Cldr.ST ->
            "ساو تومي وبرينسيبي"

        Cldr.SV ->
            "السلفادور"

        Cldr.SX ->
            "سانت مارتن"

        Cldr.SY ->
            "سوريا"

        Cldr.SZ ->
            "إسواتيني"

        Cldr.TC ->
            "جزر توركس وكايكوس"

        Cldr.TD ->
            "تشاد"

        Cldr.TF ->
            "الأقاليم الجنوبية الفرنسية"

        Cldr.TG ->
            "توغو"

        Cldr.TH ->
            "تايلاند"

        Cldr.TJ ->
            "طاجيكستان"

        Cldr.TK ->
            "توكيلو"

        Cldr.TL ->
            "تيمور الشرقية"

        Cldr.TM ->
            "تركمانستان"

        Cldr.TN ->
            "تونس"

        Cldr.TO ->
            "تونغا"

        Cldr.TR ->
            "تركيا"

        Cldr.TT ->
            "ترينيداد وتوباغو"

        Cldr.TV ->
            "توفالو"

        Cldr.TW ->
            "تايوان"

        Cldr.TZ ->
            "تنزانيا"

        Cldr.UA ->
            "أوكرانيا"

        Cldr.UG ->
            "أوغندا"

        Cldr.UM ->
            "جزر الولايات المتحدة النائية"

        Cldr.US ->
            "الولايات المتحدة"

        Cldr.UY ->
            "أورغواي"

        Cldr.UZ ->
            "أوزبكستان"

        Cldr.VA ->
            "الفاتيكان"

        Cldr.VC ->
            "سانت فنسنت وجزر غرينادين"

        Cldr.VE ->
            "فنزويلا"

        Cldr.VG ->
            "جزر فيرجن البريطانية"

        Cldr.VI ->
            "جزر فيرجن التابعة للولايات المتحدة"

        Cldr.VN ->
            "فيتنام"

        Cldr.VU ->
            "فانواتو"

        Cldr.WF ->
            "جزر والس وفوتونا"

        Cldr.WS ->
            "ساموا"

        Cldr.XK ->
            "كوسوفو"

        Cldr.YE ->
            "اليمن"

        Cldr.YT ->
            "مايوت"

        Cldr.ZA ->
            "جنوب أفريقيا"

        Cldr.ZM ->
            "زامبيا"

        Cldr.ZW ->
            "زيمبابوي"