module Cldr.Bulgarian exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Bulgarian.

    AD Андора
    AE Обединени арабски емирства
    AF Афганистан
    AG Антигуа и Барбуда
    AI Ангуила
    AL Албания
    AM Армения
    AO Ангола
    AQ Антарктика
    AR Аржентина
    AS Американска Самоа
    AT Австрия
    AU Австралия
    AW Аруба
    AX Оландски острови
    AZ Азербайджан
    BA Босна и Херцеговина
    BB Барбадос
    BD Бангладеш
    BE Белгия
    BF Буркина Фасо
    BG България
    BH Бахрейн
    BI Бурунди
    BJ Бенин
    BL Сен Бартелеми
    BM Бермудски острови
    BN Бруней Даруссалам
    BO Боливия
    BQ Карибска Нидерландия
    BR Бразилия
    BS Бахамски острови
    BT Бутан
    BV остров Буве
    BW Ботсвана
    BY Беларус
    BZ Белиз
    CA Канада
    CC Кокосови острови (острови Кийлинг)
    CD Конго (ДРК)
    CF Централноафриканска република
    CG Конго (Република)
    CH Швейцария
    CI Кот д’Ивоар
    CK острови Кук
    CL Чили
    CM Камерун
    CN Китай
    CO Колумбия
    CR Коста Рика
    CU Куба
    CV Кабо Верде
    CW Кюрасао
    CX остров Рождество
    CY Кипър
    CZ Чешка република
    DE Германия
    DJ Джибути
    DK Дания
    DM Доминика
    DO Доминиканска република
    DZ Алжир
    EC Еквадор
    EE Естония
    EG Египет
    EH Западна Сахара
    ER Еритрея
    ES Испания
    ET Етиопия
    FI Финландия
    FJ Фиджи
    FK Фолкландски острови
    FM Микронезия
    FO Фарьорски острови
    FR Франция
    GA Габон
    GB Обединеното кралство
    GD Гренада
    GE Грузия
    GF Френска Гвиана
    GG Гърнзи
    GH Гана
    GI Гибралтар
    GL Гренландия
    GM Гамбия
    GN Гвинея
    GP Гваделупа
    GQ Екваториална Гвинея
    GR Гърция
    GS Южна Джорджия и Южни Сандвичеви острови
    GT Гватемала
    GU Гуам
    GW Гвинея-Бисау
    GY Гаяна
    HK Хонконг
    HM острови Хърд и Макдоналд
    HN Хондурас
    HR Хърватия
    HT Хаити
    HU Унгария
    ID Индонезия
    IE Ирландия
    IL Израел
    IM остров Ман
    IN Индия
    IO Британска територия в Индийския океан
    IQ Ирак
    IR Иран
    IS Исландия
    IT Италия
    JE Джърси
    JM Ямайка
    JO Йордания
    JP Япония
    KE Кения
    KG Киргизстан
    KH Камбоджа
    KI Кирибати
    KM Коморски острови
    KN Сейнт Китс и Невис
    KP Северна Корея
    KR Южна Корея
    KW Кувейт
    KY Кайманови острови
    KZ Казахстан
    LA Лаос
    LB Ливан
    LC Сейнт Лусия
    LI Лихтенщайн
    LK Шри Ланка
    LR Либерия
    LS Лесото
    LT Литва
    LU Люксембург
    LV Латвия
    LY Либия
    MA Мароко
    MC Монако
    MD Молдова
    ME Черна гора
    MF Сен Мартен
    MG Мадагаскар
    MH Маршалови острови
    MK Северна Македония
    ML Мали
    MM Мианмар (Бирма)
    MN Монголия
    MO Макао
    MP Северни Мариански острови
    MQ Мартиника
    MR Мавритания
    MS Монтсерат
    MT Малта
    MU Мавриций
    MV Малдиви
    MW Малави
    MX Мексико
    MY Малайзия
    MZ Мозамбик
    NA Намибия
    NC Нова Каледония
    NE Нигер
    NF остров Норфолк
    NG Нигерия
    NI Никарагуа
    NL Нидерландия
    NO Норвегия
    NP Непал
    NR Науру
    NU Ниуе
    NZ Нова Зеландия
    OM Оман
    PA Панама
    PE Перу
    PF Френска Полинезия
    PG Папуа-Нова Гвинея
    PH Филипини
    PK Пакистан
    PL Полша
    PM Сен Пиер и Микелон
    PN Острови Питкерн
    PR Пуерто Рико
    PS Палестина
    PT Португалия
    PW Палау
    PY Парагвай
    QA Катар
    RE Реюнион
    RO Румъния
    RS Сърбия
    RU Русия
    RW Руанда
    SA Саудитска Арабия
    SB Соломонови острови
    SC Сейшели
    SD Судан
    SE Швеция
    SG Сингапур
    SH Света Елена
    SI Словения
    SJ Свалбард и Ян Майен
    SK Словакия
    SL Сиера Леоне
    SM Сан Марино
    SN Сенегал
    SO Сомалия
    SR Суринам
    SS Южен Судан
    ST Сао Томе и Принсипи
    SV Салвадор
    SX Синт Мартен
    SY Сирия
    SZ Есватини
    TC острови Търкс и Кайкос
    TD Чад
    TF Френски южни територии
    TG Того
    TH Тайланд
    TJ Таджикистан
    TK Токелау
    TL Източен Тимор
    TM Туркменистан
    TN Тунис
    TO Тонга
    TR Турция
    TT Тринидад и Тобаго
    TV Тувалу
    TW Тайван
    TZ Танзания
    UA Украйна
    UG Уганда
    UM Отдалечени острови на САЩ
    US Съединени щати
    UY Уругвай
    UZ Узбекистан
    VA Ватикан
    VC Сейнт Винсънт и Гренадини
    VE Венецуела
    VG Британски Вирджински острови
    VI Американски Вирджински острови
    VN Виетнам
    VU Вануату
    WF Уолис и Футуна
    WS Самоа
    XK Косово
    YE Йемен
    YT Майот
    ZA Южна Африка
    ZM Замбия
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Андора"

        Cldr.AE ->
            "Обединени арабски емирства"

        Cldr.AF ->
            "Афганистан"

        Cldr.AG ->
            "Антигуа и Барбуда"

        Cldr.AI ->
            "Ангуила"

        Cldr.AL ->
            "Албания"

        Cldr.AM ->
            "Армения"

        Cldr.AO ->
            "Ангола"

        Cldr.AQ ->
            "Антарктика"

        Cldr.AR ->
            "Аржентина"

        Cldr.AS ->
            "Американска Самоа"

        Cldr.AT ->
            "Австрия"

        Cldr.AU ->
            "Австралия"

        Cldr.AW ->
            "Аруба"

        Cldr.AX ->
            "Оландски острови"

        Cldr.AZ ->
            "Азербайджан"

        Cldr.BA ->
            "Босна и Херцеговина"

        Cldr.BB ->
            "Барбадос"

        Cldr.BD ->
            "Бангладеш"

        Cldr.BE ->
            "Белгия"

        Cldr.BF ->
            "Буркина Фасо"

        Cldr.BG ->
            "България"

        Cldr.BH ->
            "Бахрейн"

        Cldr.BI ->
            "Бурунди"

        Cldr.BJ ->
            "Бенин"

        Cldr.BL ->
            "Сен Бартелеми"

        Cldr.BM ->
            "Бермудски острови"

        Cldr.BN ->
            "Бруней Даруссалам"

        Cldr.BO ->
            "Боливия"

        Cldr.BQ ->
            "Карибска Нидерландия"

        Cldr.BR ->
            "Бразилия"

        Cldr.BS ->
            "Бахамски острови"

        Cldr.BT ->
            "Бутан"

        Cldr.BV ->
            "остров Буве"

        Cldr.BW ->
            "Ботсвана"

        Cldr.BY ->
            "Беларус"

        Cldr.BZ ->
            "Белиз"

        Cldr.CA ->
            "Канада"

        Cldr.CC ->
            "Кокосови острови (острови Кийлинг)"

        Cldr.CD ->
            "Конго (ДРК)"

        Cldr.CF ->
            "Централноафриканска република"

        Cldr.CG ->
            "Конго (Република)"

        Cldr.CH ->
            "Швейцария"

        Cldr.CI ->
            "Кот д’Ивоар"

        Cldr.CK ->
            "острови Кук"

        Cldr.CL ->
            "Чили"

        Cldr.CM ->
            "Камерун"

        Cldr.CN ->
            "Китай"

        Cldr.CO ->
            "Колумбия"

        Cldr.CR ->
            "Коста Рика"

        Cldr.CU ->
            "Куба"

        Cldr.CV ->
            "Кабо Верде"

        Cldr.CW ->
            "Кюрасао"

        Cldr.CX ->
            "остров Рождество"

        Cldr.CY ->
            "Кипър"

        Cldr.CZ ->
            "Чешка република"

        Cldr.DE ->
            "Германия"

        Cldr.DJ ->
            "Джибути"

        Cldr.DK ->
            "Дания"

        Cldr.DM ->
            "Доминика"

        Cldr.DO ->
            "Доминиканска република"

        Cldr.DZ ->
            "Алжир"

        Cldr.EC ->
            "Еквадор"

        Cldr.EE ->
            "Естония"

        Cldr.EG ->
            "Египет"

        Cldr.EH ->
            "Западна Сахара"

        Cldr.ER ->
            "Еритрея"

        Cldr.ES ->
            "Испания"

        Cldr.ET ->
            "Етиопия"

        Cldr.FI ->
            "Финландия"

        Cldr.FJ ->
            "Фиджи"

        Cldr.FK ->
            "Фолкландски острови"

        Cldr.FM ->
            "Микронезия"

        Cldr.FO ->
            "Фарьорски острови"

        Cldr.FR ->
            "Франция"

        Cldr.GA ->
            "Габон"

        Cldr.GB ->
            "Обединеното кралство"

        Cldr.GD ->
            "Гренада"

        Cldr.GE ->
            "Грузия"

        Cldr.GF ->
            "Френска Гвиана"

        Cldr.GG ->
            "Гърнзи"

        Cldr.GH ->
            "Гана"

        Cldr.GI ->
            "Гибралтар"

        Cldr.GL ->
            "Гренландия"

        Cldr.GM ->
            "Гамбия"

        Cldr.GN ->
            "Гвинея"

        Cldr.GP ->
            "Гваделупа"

        Cldr.GQ ->
            "Екваториална Гвинея"

        Cldr.GR ->
            "Гърция"

        Cldr.GS ->
            "Южна Джорджия и Южни Сандвичеви острови"

        Cldr.GT_ ->
            "Гватемала"

        Cldr.GU ->
            "Гуам"

        Cldr.GW ->
            "Гвинея-Бисау"

        Cldr.GY ->
            "Гаяна"

        Cldr.HK ->
            "Хонконг"

        Cldr.HM ->
            "острови Хърд и Макдоналд"

        Cldr.HN ->
            "Хондурас"

        Cldr.HR ->
            "Хърватия"

        Cldr.HT ->
            "Хаити"

        Cldr.HU ->
            "Унгария"

        Cldr.ID ->
            "Индонезия"

        Cldr.IE ->
            "Ирландия"

        Cldr.IL ->
            "Израел"

        Cldr.IM ->
            "остров Ман"

        Cldr.IN ->
            "Индия"

        Cldr.IO ->
            "Британска територия в Индийския океан"

        Cldr.IQ ->
            "Ирак"

        Cldr.IR ->
            "Иран"

        Cldr.IS ->
            "Исландия"

        Cldr.IT ->
            "Италия"

        Cldr.JE ->
            "Джърси"

        Cldr.JM ->
            "Ямайка"

        Cldr.JO ->
            "Йордания"

        Cldr.JP ->
            "Япония"

        Cldr.KE ->
            "Кения"

        Cldr.KG ->
            "Киргизстан"

        Cldr.KH ->
            "Камбоджа"

        Cldr.KI ->
            "Кирибати"

        Cldr.KM ->
            "Коморски острови"

        Cldr.KN ->
            "Сейнт Китс и Невис"

        Cldr.KP ->
            "Северна Корея"

        Cldr.KR ->
            "Южна Корея"

        Cldr.KW ->
            "Кувейт"

        Cldr.KY ->
            "Кайманови острови"

        Cldr.KZ ->
            "Казахстан"

        Cldr.LA ->
            "Лаос"

        Cldr.LB ->
            "Ливан"

        Cldr.LC ->
            "Сейнт Лусия"

        Cldr.LI ->
            "Лихтенщайн"

        Cldr.LK ->
            "Шри Ланка"

        Cldr.LR ->
            "Либерия"

        Cldr.LS ->
            "Лесото"

        Cldr.LT_ ->
            "Литва"

        Cldr.LU ->
            "Люксембург"

        Cldr.LV ->
            "Латвия"

        Cldr.LY ->
            "Либия"

        Cldr.MA ->
            "Мароко"

        Cldr.MC ->
            "Монако"

        Cldr.MD ->
            "Молдова"

        Cldr.ME ->
            "Черна гора"

        Cldr.MF ->
            "Сен Мартен"

        Cldr.MG ->
            "Мадагаскар"

        Cldr.MH ->
            "Маршалови острови"

        Cldr.MK ->
            "Северна Македония"

        Cldr.ML ->
            "Мали"

        Cldr.MM ->
            "Мианмар (Бирма)"

        Cldr.MN ->
            "Монголия"

        Cldr.MO ->
            "Макао"

        Cldr.MP ->
            "Северни Мариански острови"

        Cldr.MQ ->
            "Мартиника"

        Cldr.MR ->
            "Мавритания"

        Cldr.MS ->
            "Монтсерат"

        Cldr.MT ->
            "Малта"

        Cldr.MU ->
            "Мавриций"

        Cldr.MV ->
            "Малдиви"

        Cldr.MW ->
            "Малави"

        Cldr.MX ->
            "Мексико"

        Cldr.MY ->
            "Малайзия"

        Cldr.MZ ->
            "Мозамбик"

        Cldr.NA ->
            "Намибия"

        Cldr.NC ->
            "Нова Каледония"

        Cldr.NE ->
            "Нигер"

        Cldr.NF ->
            "остров Норфолк"

        Cldr.NG ->
            "Нигерия"

        Cldr.NI ->
            "Никарагуа"

        Cldr.NL ->
            "Нидерландия"

        Cldr.NO ->
            "Норвегия"

        Cldr.NP ->
            "Непал"

        Cldr.NR ->
            "Науру"

        Cldr.NU ->
            "Ниуе"

        Cldr.NZ ->
            "Нова Зеландия"

        Cldr.OM ->
            "Оман"

        Cldr.PA ->
            "Панама"

        Cldr.PE ->
            "Перу"

        Cldr.PF ->
            "Френска Полинезия"

        Cldr.PG ->
            "Папуа-Нова Гвинея"

        Cldr.PH ->
            "Филипини"

        Cldr.PK ->
            "Пакистан"

        Cldr.PL ->
            "Полша"

        Cldr.PM ->
            "Сен Пиер и Микелон"

        Cldr.PN ->
            "Острови Питкерн"

        Cldr.PR ->
            "Пуерто Рико"

        Cldr.PS ->
            "Палестина"

        Cldr.PT ->
            "Португалия"

        Cldr.PW ->
            "Палау"

        Cldr.PY ->
            "Парагвай"

        Cldr.QA ->
            "Катар"

        Cldr.RE ->
            "Реюнион"

        Cldr.RO ->
            "Румъния"

        Cldr.RS ->
            "Сърбия"

        Cldr.RU ->
            "Русия"

        Cldr.RW ->
            "Руанда"

        Cldr.SA ->
            "Саудитска Арабия"

        Cldr.SB ->
            "Соломонови острови"

        Cldr.SC ->
            "Сейшели"

        Cldr.SD ->
            "Судан"

        Cldr.SE ->
            "Швеция"

        Cldr.SG ->
            "Сингапур"

        Cldr.SH ->
            "Света Елена"

        Cldr.SI ->
            "Словения"

        Cldr.SJ ->
            "Свалбард и Ян Майен"

        Cldr.SK ->
            "Словакия"

        Cldr.SL ->
            "Сиера Леоне"

        Cldr.SM ->
            "Сан Марино"

        Cldr.SN ->
            "Сенегал"

        Cldr.SO ->
            "Сомалия"

        Cldr.SR ->
            "Суринам"

        Cldr.SS ->
            "Южен Судан"

        Cldr.ST ->
            "Сао Томе и Принсипи"

        Cldr.SV ->
            "Салвадор"

        Cldr.SX ->
            "Синт Мартен"

        Cldr.SY ->
            "Сирия"

        Cldr.SZ ->
            "Есватини"

        Cldr.TC ->
            "острови Търкс и Кайкос"

        Cldr.TD ->
            "Чад"

        Cldr.TF ->
            "Френски южни територии"

        Cldr.TG ->
            "Того"

        Cldr.TH ->
            "Тайланд"

        Cldr.TJ ->
            "Таджикистан"

        Cldr.TK ->
            "Токелау"

        Cldr.TL ->
            "Източен Тимор"

        Cldr.TM ->
            "Туркменистан"

        Cldr.TN ->
            "Тунис"

        Cldr.TO ->
            "Тонга"

        Cldr.TR ->
            "Турция"

        Cldr.TT ->
            "Тринидад и Тобаго"

        Cldr.TV ->
            "Тувалу"

        Cldr.TW ->
            "Тайван"

        Cldr.TZ ->
            "Танзания"

        Cldr.UA ->
            "Украйна"

        Cldr.UG ->
            "Уганда"

        Cldr.UM ->
            "Отдалечени острови на САЩ"

        Cldr.US ->
            "Съединени щати"

        Cldr.UY ->
            "Уругвай"

        Cldr.UZ ->
            "Узбекистан"

        Cldr.VA ->
            "Ватикан"

        Cldr.VC ->
            "Сейнт Винсънт и Гренадини"

        Cldr.VE ->
            "Венецуела"

        Cldr.VG ->
            "Британски Вирджински острови"

        Cldr.VI ->
            "Американски Вирджински острови"

        Cldr.VN ->
            "Виетнам"

        Cldr.VU ->
            "Вануату"

        Cldr.WF ->
            "Уолис и Футуна"

        Cldr.WS ->
            "Самоа"

        Cldr.XK ->
            "Косово"

        Cldr.YE ->
            "Йемен"

        Cldr.YT ->
            "Майот"

        Cldr.ZA ->
            "Южна Африка"

        Cldr.ZM ->
            "Замбия"

        Cldr.ZW ->
            "Зимбабве"