module Cldr.Burmese exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Burmese.

    AD အန်ဒိုရာ
    AE ယူအေအီး
    AF အာဖဂန်နစ္စတန်
    AG အန်တီဂွါနှင့် ဘာဘူဒါ
    AI အန်ဂီလာ
    AL အယ်လ်ဘေးနီးယား
    AM အာမေးနီးယား
    AO အန်ဂိုလာ
    AQ အန်တာတိက
    AR အာဂျင်တီးနား
    AS အမေရိကန် ဆမိုးအား
    AT ဩစတြီးယား
    AU ဩစတြေးလျ
    AW အာရူးဗား
    AX အာလန်ကျွန်း
    AZ အဇာဘိုင်ဂျန်
    BA ဘော့စနီးယားနှင့် ဟာဇီဂိုဗီနား
    BB ဘာဘေးဒိုးစ်
    BD ဘင်္ဂလားဒေ့ရှ်
    BE ဘယ်လ်ဂျီယမ်
    BF ဘာကီးနား ဖားဆို
    BG ဘူလ်ဂေးရီးယား
    BH ဘာရိန်း
    BI ဘူရွန်ဒီ
    BJ ဘီနင်
    BL စိန့်ဘာသယ်လ်မီ
    BM ဘာမြူဒါ
    BN ဘရူနိုင်း
    BO ဘိုလီးဗီးယား
    BQ ကာရစ်ဘီယံ နယ်သာလန်
    BR ဘရာဇီး
    BS ဘဟားမား
    BT ဘူတန်
    BV ဘူဗက်ကျွန်း
    BW ဘော့ဆွာနာ
    BY ဘီလာရုစ်
    BZ ဘလိဇ်
    CA ကနေဒါ
    CC ကိုကိုးကျွန်း
    CD ကွန်ဂို ဒီမိုကရက်တစ် သမ္မတနိုင်ငံ
    CF ဗဟို အာဖရိက ပြည်ထောင်စု
    CG ကွန်ဂို သမ္မတနိုင်ငံ
    CH ဆွစ်ဇာလန်
    CI ကို့တ် ဒီဗွာ
    CK ကွတ် ကျွန်းစု
    CL ချီလီ
    CM ကင်မရွန်း
    CN တရုတ်
    CO ကိုလံဘီယာ
    CR ကို့စ်တာရီကာ
    CU ကျူးဘား
    CV ကိတ်ဗာဒီ
    CW ကျူရေးကိုးစ်
    CX ခရစ်စမတ် ကျွန်း
    CY ဆိုက်ပရပ်စ်
    CZ ချက် ပြည်ထောင်စု
    DE ဂျာမနီ
    DJ ဂျီဘူတီ
    DK ဒိန်းမတ်
    DM ဒိုမီနီကာ
    DO ဒိုမီနီကန်
    DZ အယ်လ်ဂျီးရီးယား
    EC အီကွေဒေါ
    EE အက်စတိုးနီးယား
    EG အီဂျစ်
    EH အနောက် ဆာဟာရ
    ER အီရီထရီးယား
    ES စပိန်
    ET အီသီယိုးပီးယား
    FI ဖင်လန်
    FJ ဖီဂျီ
    FK ဖော့ကလန် ကျွန်းစု
    FM မိုင်ခရိုနီရှား
    FO ဖာရိုး ကျွန်းစုများ
    FR ပြင်သစ်
    GA ဂါဘွန်
    GB ယူနိုက်တက်ကင်းဒမ်း
    GD ဂရီနေဒါ
    GE ဂျော်ဂျီယာ
    GF ပြင်သစ် ဂီယာနာ
    GG ဂွန်းဇီ
    GH ဂါနာ
    GI ဂျီဘရော်လ်တာ
    GL ဂရင်းလန်း
    GM ဂမ်ဘီရာ
    GN ဂီနီ
    GP ဂွါဒီလု
    GQ အီကွေတာ ဂီနီ
    GR ဂရိ
    GS တောင် ဂျော်ဂျီယာ နှင့် တောင် ဆင်းဒဝစ်ဂျ် ကျွန်းစုများ
    GT ဂွါတီမာလာ
    GU ဂူအမ်
    GW ဂီနီ-ဘီစော
    GY ဂိုင်ယာနာ
    HK ဟောင်ကောင်
    HM ဟတ်ကျွန်းနှင့်မက်ဒေါနယ်ကျွန်းစု
    HN ဟွန်ဒူးရပ်စ်
    HR ခရိုအေးရှား
    HT ဟေတီ
    HU ဟန်ဂေရီ
    ID အင်ဒိုနီးရှား
    IE အိုင်ယာလန်
    IL အစ္စရေး
    IM မန်ကျွန်း
    IN အိန္ဒိယ
    IO ဗြိတိသျှပိုင် အိန္ဒိယသမုဒ္ဒရာကျွန်းများ
    IQ အီရတ်
    IR အီရန်
    IS အိုက်စလန်
    IT အီတလီ
    JE ဂျာစီ
    JM ဂျမေကာ
    JO ဂျော်ဒန်
    JP ဂျပန်
    KE ကင်ညာ
    KG ကာဂျစ္စတန်
    KH ကမ္ဘောဒီးယား
    KI ခီရီဘာတီ
    KM ကိုမိုရိုစ်
    KN စိန့်ကစ်နှင့်နီဗီစ်
    KP မြောက်ကိုရီးယား
    KR တောင်ကိုရီးယား
    KW ကူဝိတ်
    KY ကေမန် ကျွန်းစု
    KZ ကာဇက်စတန်
    LA လာအို
    LB လက်ဘနွန်
    LC စိန့်လူစီယာ
    LI လစ်တန်စတိန်း
    LK သီရိလင်္ကာ
    LR လိုက်ဘေးရီးယား
    LS လီဆိုသို
    LT လစ်သူဝေးနီးယား
    LU လူဇင်ဘတ်
    LV လတ်ဗီးယား
    LY လစ်ဗျား
    MA မော်ရိုကို
    MC မိုနာကို
    MD မောလ်ဒိုဗာ
    ME မွန်တီနိဂရိုး
    MF စိန့်မာတင်
    MG မဒါဂတ်စကား
    MH မာရှယ် ကျွန်းစု
    MK မြောက် မက်ဆီဒိုးနီးယား
    ML မာလီ
    MM မြန်မာ
    MN မွန်ဂိုးလီးယား
    MO မကာအို
    MP မြောက်ပိုင်းမာရီအာနာကျွန်းစု
    MQ မာတီနိခ်
    MR မော်ရီတေးနီးယား
    MS မောင့်စဲရက်
    MT မောလ်တာ
    MU မောရစ်ရှ
    MV မော်လ်ဒိုက်
    MW မာလာဝီ
    MX မက်ကဆီကို
    MY မလေးရှား
    MZ မိုဇမ်ဘစ်
    NA နမီးဘီးယား
    NC နယူး ကယ်လီဒိုနီးယား
    NE နိုင်ဂျာ
    NF နောဖုတ်ကျွန်း
    NG နိုင်ဂျီးရီးယား
    NI နီကာရာဂွါ
    NL နယ်သာလန်
    NO နော်ဝေ
    NP နီပေါ
    NR နော်ရူး
    NU နီဥူအေ
    NZ နယူးဇီလန်
    OM အိုမန်
    PA ပနားမား
    PE ပီရူး
    PF ပြင်သစ် ပေါ်လီနီးရှား
    PG ပါပူအာ နယူးဂီနီ
    PH ဖိလစ်ပိုင်
    PK ပါကစ္စတန်
    PL ပိုလန်
    PM စိန့်ပီအဲရ်နှင့် မီကွီလွန်
    PN ပစ်တ်ကိန်းကျွန်းစု
    PR ပေါ်တိုရီကို
    PS ပါလက်စတိုင်း
    PT ပေါ်တူဂီ
    PW ပလာအို
    PY ပါရာဂွေး
    QA ကာတာ
    RE ရီယူနီယန်
    RO ရိုမေးနီးယား
    RS ဆားဘီးယား
    RU ရုရှား
    RW ရဝန်ဒါ
    SA ဆော်ဒီအာရေးဘီးယား
    SB ဆော်လမွန်ကျွန်းစု
    SC ဆေးရှဲ
    SD ဆူဒန်
    SE ဆွီဒင်
    SG စင်္ကာပူ
    SH စိန့်ဟယ်လယ်နာ
    SI ဆလိုဗေးနီးယား
    SJ စဗိုလ်ဘတ်နှင့်ဂျန်မေရန်
    SK ဆလိုဗက်ကီးယား
    SL ဆီယာရာ လီယွန်း
    SM ဆန်မာရီနို
    SN ဆီနီဂေါ
    SO ဆိုမာလီယာ
    SR ဆူရာနမ်
    SS တောင် ဆူဒန်
    ST ဆောင်တူမေးနှင့် ပရင်စီပီ
    SV အယ်လ်ဆာဗေးဒိုး
    SX စင့်မာတင်
    SY ဆီးရီးယား
    SZ ဆွာဇီလန်
    TC တခ်စ်နှင့်ကာအီကိုစ်ကျွန်းစု
    TD ချဒ်
    TF ပြင်သစ် တောင်ပိုင်း ပိုင်နက်များ
    TG တိုဂို
    TH ထိုင်း
    TJ တာဂျီကစ္စတန်
    TK တိုကလောင်
    TL အရှေ့တီမော
    TM တာ့ခ်မင်နစ္စတန်
    TN တူနီးရှား
    TO တွန်ဂါ
    TR တူရကီ
    TT ထရီနီဒတ်နှင့် တိုဘက်ဂို
    TV တူဗားလူ
    TW ထိုင်ဝမ်
    TZ တန်ဇန်းနီးယား
    UA ယူကရိန်း
    UG ယူဂန်းဒါး
    UM ယူနိုက်တက်စတိတ် ကျွန်းနိုင်ငံများ
    US အမေရိကန် ပြည်ထောင်စု
    UY ဥရုဂွေး
    UZ ဥဇဘက်ကစ္စတန်
    VA ဗာတီကန်စီးတီး
    VC စိန့်ဗင်းဆင့်နှင့် ဂရိနေဒိုင်
    VE ဗင်နီဇွဲလား
    VG ဗြိတိသျှ ဗာဂျင်း ကျွန်းစု
    VI ယူအက်စ် ဗာဂျင်း ကျွန်းစု
    VN ဗီယက်နမ်
    VU ဗနွားတူ
    WF ဝေါလစ်နှင့် ဖူကျူးနား
    WS ဆမိုးအား
    XK ကိုဆိုဗို
    YE ယီမင်
    YT မေယော့
    ZA တောင်အာဖရိက
    ZM ဇမ်ဘီယာ
    ZW ဇင်ဘာဘွေ
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "အန်ဒိုရာ"

        Cldr.AE ->
            "ယူအေအီး"

        Cldr.AF ->
            "အာဖဂန်နစ္စတန်"

        Cldr.AG ->
            "အန်တီဂွါနှင့် ဘာဘူဒါ"

        Cldr.AI ->
            "အန်ဂီလာ"

        Cldr.AL ->
            "အယ်လ်ဘေးနီးယား"

        Cldr.AM ->
            "အာမေးနီးယား"

        Cldr.AO ->
            "အန်ဂိုလာ"

        Cldr.AQ ->
            "အန်တာတိက"

        Cldr.AR ->
            "အာဂျင်တီးနား"

        Cldr.AS ->
            "အမေရိကန် ဆမိုးအား"

        Cldr.AT ->
            "ဩစတြီးယား"

        Cldr.AU ->
            "ဩစတြေးလျ"

        Cldr.AW ->
            "အာရူးဗား"

        Cldr.AX ->
            "အာလန်ကျွန်း"

        Cldr.AZ ->
            "အဇာဘိုင်ဂျန်"

        Cldr.BA ->
            "ဘော့စနီးယားနှင့် ဟာဇီဂိုဗီနား"

        Cldr.BB ->
            "ဘာဘေးဒိုးစ်"

        Cldr.BD ->
            "ဘင်္ဂလားဒေ့ရှ်"

        Cldr.BE ->
            "ဘယ်လ်ဂျီယမ်"

        Cldr.BF ->
            "ဘာကီးနား ဖားဆို"

        Cldr.BG ->
            "ဘူလ်ဂေးရီးယား"

        Cldr.BH ->
            "ဘာရိန်း"

        Cldr.BI ->
            "ဘူရွန်ဒီ"

        Cldr.BJ ->
            "ဘီနင်"

        Cldr.BL ->
            "စိန့်ဘာသယ်လ်မီ"

        Cldr.BM ->
            "ဘာမြူဒါ"

        Cldr.BN ->
            "ဘရူနိုင်း"

        Cldr.BO ->
            "ဘိုလီးဗီးယား"

        Cldr.BQ ->
            "ကာရစ်ဘီယံ နယ်သာလန်"

        Cldr.BR ->
            "ဘရာဇီး"

        Cldr.BS ->
            "ဘဟားမား"

        Cldr.BT ->
            "ဘူတန်"

        Cldr.BV ->
            "ဘူဗက်ကျွန်း"

        Cldr.BW ->
            "ဘော့ဆွာနာ"

        Cldr.BY ->
            "ဘီလာရုစ်"

        Cldr.BZ ->
            "ဘလိဇ်"

        Cldr.CA ->
            "ကနေဒါ"

        Cldr.CC ->
            "ကိုကိုးကျွန်း"

        Cldr.CD ->
            "ကွန်ဂို ဒီမိုကရက်တစ် သမ္မတနိုင်ငံ"

        Cldr.CF ->
            "ဗဟို အာဖရိက ပြည်ထောင်စု"

        Cldr.CG ->
            "ကွန်ဂို သမ္မတနိုင်ငံ"

        Cldr.CH ->
            "ဆွစ်ဇာလန်"

        Cldr.CI ->
            "ကို့တ် ဒီဗွာ"

        Cldr.CK ->
            "ကွတ် ကျွန်းစု"

        Cldr.CL ->
            "ချီလီ"

        Cldr.CM ->
            "ကင်မရွန်း"

        Cldr.CN ->
            "တရုတ်"

        Cldr.CO ->
            "ကိုလံဘီယာ"

        Cldr.CR ->
            "ကို့စ်တာရီကာ"

        Cldr.CU ->
            "ကျူးဘား"

        Cldr.CV ->
            "ကိတ်ဗာဒီ"

        Cldr.CW ->
            "ကျူရေးကိုးစ်"

        Cldr.CX ->
            "ခရစ်စမတ် ကျွန်း"

        Cldr.CY ->
            "ဆိုက်ပရပ်စ်"

        Cldr.CZ ->
            "ချက် ပြည်ထောင်စု"

        Cldr.DE ->
            "ဂျာမနီ"

        Cldr.DJ ->
            "ဂျီဘူတီ"

        Cldr.DK ->
            "ဒိန်းမတ်"

        Cldr.DM ->
            "ဒိုမီနီကာ"

        Cldr.DO ->
            "ဒိုမီနီကန်"

        Cldr.DZ ->
            "အယ်လ်ဂျီးရီးယား"

        Cldr.EC ->
            "အီကွေဒေါ"

        Cldr.EE ->
            "အက်စတိုးနီးယား"

        Cldr.EG ->
            "အီဂျစ်"

        Cldr.EH ->
            "အနောက် ဆာဟာရ"

        Cldr.ER ->
            "အီရီထရီးယား"

        Cldr.ES ->
            "စပိန်"

        Cldr.ET ->
            "အီသီယိုးပီးယား"

        Cldr.FI ->
            "ဖင်လန်"

        Cldr.FJ ->
            "ဖီဂျီ"

        Cldr.FK ->
            "ဖော့ကလန် ကျွန်းစု"

        Cldr.FM ->
            "မိုင်ခရိုနီရှား"

        Cldr.FO ->
            "ဖာရိုး ကျွန်းစုများ"

        Cldr.FR ->
            "ပြင်သစ်"

        Cldr.GA ->
            "ဂါဘွန်"

        Cldr.GB ->
            "ယူနိုက်တက်ကင်းဒမ်း"

        Cldr.GD ->
            "ဂရီနေဒါ"

        Cldr.GE ->
            "ဂျော်ဂျီယာ"

        Cldr.GF ->
            "ပြင်သစ် ဂီယာနာ"

        Cldr.GG ->
            "ဂွန်းဇီ"

        Cldr.GH ->
            "ဂါနာ"

        Cldr.GI ->
            "ဂျီဘရော်လ်တာ"

        Cldr.GL ->
            "ဂရင်းလန်း"

        Cldr.GM ->
            "ဂမ်ဘီရာ"

        Cldr.GN ->
            "ဂီနီ"

        Cldr.GP ->
            "ဂွါဒီလု"

        Cldr.GQ ->
            "အီကွေတာ ဂီနီ"

        Cldr.GR ->
            "ဂရိ"

        Cldr.GS ->
            "တောင် ဂျော်ဂျီယာ နှင့် တောင် ဆင်းဒဝစ်ဂျ် ကျွန်းစုများ"

        Cldr.GT_ ->
            "ဂွါတီမာလာ"

        Cldr.GU ->
            "ဂူအမ်"

        Cldr.GW ->
            "ဂီနီ-ဘီစော"

        Cldr.GY ->
            "ဂိုင်ယာနာ"

        Cldr.HK ->
            "ဟောင်ကောင်"

        Cldr.HM ->
            "ဟတ်ကျွန်းနှင့်မက်ဒေါနယ်ကျွန်းစု"

        Cldr.HN ->
            "ဟွန်ဒူးရပ်စ်"

        Cldr.HR ->
            "ခရိုအေးရှား"

        Cldr.HT ->
            "ဟေတီ"

        Cldr.HU ->
            "ဟန်ဂေရီ"

        Cldr.ID ->
            "အင်ဒိုနီးရှား"

        Cldr.IE ->
            "အိုင်ယာလန်"

        Cldr.IL ->
            "အစ္စရေး"

        Cldr.IM ->
            "မန်ကျွန်း"

        Cldr.IN ->
            "အိန္ဒိယ"

        Cldr.IO ->
            "ဗြိတိသျှပိုင် အိန္ဒိယသမုဒ္ဒရာကျွန်းများ"

        Cldr.IQ ->
            "အီရတ်"

        Cldr.IR ->
            "အီရန်"

        Cldr.IS ->
            "အိုက်စလန်"

        Cldr.IT ->
            "အီတလီ"

        Cldr.JE ->
            "ဂျာစီ"

        Cldr.JM ->
            "ဂျမေကာ"

        Cldr.JO ->
            "ဂျော်ဒန်"

        Cldr.JP ->
            "ဂျပန်"

        Cldr.KE ->
            "ကင်ညာ"

        Cldr.KG ->
            "ကာဂျစ္စတန်"

        Cldr.KH ->
            "ကမ္ဘောဒီးယား"

        Cldr.KI ->
            "ခီရီဘာတီ"

        Cldr.KM ->
            "ကိုမိုရိုစ်"

        Cldr.KN ->
            "စိန့်ကစ်နှင့်နီဗီစ်"

        Cldr.KP ->
            "မြောက်ကိုရီးယား"

        Cldr.KR ->
            "တောင်ကိုရီးယား"

        Cldr.KW ->
            "ကူဝိတ်"

        Cldr.KY ->
            "ကေမန် ကျွန်းစု"

        Cldr.KZ ->
            "ကာဇက်စတန်"

        Cldr.LA ->
            "လာအို"

        Cldr.LB ->
            "လက်ဘနွန်"

        Cldr.LC ->
            "စိန့်လူစီယာ"

        Cldr.LI ->
            "လစ်တန်စတိန်း"

        Cldr.LK ->
            "သီရိလင်္ကာ"

        Cldr.LR ->
            "လိုက်ဘေးရီးယား"

        Cldr.LS ->
            "လီဆိုသို"

        Cldr.LT_ ->
            "လစ်သူဝေးနီးယား"

        Cldr.LU ->
            "လူဇင်ဘတ်"

        Cldr.LV ->
            "လတ်ဗီးယား"

        Cldr.LY ->
            "လစ်ဗျား"

        Cldr.MA ->
            "မော်ရိုကို"

        Cldr.MC ->
            "မိုနာကို"

        Cldr.MD ->
            "မောလ်ဒိုဗာ"

        Cldr.ME ->
            "မွန်တီနိဂရိုး"

        Cldr.MF ->
            "စိန့်မာတင်"

        Cldr.MG ->
            "မဒါဂတ်စကား"

        Cldr.MH ->
            "မာရှယ် ကျွန်းစု"

        Cldr.MK ->
            "မြောက် မက်ဆီဒိုးနီးယား"

        Cldr.ML ->
            "မာလီ"

        Cldr.MM ->
            "မြန်မာ"

        Cldr.MN ->
            "မွန်ဂိုးလီးယား"

        Cldr.MO ->
            "မကာအို"

        Cldr.MP ->
            "မြောက်ပိုင်းမာရီအာနာကျွန်းစု"

        Cldr.MQ ->
            "မာတီနိခ်"

        Cldr.MR ->
            "မော်ရီတေးနီးယား"

        Cldr.MS ->
            "မောင့်စဲရက်"

        Cldr.MT ->
            "မောလ်တာ"

        Cldr.MU ->
            "မောရစ်ရှ"

        Cldr.MV ->
            "မော်လ်ဒိုက်"

        Cldr.MW ->
            "မာလာဝီ"

        Cldr.MX ->
            "မက်ကဆီကို"

        Cldr.MY ->
            "မလေးရှား"

        Cldr.MZ ->
            "မိုဇမ်ဘစ်"

        Cldr.NA ->
            "နမီးဘီးယား"

        Cldr.NC ->
            "နယူး ကယ်လီဒိုနီးယား"

        Cldr.NE ->
            "နိုင်ဂျာ"

        Cldr.NF ->
            "နောဖုတ်ကျွန်း"

        Cldr.NG ->
            "နိုင်ဂျီးရီးယား"

        Cldr.NI ->
            "နီကာရာဂွါ"

        Cldr.NL ->
            "နယ်သာလန်"

        Cldr.NO ->
            "နော်ဝေ"

        Cldr.NP ->
            "နီပေါ"

        Cldr.NR ->
            "နော်ရူး"

        Cldr.NU ->
            "နီဥူအေ"

        Cldr.NZ ->
            "နယူးဇီလန်"

        Cldr.OM ->
            "အိုမန်"

        Cldr.PA ->
            "ပနားမား"

        Cldr.PE ->
            "ပီရူး"

        Cldr.PF ->
            "ပြင်သစ် ပေါ်လီနီးရှား"

        Cldr.PG ->
            "ပါပူအာ နယူးဂီနီ"

        Cldr.PH ->
            "ဖိလစ်ပိုင်"

        Cldr.PK ->
            "ပါကစ္စတန်"

        Cldr.PL ->
            "ပိုလန်"

        Cldr.PM ->
            "စိန့်ပီအဲရ်နှင့် မီကွီလွန်"

        Cldr.PN ->
            "ပစ်တ်ကိန်းကျွန်းစု"

        Cldr.PR ->
            "ပေါ်တိုရီကို"

        Cldr.PS ->
            "ပါလက်စတိုင်း"

        Cldr.PT ->
            "ပေါ်တူဂီ"

        Cldr.PW ->
            "ပလာအို"

        Cldr.PY ->
            "ပါရာဂွေး"

        Cldr.QA ->
            "ကာတာ"

        Cldr.RE ->
            "ရီယူနီယန်"

        Cldr.RO ->
            "ရိုမေးနီးယား"

        Cldr.RS ->
            "ဆားဘီးယား"

        Cldr.RU ->
            "ရုရှား"

        Cldr.RW ->
            "ရဝန်ဒါ"

        Cldr.SA ->
            "ဆော်ဒီအာရေးဘီးယား"

        Cldr.SB ->
            "ဆော်လမွန်ကျွန်းစု"

        Cldr.SC ->
            "ဆေးရှဲ"

        Cldr.SD ->
            "ဆူဒန်"

        Cldr.SE ->
            "ဆွီဒင်"

        Cldr.SG ->
            "စင်္ကာပူ"

        Cldr.SH ->
            "စိန့်ဟယ်လယ်နာ"

        Cldr.SI ->
            "ဆလိုဗေးနီးယား"

        Cldr.SJ ->
            "စဗိုလ်ဘတ်နှင့်ဂျန်မေရန်"

        Cldr.SK ->
            "ဆလိုဗက်ကီးယား"

        Cldr.SL ->
            "ဆီယာရာ လီယွန်း"

        Cldr.SM ->
            "ဆန်မာရီနို"

        Cldr.SN ->
            "ဆီနီဂေါ"

        Cldr.SO ->
            "ဆိုမာလီယာ"

        Cldr.SR ->
            "ဆူရာနမ်"

        Cldr.SS ->
            "တောင် ဆူဒန်"

        Cldr.ST ->
            "ဆောင်တူမေးနှင့် ပရင်စီပီ"

        Cldr.SV ->
            "အယ်လ်ဆာဗေးဒိုး"

        Cldr.SX ->
            "စင့်မာတင်"

        Cldr.SY ->
            "ဆီးရီးယား"

        Cldr.SZ ->
            "ဆွာဇီလန်"

        Cldr.TC ->
            "တခ်စ်နှင့်ကာအီကိုစ်ကျွန်းစု"

        Cldr.TD ->
            "ချဒ်"

        Cldr.TF ->
            "ပြင်သစ် တောင်ပိုင်း ပိုင်နက်များ"

        Cldr.TG ->
            "တိုဂို"

        Cldr.TH ->
            "ထိုင်း"

        Cldr.TJ ->
            "တာဂျီကစ္စတန်"

        Cldr.TK ->
            "တိုကလောင်"

        Cldr.TL ->
            "အရှေ့တီမော"

        Cldr.TM ->
            "တာ့ခ်မင်နစ္စတန်"

        Cldr.TN ->
            "တူနီးရှား"

        Cldr.TO ->
            "တွန်ဂါ"

        Cldr.TR ->
            "တူရကီ"

        Cldr.TT ->
            "ထရီနီဒတ်နှင့် တိုဘက်ဂို"

        Cldr.TV ->
            "တူဗားလူ"

        Cldr.TW ->
            "ထိုင်ဝမ်"

        Cldr.TZ ->
            "တန်ဇန်းနီးယား"

        Cldr.UA ->
            "ယူကရိန်း"

        Cldr.UG ->
            "ယူဂန်းဒါး"

        Cldr.UM ->
            "ယူနိုက်တက်စတိတ် ကျွန်းနိုင်ငံများ"

        Cldr.US ->
            "အမေရိကန် ပြည်ထောင်စု"

        Cldr.UY ->
            "ဥရုဂွေး"

        Cldr.UZ ->
            "ဥဇဘက်ကစ္စတန်"

        Cldr.VA ->
            "ဗာတီကန်စီးတီး"

        Cldr.VC ->
            "စိန့်ဗင်းဆင့်နှင့် ဂရိနေဒိုင်"

        Cldr.VE ->
            "ဗင်နီဇွဲလား"

        Cldr.VG ->
            "ဗြိတိသျှ ဗာဂျင်း ကျွန်းစု"

        Cldr.VI ->
            "ယူအက်စ် ဗာဂျင်း ကျွန်းစု"

        Cldr.VN ->
            "ဗီယက်နမ်"

        Cldr.VU ->
            "ဗနွားတူ"

        Cldr.WF ->
            "ဝေါလစ်နှင့် ဖူကျူးနား"

        Cldr.WS ->
            "ဆမိုးအား"

        Cldr.XK ->
            "ကိုဆိုဗို"

        Cldr.YE ->
            "ယီမင်"

        Cldr.YT ->
            "မေယော့"

        Cldr.ZA ->
            "တောင်အာဖရိက"

        Cldr.ZM ->
            "ဇမ်ဘီယာ"

        Cldr.ZW ->
            "ဇင်ဘာဘွေ"