module Cldr.Georgian exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Georgian.

    AD ანდორა
    AE არაბთა გაერთიანებული საამიროები
    AF ავღანეთი
    AG ანტიგუა და ბარბუდა
    AI ანგილია
    AL ალბანეთი
    AM სომხეთი
    AO ანგოლა
    AQ ანტარქტიკა
    AR არგენტინა
    AS ამერიკის სამოა
    AT ავსტრია
    AU ავსტრალია
    AW არუბა
    AX ალანდის კუნძულები
    AZ აზერბაიჯანი
    BA ბოსნია და ჰერცეგოვინა
    BB ბარბადოსი
    BD ბანგლადეში
    BE ბელგია
    BF ბურკინა-ფასო
    BG ბულგარეთი
    BH ბაჰრეინი
    BI ბურუნდი
    BJ ბენინი
    BL სენ-ბართელმი
    BM ბერმუდა
    BN ბრუნეი
    BO ბოლივია
    BQ კარიბის ნიდერლანდები
    BR ბრაზილია
    BS ბაჰამის კუნძულები
    BT ბუტანი
    BV ბუვე
    BW ბოტსვანა
    BY ბელარუსი
    BZ ბელიზი
    CA კანადა
    CC ქოქოსის (კილინგის) კუნძულები
    CD კონგო - კინშასა
    CF ცენტრალური აფრიკის რესპუბლიკა
    CG კონგო - ბრაზავილი
    CH შვეიცარია
    CI კოტ-დივუარი
    CK კუკის კუნძულები
    CL ჩილე
    CM კამერუნი
    CN ჩინეთი
    CO კოლუმბია
    CR კოსტა-რიკა
    CU კუბა
    CV კაბო-ვერდე
    CW კიურასაო
    CX შობის კუნძული
    CY კვიპროსი
    CZ ჩეხეთი
    DE გერმანია
    DJ ჯიბუტი
    DK დანია
    DM დომინიკა
    DO დომინიკელთა რესპუბლიკა
    DZ ალჟირი
    EC ეკვადორი
    EE ესტონეთი
    EG ეგვიპტე
    EH დასავლეთ საჰარა
    ER ერიტრეა
    ES ესპანეთი
    ET ეთიოპია
    FI ფინეთი
    FJ ფიჯი
    FK ფოლკლენდის კუნძულები
    FM მიკრონეზია
    FO ფარერის კუნძულები
    FR საფრანგეთი
    GA გაბონი
    GB გაერთიანებული სამეფო
    GD გრენადა
    GE საქართველო
    GF საფრანგეთის გვიანა
    GG გერნსი
    GH განა
    GI გიბრალტარი
    GL გრენლანდია
    GM გამბია
    GN გვინეა
    GP გვადელუპა
    GQ ეკვატორული გვინეა
    GR საბერძნეთი
    GS სამხრეთ ჯორჯია და სამხრეთ სენდვიჩის კუნძულები
    GT გვატემალა
    GU გუამი
    GW გვინეა-ბისაუ
    GY გაიანა
    HK ჰონკონგის სპეციალური ადმინისტრაციული რეგიონი, ჩინეთი
    HM ჰერდი და მაკდონალდის კუნძულები
    HN ჰონდურასი
    HR ხორვატია
    HT ჰაიტი
    HU უნგრეთი
    ID ინდონეზია
    IE ირლანდია
    IL ისრაელი
    IM მენის კუნძული
    IN ინდოეთი
    IO ბრიტანეთის ტერიტორია ინდოეთის ოკეანეში
    IQ ერაყი
    IR ირანი
    IS ისლანდია
    IT იტალია
    JE ჯერსი
    JM იამაიკა
    JO იორდანია
    JP იაპონია
    KE კენია
    KG ყირგიზეთი
    KH კამბოჯა
    KI კირიბატი
    KM კომორის კუნძულები
    KN სენტ-კიტსი და ნევისი
    KP ჩრდილოეთ კორეა
    KR სამხრეთ კორეა
    KW ქუვეითი
    KY კაიმანის კუნძულები
    KZ ყაზახეთი
    LA ლაოსი
    LB ლიბანი
    LC სენტ-ლუსია
    LI ლიხტენშტაინი
    LK შრი-ლანკა
    LR ლიბერია
    LS ლესოთო
    LT ლიეტუვა
    LU ლუქსემბურგი
    LV ლატვია
    LY ლიბია
    MA მაროკო
    MC მონაკო
    MD მოლდოვა
    ME მონტენეგრო
    MF სენ-მარტენი
    MG მადაგასკარი
    MH მარშალის კუნძულები
    MK ჩრდილოეთ მაკედონია
    ML მალი
    MM მიანმარი (ბირმა)
    MN მონღოლეთი
    MO მაკაოს სპეციალური ადმინისტრაციული რეგიონი, ჩინეთი
    MP ჩრდილოეთ მარიანას კუნძულები
    MQ მარტინიკა
    MR მავრიტანია
    MS მონსერატი
    MT მალტა
    MU მავრიკი
    MV მალდივები
    MW მალავი
    MX მექსიკა
    MY მალაიზია
    MZ მოზამბიკი
    NA ნამიბია
    NC ახალი კალედონია
    NE ნიგერი
    NF ნორფოლკის კუნძული
    NG ნიგერია
    NI ნიკარაგუა
    NL ნიდერლანდები
    NO ნორვეგია
    NP ნეპალი
    NR ნაურუ
    NU ნიუე
    NZ ახალი ზელანდია
    OM ომანი
    PA პანამა
    PE პერუ
    PF საფრანგეთის პოლინეზია
    PG პაპუა-ახალი გვინეა
    PH ფილიპინები
    PK პაკისტანი
    PL პოლონეთი
    PM სენ-პიერი და მიკელონი
    PN პიტკერნის კუნძულები
    PR პუერტო-რიკო
    PS პალესტინის ტერიტორიები
    PT პორტუგალია
    PW პალაუ
    PY პარაგვაი
    QA კატარი
    RE რეუნიონი
    RO რუმინეთი
    RS სერბეთი
    RU რუსეთი
    RW რუანდა
    SA საუდის არაბეთი
    SB სოლომონის კუნძულები
    SC სეიშელის კუნძულები
    SD სუდანი
    SE შვედეთი
    SG სინგაპური
    SH წმინდა ელენეს კუნძული
    SI სლოვენია
    SJ შპიცბერგენი და იან-მაიენი
    SK სლოვაკეთი
    SL სიერა-ლეონე
    SM სან-მარინო
    SN სენეგალი
    SO სომალი
    SR სურინამი
    SS სამხრეთ სუდანი
    ST სან-ტომე და პრინსიპი
    SV სალვადორი
    SX სინტ-მარტენი
    SY სირია
    SZ სვაზილენდი
    TC თერქს-ქაიქოსის კუნძულები
    TD ჩადი
    TF ფრანგული სამხრეთის ტერიტორიები
    TG ტოგო
    TH ტაილანდი
    TJ ტაჯიკეთი
    TK ტოკელაუ
    TL ტიმორ-ლესტე
    TM თურქმენეთი
    TN ტუნისი
    TO ტონგა
    TR თურქეთი
    TT ტრინიდადი და ტობაგო
    TV ტუვალუ
    TW ტაივანი
    TZ ტანზანია
    UA უკრაინა
    UG უგანდა
    UM აშშ-ის შორეული კუნძულები
    US ამერიკის შეერთებული შტატები
    UY ურუგვაი
    UZ უზბეკეთი
    VA ქალაქი ვატიკანი
    VC სენტ-ვინსენტი და გრენადინები
    VE ვენესუელა
    VG ბრიტანეთის ვირჯინის კუნძულები
    VI აშშ-ის ვირჯინის კუნძულები
    VN ვიეტნამი
    VU ვანუატუ
    WF უოლისი და ფუტუნა
    WS სამოა
    XK კოსოვო
    YE იემენი
    YT მაიოტა
    ZA სამხრეთ აფრიკის რესპუბლიკა
    ZM ზამბია
    ZW ზიმბაბვე
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "ანდორა"

        Cldr.AE ->
            "არაბთა გაერთიანებული საამიროები"

        Cldr.AF ->
            "ავღანეთი"

        Cldr.AG ->
            "ანტიგუა და ბარბუდა"

        Cldr.AI ->
            "ანგილია"

        Cldr.AL ->
            "ალბანეთი"

        Cldr.AM ->
            "სომხეთი"

        Cldr.AO ->
            "ანგოლა"

        Cldr.AQ ->
            "ანტარქტიკა"

        Cldr.AR ->
            "არგენტინა"

        Cldr.AS ->
            "ამერიკის სამოა"

        Cldr.AT ->
            "ავსტრია"

        Cldr.AU ->
            "ავსტრალია"

        Cldr.AW ->
            "არუბა"

        Cldr.AX ->
            "ალანდის კუნძულები"

        Cldr.AZ ->
            "აზერბაიჯანი"

        Cldr.BA ->
            "ბოსნია და ჰერცეგოვინა"

        Cldr.BB ->
            "ბარბადოსი"

        Cldr.BD ->
            "ბანგლადეში"

        Cldr.BE ->
            "ბელგია"

        Cldr.BF ->
            "ბურკინა-ფასო"

        Cldr.BG ->
            "ბულგარეთი"

        Cldr.BH ->
            "ბაჰრეინი"

        Cldr.BI ->
            "ბურუნდი"

        Cldr.BJ ->
            "ბენინი"

        Cldr.BL ->
            "სენ-ბართელმი"

        Cldr.BM ->
            "ბერმუდა"

        Cldr.BN ->
            "ბრუნეი"

        Cldr.BO ->
            "ბოლივია"

        Cldr.BQ ->
            "კარიბის ნიდერლანდები"

        Cldr.BR ->
            "ბრაზილია"

        Cldr.BS ->
            "ბაჰამის კუნძულები"

        Cldr.BT ->
            "ბუტანი"

        Cldr.BV ->
            "ბუვე"

        Cldr.BW ->
            "ბოტსვანა"

        Cldr.BY ->
            "ბელარუსი"

        Cldr.BZ ->
            "ბელიზი"

        Cldr.CA ->
            "კანადა"

        Cldr.CC ->
            "ქოქოსის (კილინგის) კუნძულები"

        Cldr.CD ->
            "კონგო - კინშასა"

        Cldr.CF ->
            "ცენტრალური აფრიკის რესპუბლიკა"

        Cldr.CG ->
            "კონგო - ბრაზავილი"

        Cldr.CH ->
            "შვეიცარია"

        Cldr.CI ->
            "კოტ-დივუარი"

        Cldr.CK ->
            "კუკის კუნძულები"

        Cldr.CL ->
            "ჩილე"

        Cldr.CM ->
            "კამერუნი"

        Cldr.CN ->
            "ჩინეთი"

        Cldr.CO ->
            "კოლუმბია"

        Cldr.CR ->
            "კოსტა-რიკა"

        Cldr.CU ->
            "კუბა"

        Cldr.CV ->
            "კაბო-ვერდე"

        Cldr.CW ->
            "კიურასაო"

        Cldr.CX ->
            "შობის კუნძული"

        Cldr.CY ->
            "კვიპროსი"

        Cldr.CZ ->
            "ჩეხეთი"

        Cldr.DE ->
            "გერმანია"

        Cldr.DJ ->
            "ჯიბუტი"

        Cldr.DK ->
            "დანია"

        Cldr.DM ->
            "დომინიკა"

        Cldr.DO ->
            "დომინიკელთა რესპუბლიკა"

        Cldr.DZ ->
            "ალჟირი"

        Cldr.EC ->
            "ეკვადორი"

        Cldr.EE ->
            "ესტონეთი"

        Cldr.EG ->
            "ეგვიპტე"

        Cldr.EH ->
            "დასავლეთ საჰარა"

        Cldr.ER ->
            "ერიტრეა"

        Cldr.ES ->
            "ესპანეთი"

        Cldr.ET ->
            "ეთიოპია"

        Cldr.FI ->
            "ფინეთი"

        Cldr.FJ ->
            "ფიჯი"

        Cldr.FK ->
            "ფოლკლენდის კუნძულები"

        Cldr.FM ->
            "მიკრონეზია"

        Cldr.FO ->
            "ფარერის კუნძულები"

        Cldr.FR ->
            "საფრანგეთი"

        Cldr.GA ->
            "გაბონი"

        Cldr.GB ->
            "გაერთიანებული სამეფო"

        Cldr.GD ->
            "გრენადა"

        Cldr.GE ->
            "საქართველო"

        Cldr.GF ->
            "საფრანგეთის გვიანა"

        Cldr.GG ->
            "გერნსი"

        Cldr.GH ->
            "განა"

        Cldr.GI ->
            "გიბრალტარი"

        Cldr.GL ->
            "გრენლანდია"

        Cldr.GM ->
            "გამბია"

        Cldr.GN ->
            "გვინეა"

        Cldr.GP ->
            "გვადელუპა"

        Cldr.GQ ->
            "ეკვატორული გვინეა"

        Cldr.GR ->
            "საბერძნეთი"

        Cldr.GS ->
            "სამხრეთ ჯორჯია და სამხრეთ სენდვიჩის კუნძულები"

        Cldr.GT_ ->
            "გვატემალა"

        Cldr.GU ->
            "გუამი"

        Cldr.GW ->
            "გვინეა-ბისაუ"

        Cldr.GY ->
            "გაიანა"

        Cldr.HK ->
            "ჰონკონგის სპეციალური ადმინისტრაციული რეგიონი, ჩინეთი"

        Cldr.HM ->
            "ჰერდი და მაკდონალდის კუნძულები"

        Cldr.HN ->
            "ჰონდურასი"

        Cldr.HR ->
            "ხორვატია"

        Cldr.HT ->
            "ჰაიტი"

        Cldr.HU ->
            "უნგრეთი"

        Cldr.ID ->
            "ინდონეზია"

        Cldr.IE ->
            "ირლანდია"

        Cldr.IL ->
            "ისრაელი"

        Cldr.IM ->
            "მენის კუნძული"

        Cldr.IN ->
            "ინდოეთი"

        Cldr.IO ->
            "ბრიტანეთის ტერიტორია ინდოეთის ოკეანეში"

        Cldr.IQ ->
            "ერაყი"

        Cldr.IR ->
            "ირანი"

        Cldr.IS ->
            "ისლანდია"

        Cldr.IT ->
            "იტალია"

        Cldr.JE ->
            "ჯერსი"

        Cldr.JM ->
            "იამაიკა"

        Cldr.JO ->
            "იორდანია"

        Cldr.JP ->
            "იაპონია"

        Cldr.KE ->
            "კენია"

        Cldr.KG ->
            "ყირგიზეთი"

        Cldr.KH ->
            "კამბოჯა"

        Cldr.KI ->
            "კირიბატი"

        Cldr.KM ->
            "კომორის კუნძულები"

        Cldr.KN ->
            "სენტ-კიტსი და ნევისი"

        Cldr.KP ->
            "ჩრდილოეთ კორეა"

        Cldr.KR ->
            "სამხრეთ კორეა"

        Cldr.KW ->
            "ქუვეითი"

        Cldr.KY ->
            "კაიმანის კუნძულები"

        Cldr.KZ ->
            "ყაზახეთი"

        Cldr.LA ->
            "ლაოსი"

        Cldr.LB ->
            "ლიბანი"

        Cldr.LC ->
            "სენტ-ლუსია"

        Cldr.LI ->
            "ლიხტენშტაინი"

        Cldr.LK ->
            "შრი-ლანკა"

        Cldr.LR ->
            "ლიბერია"

        Cldr.LS ->
            "ლესოთო"

        Cldr.LT_ ->
            "ლიეტუვა"

        Cldr.LU ->
            "ლუქსემბურგი"

        Cldr.LV ->
            "ლატვია"

        Cldr.LY ->
            "ლიბია"

        Cldr.MA ->
            "მაროკო"

        Cldr.MC ->
            "მონაკო"

        Cldr.MD ->
            "მოლდოვა"

        Cldr.ME ->
            "მონტენეგრო"

        Cldr.MF ->
            "სენ-მარტენი"

        Cldr.MG ->
            "მადაგასკარი"

        Cldr.MH ->
            "მარშალის კუნძულები"

        Cldr.MK ->
            "ჩრდილოეთ მაკედონია"

        Cldr.ML ->
            "მალი"

        Cldr.MM ->
            "მიანმარი (ბირმა)"

        Cldr.MN ->
            "მონღოლეთი"

        Cldr.MO ->
            "მაკაოს სპეციალური ადმინისტრაციული რეგიონი, ჩინეთი"

        Cldr.MP ->
            "ჩრდილოეთ მარიანას კუნძულები"

        Cldr.MQ ->
            "მარტინიკა"

        Cldr.MR ->
            "მავრიტანია"

        Cldr.MS ->
            "მონსერატი"

        Cldr.MT ->
            "მალტა"

        Cldr.MU ->
            "მავრიკი"

        Cldr.MV ->
            "მალდივები"

        Cldr.MW ->
            "მალავი"

        Cldr.MX ->
            "მექსიკა"

        Cldr.MY ->
            "მალაიზია"

        Cldr.MZ ->
            "მოზამბიკი"

        Cldr.NA ->
            "ნამიბია"

        Cldr.NC ->
            "ახალი კალედონია"

        Cldr.NE ->
            "ნიგერი"

        Cldr.NF ->
            "ნორფოლკის კუნძული"

        Cldr.NG ->
            "ნიგერია"

        Cldr.NI ->
            "ნიკარაგუა"

        Cldr.NL ->
            "ნიდერლანდები"

        Cldr.NO ->
            "ნორვეგია"

        Cldr.NP ->
            "ნეპალი"

        Cldr.NR ->
            "ნაურუ"

        Cldr.NU ->
            "ნიუე"

        Cldr.NZ ->
            "ახალი ზელანდია"

        Cldr.OM ->
            "ომანი"

        Cldr.PA ->
            "პანამა"

        Cldr.PE ->
            "პერუ"

        Cldr.PF ->
            "საფრანგეთის პოლინეზია"

        Cldr.PG ->
            "პაპუა-ახალი გვინეა"

        Cldr.PH ->
            "ფილიპინები"

        Cldr.PK ->
            "პაკისტანი"

        Cldr.PL ->
            "პოლონეთი"

        Cldr.PM ->
            "სენ-პიერი და მიკელონი"

        Cldr.PN ->
            "პიტკერნის კუნძულები"

        Cldr.PR ->
            "პუერტო-რიკო"

        Cldr.PS ->
            "პალესტინის ტერიტორიები"

        Cldr.PT ->
            "პორტუგალია"

        Cldr.PW ->
            "პალაუ"

        Cldr.PY ->
            "პარაგვაი"

        Cldr.QA ->
            "კატარი"

        Cldr.RE ->
            "რეუნიონი"

        Cldr.RO ->
            "რუმინეთი"

        Cldr.RS ->
            "სერბეთი"

        Cldr.RU ->
            "რუსეთი"

        Cldr.RW ->
            "რუანდა"

        Cldr.SA ->
            "საუდის არაბეთი"

        Cldr.SB ->
            "სოლომონის კუნძულები"

        Cldr.SC ->
            "სეიშელის კუნძულები"

        Cldr.SD ->
            "სუდანი"

        Cldr.SE ->
            "შვედეთი"

        Cldr.SG ->
            "სინგაპური"

        Cldr.SH ->
            "წმინდა ელენეს კუნძული"

        Cldr.SI ->
            "სლოვენია"

        Cldr.SJ ->
            "შპიცბერგენი და იან-მაიენი"

        Cldr.SK ->
            "სლოვაკეთი"

        Cldr.SL ->
            "სიერა-ლეონე"

        Cldr.SM ->
            "სან-მარინო"

        Cldr.SN ->
            "სენეგალი"

        Cldr.SO ->
            "სომალი"

        Cldr.SR ->
            "სურინამი"

        Cldr.SS ->
            "სამხრეთ სუდანი"

        Cldr.ST ->
            "სან-ტომე და პრინსიპი"

        Cldr.SV ->
            "სალვადორი"

        Cldr.SX ->
            "სინტ-მარტენი"

        Cldr.SY ->
            "სირია"

        Cldr.SZ ->
            "სვაზილენდი"

        Cldr.TC ->
            "თერქს-ქაიქოსის კუნძულები"

        Cldr.TD ->
            "ჩადი"

        Cldr.TF ->
            "ფრანგული სამხრეთის ტერიტორიები"

        Cldr.TG ->
            "ტოგო"

        Cldr.TH ->
            "ტაილანდი"

        Cldr.TJ ->
            "ტაჯიკეთი"

        Cldr.TK ->
            "ტოკელაუ"

        Cldr.TL ->
            "ტიმორ-ლესტე"

        Cldr.TM ->
            "თურქმენეთი"

        Cldr.TN ->
            "ტუნისი"

        Cldr.TO ->
            "ტონგა"

        Cldr.TR ->
            "თურქეთი"

        Cldr.TT ->
            "ტრინიდადი და ტობაგო"

        Cldr.TV ->
            "ტუვალუ"

        Cldr.TW ->
            "ტაივანი"

        Cldr.TZ ->
            "ტანზანია"

        Cldr.UA ->
            "უკრაინა"

        Cldr.UG ->
            "უგანდა"

        Cldr.UM ->
            "აშშ-ის შორეული კუნძულები"

        Cldr.US ->
            "ამერიკის შეერთებული შტატები"

        Cldr.UY ->
            "ურუგვაი"

        Cldr.UZ ->
            "უზბეკეთი"

        Cldr.VA ->
            "ქალაქი ვატიკანი"

        Cldr.VC ->
            "სენტ-ვინსენტი და გრენადინები"

        Cldr.VE ->
            "ვენესუელა"

        Cldr.VG ->
            "ბრიტანეთის ვირჯინის კუნძულები"

        Cldr.VI ->
            "აშშ-ის ვირჯინის კუნძულები"

        Cldr.VN ->
            "ვიეტნამი"

        Cldr.VU ->
            "ვანუატუ"

        Cldr.WF ->
            "უოლისი და ფუტუნა"

        Cldr.WS ->
            "სამოა"

        Cldr.XK ->
            "კოსოვო"

        Cldr.YE ->
            "იემენი"

        Cldr.YT ->
            "მაიოტა"

        Cldr.ZA ->
            "სამხრეთ აფრიკის რესპუბლიკა"

        Cldr.ZM ->
            "ზამბია"

        Cldr.ZW ->
            "ზიმბაბვე"