module Cldr.Greek exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Greek.

    AD Ανδόρα
    AE Ηνωμένα Αραβικά Εμιράτα
    AF Αφγανιστάν
    AG Αντίγκουα και Μπαρμπούντα
    AI Ανγκουίλα
    AL Αλβανία
    AM Αρμενία
    AO Αγκόλα
    AQ Ανταρκτική
    AR Αργεντινή
    AS Αμερικανική Σαμόα
    AT Αυστρία
    AU Αυστραλία
    AW Αρούμπα
    AX Νήσοι Όλαντ
    AZ Αζερμπαϊτζάν
    BA Βοσνία - Ερζεγοβίνη
    BB Μπαρμπέιντος
    BD Μπανγκλαντές
    BE Βέλγιο
    BF Μπουρκίνα Φάσο
    BG Βουλγαρία
    BH Μπαχρέιν
    BI Μπουρούντι
    BJ Μπενίν
    BL Άγιος Βαρθολομαίος
    BM Βερμούδες
    BN Μπρουνέι
    BO Βολιβία
    BQ Ολλανδία Καραϊβικής
    BR Βραζιλία
    BS Μπαχάμες
    BT Μπουτάν
    BV Νήσος Μπουβέ
    BW Μποτσουάνα
    BY Λευκορωσία
    BZ Μπελίζ
    CA Καναδάς
    CC Νήσοι Κόκος (Κίλινγκ)
    CD Κονγκό (ΛΔΚ)
    CF Κεντροαφρικανική Δημοκρατία
    CG Κονγκό (Δημοκρατία)
    CH Ελβετία
    CI Ακτή Ελεφαντοστού
    CK Νήσοι Κουκ
    CL Χιλή
    CM Καμερούν
    CN Κίνα
    CO Κολομβία
    CR Κόστα Ρίκα
    CU Κούβα
    CV Πράσινο Ακρωτήριο
    CW Κουρασάο
    CX Νήσος των Χριστουγέννων
    CY Κύπρος
    CZ Τσεχική Δημοκρατία
    DE Γερμανία
    DJ Τζιμπουτί
    DK Δανία
    DM Ντομίνικα
    DO Δομινικανή Δημοκρατία
    DZ Αλγερία
    EC Ισημερινός
    EE Εσθονία
    EG Αίγυπτος
    EH Δυτική Σαχάρα
    ER Ερυθραία
    ES Ισπανία
    ET Αιθιοπία
    FI Φινλανδία
    FJ Φίτζι
    FK Νήσοι Φόκλαντ
    FM Μικρονησία
    FO Νήσοι Φερόες
    FR Γαλλία
    GA Γκαμπόν
    GB Ηνωμένο Βασίλειο
    GD Γρενάδα
    GE Γεωργία
    GF Γαλλική Γουιάνα
    GG Γκέρνζι
    GH Γκάνα
    GI Γιβραλτάρ
    GL Γροιλανδία
    GM Γκάμπια
    GN Γουινέα
    GP Γουαδελούπη
    GQ Ισημερινή Γουινέα
    GR Ελλάδα
    GS Νήσοι Νότια Γεωργία και Νότιες Σάντουιτς
    GT Γουατεμάλα
    GU Γκουάμ
    GW Γουινέα Μπισάου
    GY Γουιάνα
    HK Χονγκ Κονγκ
    HM Νήσοι Χερντ και Μακντόναλντ
    HN Ονδούρα
    HR Κροατία
    HT Αϊτή
    HU Ουγγαρία
    ID Ινδονησία
    IE Ιρλανδία
    IL Ισραήλ
    IM Νήσος του Μαν
    IN Ινδία
    IO Βρετανικά Εδάφη Ινδικού Ωκεανού
    IQ Ιράκ
    IR Ιράν
    IS Ισλανδία
    IT Ιταλία
    JE Τζέρζι
    JM Τζαμάικα
    JO Ιορδανία
    JP Ιαπωνία
    KE Κένυα
    KG Κιργιστάν
    KH Καμπότζη
    KI Κιριμπάτι
    KM Κομόρες
    KN Σεν Κιτς και Νέβις
    KP Βόρεια Κορέα
    KR Νότια Κορέα
    KW Κουβέιτ
    KY Νήσοι Κέιμαν
    KZ Καζακστάν
    LA Λάος
    LB Λίβανος
    LC Αγία Λουκία
    LI Λιχτενστάιν
    LK Σρι Λάνκα
    LR Λιβερία
    LS Λεσότο
    LT Λιθουανία
    LU Λουξεμβούργο
    LV Λετονία
    LY Λιβύη
    MA Μαρόκο
    MC Μονακό
    MD Μολδαβία
    ME Μαυροβούνιο
    MF Άγιος Μαρτίνος (Γαλλικό τμήμα)
    MG Μαδαγασκάρη
    MH Νήσοι Μάρσαλ
    MK Βόρεια Μακεδονία
    ML Μάλι
    MM Μιανμάρ (Βιρμανία)
    MN Μογγολία
    MO Μακάο
    MP Νήσοι Βόρειες Μαριάνες
    MQ Μαρτινίκα
    MR Μαυριτανία
    MS Μονσεράτ
    MT Μάλτα
    MU Μαυρίκιος
    MV Μαλδίβες
    MW Μαλάουι
    MX Μεξικό
    MY Μαλαισία
    MZ Μοζαμβίκη
    NA Ναμίμπια
    NC Νέα Καληδονία
    NE Νίγηρας
    NF Νήσος Νόρφολκ
    NG Νιγηρία
    NI Νικαράγουα
    NL Κάτω Χώρες
    NO Νορβηγία
    NP Νεπάλ
    NR Ναουρού
    NU Νιούε
    NZ Νέα Ζηλανδία
    OM Ομάν
    PA Παναμάς
    PE Περού
    PF Γαλλική Πολυνησία
    PG Παπούα Νέα Γουινέα
    PH Φιλιππίνες
    PK Πακιστάν
    PL Πολωνία
    PM Σεν Πιερ και Μικελόν
    PN Νήσοι Πίτκερν
    PR Πουέρτο Ρίκο
    PS Παλαιστίνη
    PT Πορτογαλία
    PW Παλάου
    PY Παραγουάη
    QA Κατάρ
    RE Ρεϊνιόν
    RO Ρουμανία
    RS Σερβία
    RU Ρωσία
    RW Ρουάντα
    SA Σαουδική Αραβία
    SB Νήσοι Σολομώντος
    SC Σεϋχέλλες
    SD Σουδάν
    SE Σουηδία
    SG Σιγκαπούρη
    SH Αγία Ελένη
    SI Σλοβενία
    SJ Σβάλμπαρντ και Γιαν Μαγιέν
    SK Σλοβακία
    SL Σιέρα Λεόνε
    SM Άγιος Μαρίνος
    SN Σενεγάλη
    SO Σομαλία
    SR Σουρινάμ
    SS Νότιο Σουδάν
    ST Σάο Τομέ και Πρίνσιπε
    SV Ελ Σαλβαδόρ
    SX Άγιος Μαρτίνος (Ολλανδικό τμήμα)
    SY Συρία
    SZ Εσουατίνι
    TC Νήσοι Τερκς και Κάικος
    TD Τσαντ
    TF Γαλλικά Νότια Εδάφη
    TG Τόγκο
    TH Ταϊλάνδη
    TJ Τατζικιστάν
    TK Τοκελάου
    TL Ανατολικό Τιμόρ
    TM Τουρκμενιστάν
    TN Τυνησία
    TO Τόνγκα
    TR Τουρκία
    TT Τρινιντάντ και Τομπάγκο
    TV Τουβαλού
    TW Ταϊβάν
    TZ Τανζανία
    UA Ουκρανία
    UG Ουγκάντα
    UM Απομακρυσμένες Νησίδες ΗΠΑ
    US Ηνωμένες Πολιτείες
    UY Ουρουγουάη
    UZ Ουζμπεκιστάν
    VA Βατικανό
    VC Άγιος Βικέντιος και Γρεναδίνες
    VE Βενεζουέλα
    VG Βρετανικές Παρθένες Νήσοι
    VI Αμερικανικές Παρθένες Νήσοι
    VN Βιετνάμ
    VU Βανουάτου
    WF Γουάλις και Φουτούνα
    WS Σαμόα
    XK Κοσσυφοπέδιο
    YE Υεμένη
    YT Μαγιότ
    ZA Νότια Αφρική
    ZM Ζάμπια
    ZW Ζιμπάμπουε
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Ανδόρα"

        Cldr.AE ->
            "Ηνωμένα Αραβικά Εμιράτα"

        Cldr.AF ->
            "Αφγανιστάν"

        Cldr.AG ->
            "Αντίγκουα και Μπαρμπούντα"

        Cldr.AI ->
            "Ανγκουίλα"

        Cldr.AL ->
            "Αλβανία"

        Cldr.AM ->
            "Αρμενία"

        Cldr.AO ->
            "Αγκόλα"

        Cldr.AQ ->
            "Ανταρκτική"

        Cldr.AR ->
            "Αργεντινή"

        Cldr.AS ->
            "Αμερικανική Σαμόα"

        Cldr.AT ->
            "Αυστρία"

        Cldr.AU ->
            "Αυστραλία"

        Cldr.AW ->
            "Αρούμπα"

        Cldr.AX ->
            "Νήσοι Όλαντ"

        Cldr.AZ ->
            "Αζερμπαϊτζάν"

        Cldr.BA ->
            "Βοσνία - Ερζεγοβίνη"

        Cldr.BB ->
            "Μπαρμπέιντος"

        Cldr.BD ->
            "Μπανγκλαντές"

        Cldr.BE ->
            "Βέλγιο"

        Cldr.BF ->
            "Μπουρκίνα Φάσο"

        Cldr.BG ->
            "Βουλγαρία"

        Cldr.BH ->
            "Μπαχρέιν"

        Cldr.BI ->
            "Μπουρούντι"

        Cldr.BJ ->
            "Μπενίν"

        Cldr.BL ->
            "Άγιος Βαρθολομαίος"

        Cldr.BM ->
            "Βερμούδες"

        Cldr.BN ->
            "Μπρουνέι"

        Cldr.BO ->
            "Βολιβία"

        Cldr.BQ ->
            "Ολλανδία Καραϊβικής"

        Cldr.BR ->
            "Βραζιλία"

        Cldr.BS ->
            "Μπαχάμες"

        Cldr.BT ->
            "Μπουτάν"

        Cldr.BV ->
            "Νήσος Μπουβέ"

        Cldr.BW ->
            "Μποτσουάνα"

        Cldr.BY ->
            "Λευκορωσία"

        Cldr.BZ ->
            "Μπελίζ"

        Cldr.CA ->
            "Καναδάς"

        Cldr.CC ->
            "Νήσοι Κόκος (Κίλινγκ)"

        Cldr.CD ->
            "Κονγκό (ΛΔΚ)"

        Cldr.CF ->
            "Κεντροαφρικανική Δημοκρατία"

        Cldr.CG ->
            "Κονγκό (Δημοκρατία)"

        Cldr.CH ->
            "Ελβετία"

        Cldr.CI ->
            "Ακτή Ελεφαντοστού"

        Cldr.CK ->
            "Νήσοι Κουκ"

        Cldr.CL ->
            "Χιλή"

        Cldr.CM ->
            "Καμερούν"

        Cldr.CN ->
            "Κίνα"

        Cldr.CO ->
            "Κολομβία"

        Cldr.CR ->
            "Κόστα Ρίκα"

        Cldr.CU ->
            "Κούβα"

        Cldr.CV ->
            "Πράσινο Ακρωτήριο"

        Cldr.CW ->
            "Κουρασάο"

        Cldr.CX ->
            "Νήσος των Χριστουγέννων"

        Cldr.CY ->
            "Κύπρος"

        Cldr.CZ ->
            "Τσεχική Δημοκρατία"

        Cldr.DE ->
            "Γερμανία"

        Cldr.DJ ->
            "Τζιμπουτί"

        Cldr.DK ->
            "Δανία"

        Cldr.DM ->
            "Ντομίνικα"

        Cldr.DO ->
            "Δομινικανή Δημοκρατία"

        Cldr.DZ ->
            "Αλγερία"

        Cldr.EC ->
            "Ισημερινός"

        Cldr.EE ->
            "Εσθονία"

        Cldr.EG ->
            "Αίγυπτος"

        Cldr.EH ->
            "Δυτική Σαχάρα"

        Cldr.ER ->
            "Ερυθραία"

        Cldr.ES ->
            "Ισπανία"

        Cldr.ET ->
            "Αιθιοπία"

        Cldr.FI ->
            "Φινλανδία"

        Cldr.FJ ->
            "Φίτζι"

        Cldr.FK ->
            "Νήσοι Φόκλαντ"

        Cldr.FM ->
            "Μικρονησία"

        Cldr.FO ->
            "Νήσοι Φερόες"

        Cldr.FR ->
            "Γαλλία"

        Cldr.GA ->
            "Γκαμπόν"

        Cldr.GB ->
            "Ηνωμένο Βασίλειο"

        Cldr.GD ->
            "Γρενάδα"

        Cldr.GE ->
            "Γεωργία"

        Cldr.GF ->
            "Γαλλική Γουιάνα"

        Cldr.GG ->
            "Γκέρνζι"

        Cldr.GH ->
            "Γκάνα"

        Cldr.GI ->
            "Γιβραλτάρ"

        Cldr.GL ->
            "Γροιλανδία"

        Cldr.GM ->
            "Γκάμπια"

        Cldr.GN ->
            "Γουινέα"

        Cldr.GP ->
            "Γουαδελούπη"

        Cldr.GQ ->
            "Ισημερινή Γουινέα"

        Cldr.GR ->
            "Ελλάδα"

        Cldr.GS ->
            "Νήσοι Νότια Γεωργία και Νότιες Σάντουιτς"

        Cldr.GT_ ->
            "Γουατεμάλα"

        Cldr.GU ->
            "Γκουάμ"

        Cldr.GW ->
            "Γουινέα Μπισάου"

        Cldr.GY ->
            "Γουιάνα"

        Cldr.HK ->
            "Χονγκ Κονγκ"

        Cldr.HM ->
            "Νήσοι Χερντ και Μακντόναλντ"

        Cldr.HN ->
            "Ονδούρα"

        Cldr.HR ->
            "Κροατία"

        Cldr.HT ->
            "Αϊτή"

        Cldr.HU ->
            "Ουγγαρία"

        Cldr.ID ->
            "Ινδονησία"

        Cldr.IE ->
            "Ιρλανδία"

        Cldr.IL ->
            "Ισραήλ"

        Cldr.IM ->
            "Νήσος του Μαν"

        Cldr.IN ->
            "Ινδία"

        Cldr.IO ->
            "Βρετανικά Εδάφη Ινδικού Ωκεανού"

        Cldr.IQ ->
            "Ιράκ"

        Cldr.IR ->
            "Ιράν"

        Cldr.IS ->
            "Ισλανδία"

        Cldr.IT ->
            "Ιταλία"

        Cldr.JE ->
            "Τζέρζι"

        Cldr.JM ->
            "Τζαμάικα"

        Cldr.JO ->
            "Ιορδανία"

        Cldr.JP ->
            "Ιαπωνία"

        Cldr.KE ->
            "Κένυα"

        Cldr.KG ->
            "Κιργιστάν"

        Cldr.KH ->
            "Καμπότζη"

        Cldr.KI ->
            "Κιριμπάτι"

        Cldr.KM ->
            "Κομόρες"

        Cldr.KN ->
            "Σεν Κιτς και Νέβις"

        Cldr.KP ->
            "Βόρεια Κορέα"

        Cldr.KR ->
            "Νότια Κορέα"

        Cldr.KW ->
            "Κουβέιτ"

        Cldr.KY ->
            "Νήσοι Κέιμαν"

        Cldr.KZ ->
            "Καζακστάν"

        Cldr.LA ->
            "Λάος"

        Cldr.LB ->
            "Λίβανος"

        Cldr.LC ->
            "Αγία Λουκία"

        Cldr.LI ->
            "Λιχτενστάιν"

        Cldr.LK ->
            "Σρι Λάνκα"

        Cldr.LR ->
            "Λιβερία"

        Cldr.LS ->
            "Λεσότο"

        Cldr.LT_ ->
            "Λιθουανία"

        Cldr.LU ->
            "Λουξεμβούργο"

        Cldr.LV ->
            "Λετονία"

        Cldr.LY ->
            "Λιβύη"

        Cldr.MA ->
            "Μαρόκο"

        Cldr.MC ->
            "Μονακό"

        Cldr.MD ->
            "Μολδαβία"

        Cldr.ME ->
            "Μαυροβούνιο"

        Cldr.MF ->
            "Άγιος Μαρτίνος (Γαλλικό τμήμα)"

        Cldr.MG ->
            "Μαδαγασκάρη"

        Cldr.MH ->
            "Νήσοι Μάρσαλ"

        Cldr.MK ->
            "Βόρεια Μακεδονία"

        Cldr.ML ->
            "Μάλι"

        Cldr.MM ->
            "Μιανμάρ (Βιρμανία)"

        Cldr.MN ->
            "Μογγολία"

        Cldr.MO ->
            "Μακάο"

        Cldr.MP ->
            "Νήσοι Βόρειες Μαριάνες"

        Cldr.MQ ->
            "Μαρτινίκα"

        Cldr.MR ->
            "Μαυριτανία"

        Cldr.MS ->
            "Μονσεράτ"

        Cldr.MT ->
            "Μάλτα"

        Cldr.MU ->
            "Μαυρίκιος"

        Cldr.MV ->
            "Μαλδίβες"

        Cldr.MW ->
            "Μαλάουι"

        Cldr.MX ->
            "Μεξικό"

        Cldr.MY ->
            "Μαλαισία"

        Cldr.MZ ->
            "Μοζαμβίκη"

        Cldr.NA ->
            "Ναμίμπια"

        Cldr.NC ->
            "Νέα Καληδονία"

        Cldr.NE ->
            "Νίγηρας"

        Cldr.NF ->
            "Νήσος Νόρφολκ"

        Cldr.NG ->
            "Νιγηρία"

        Cldr.NI ->
            "Νικαράγουα"

        Cldr.NL ->
            "Κάτω Χώρες"

        Cldr.NO ->
            "Νορβηγία"

        Cldr.NP ->
            "Νεπάλ"

        Cldr.NR ->
            "Ναουρού"

        Cldr.NU ->
            "Νιούε"

        Cldr.NZ ->
            "Νέα Ζηλανδία"

        Cldr.OM ->
            "Ομάν"

        Cldr.PA ->
            "Παναμάς"

        Cldr.PE ->
            "Περού"

        Cldr.PF ->
            "Γαλλική Πολυνησία"

        Cldr.PG ->
            "Παπούα Νέα Γουινέα"

        Cldr.PH ->
            "Φιλιππίνες"

        Cldr.PK ->
            "Πακιστάν"

        Cldr.PL ->
            "Πολωνία"

        Cldr.PM ->
            "Σεν Πιερ και Μικελόν"

        Cldr.PN ->
            "Νήσοι Πίτκερν"

        Cldr.PR ->
            "Πουέρτο Ρίκο"

        Cldr.PS ->
            "Παλαιστίνη"

        Cldr.PT ->
            "Πορτογαλία"

        Cldr.PW ->
            "Παλάου"

        Cldr.PY ->
            "Παραγουάη"

        Cldr.QA ->
            "Κατάρ"

        Cldr.RE ->
            "Ρεϊνιόν"

        Cldr.RO ->
            "Ρουμανία"

        Cldr.RS ->
            "Σερβία"

        Cldr.RU ->
            "Ρωσία"

        Cldr.RW ->
            "Ρουάντα"

        Cldr.SA ->
            "Σαουδική Αραβία"

        Cldr.SB ->
            "Νήσοι Σολομώντος"

        Cldr.SC ->
            "Σεϋχέλλες"

        Cldr.SD ->
            "Σουδάν"

        Cldr.SE ->
            "Σουηδία"

        Cldr.SG ->
            "Σιγκαπούρη"

        Cldr.SH ->
            "Αγία Ελένη"

        Cldr.SI ->
            "Σλοβενία"

        Cldr.SJ ->
            "Σβάλμπαρντ και Γιαν Μαγιέν"

        Cldr.SK ->
            "Σλοβακία"

        Cldr.SL ->
            "Σιέρα Λεόνε"

        Cldr.SM ->
            "Άγιος Μαρίνος"

        Cldr.SN ->
            "Σενεγάλη"

        Cldr.SO ->
            "Σομαλία"

        Cldr.SR ->
            "Σουρινάμ"

        Cldr.SS ->
            "Νότιο Σουδάν"

        Cldr.ST ->
            "Σάο Τομέ και Πρίνσιπε"

        Cldr.SV ->
            "Ελ Σαλβαδόρ"

        Cldr.SX ->
            "Άγιος Μαρτίνος (Ολλανδικό τμήμα)"

        Cldr.SY ->
            "Συρία"

        Cldr.SZ ->
            "Εσουατίνι"

        Cldr.TC ->
            "Νήσοι Τερκς και Κάικος"

        Cldr.TD ->
            "Τσαντ"

        Cldr.TF ->
            "Γαλλικά Νότια Εδάφη"

        Cldr.TG ->
            "Τόγκο"

        Cldr.TH ->
            "Ταϊλάνδη"

        Cldr.TJ ->
            "Τατζικιστάν"

        Cldr.TK ->
            "Τοκελάου"

        Cldr.TL ->
            "Ανατολικό Τιμόρ"

        Cldr.TM ->
            "Τουρκμενιστάν"

        Cldr.TN ->
            "Τυνησία"

        Cldr.TO ->
            "Τόνγκα"

        Cldr.TR ->
            "Τουρκία"

        Cldr.TT ->
            "Τρινιντάντ και Τομπάγκο"

        Cldr.TV ->
            "Τουβαλού"

        Cldr.TW ->
            "Ταϊβάν"

        Cldr.TZ ->
            "Τανζανία"

        Cldr.UA ->
            "Ουκρανία"

        Cldr.UG ->
            "Ουγκάντα"

        Cldr.UM ->
            "Απομακρυσμένες Νησίδες ΗΠΑ"

        Cldr.US ->
            "Ηνωμένες Πολιτείες"

        Cldr.UY ->
            "Ουρουγουάη"

        Cldr.UZ ->
            "Ουζμπεκιστάν"

        Cldr.VA ->
            "Βατικανό"

        Cldr.VC ->
            "Άγιος Βικέντιος και Γρεναδίνες"

        Cldr.VE ->
            "Βενεζουέλα"

        Cldr.VG ->
            "Βρετανικές Παρθένες Νήσοι"

        Cldr.VI ->
            "Αμερικανικές Παρθένες Νήσοι"

        Cldr.VN ->
            "Βιετνάμ"

        Cldr.VU ->
            "Βανουάτου"

        Cldr.WF ->
            "Γουάλις και Φουτούνα"

        Cldr.WS ->
            "Σαμόα"

        Cldr.XK ->
            "Κοσσυφοπέδιο"

        Cldr.YE ->
            "Υεμένη"

        Cldr.YT ->
            "Μαγιότ"

        Cldr.ZA ->
            "Νότια Αφρική"

        Cldr.ZM ->
            "Ζάμπια"

        Cldr.ZW ->
            "Ζιμπάμπουε"