module Cldr.Hebrew exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Hebrew.

    AD אנדורה
    AE איחוד האמירויות הערביות
    AF אפגניסטן
    AG אנטיגואה וברבודה
    AI אנגווילה
    AL אלבניה
    AM ארמניה
    AO אנגולה
    AQ אנטארקטיקה
    AR ארגנטינה
    AS סמואה האמריקנית
    AT אוסטריה
    AU אוסטרליה
    AW ארובה
    AX איי אולנד
    AZ אזרבייג׳ן
    BA בוסניה והרצגובינה
    BB ברבדוס
    BD בנגלדש
    BE בלגיה
    BF בורקינה פאסו
    BG בולגריה
    BH בחריין
    BI בורונדי
    BJ בנין
    BL סנט ברתולומיאו
    BM ברמודה
    BN ברוניי
    BO בוליביה
    BQ האיים הקריביים ההולנדיים
    BR ברזיל
    BS איי בהאמה
    BT בהוטן
    BV האי בובה
    BW בוטסואנה
    BY בלארוס
    BZ בליז
    CA קנדה
    CC איי קוקוס (קילינג)
    CD קונגו (הרפובליקה הדמוקרטית של קונגו)
    CF הרפובליקה המרכז-אפריקאית
    CG קונגו (רפובליקה)
    CH שווייץ
    CI חוף השנהב
    CK איי קוק
    CL צ׳ילה
    CM קמרון
    CN סין
    CO קולומביה
    CR קוסטה ריקה
    CU קובה
    CV כף ורדה
    CW קוראסאו
    CX אי חג המולד
    CY קפריסין
    CZ הרפובליקה הצ׳כית
    DE גרמניה
    DJ ג׳יבוטי
    DK דנמרק
    DM דומיניקה
    DO הרפובליקה הדומיניקנית
    DZ אלג׳יריה
    EC אקוודור
    EE אסטוניה
    EG מצרים
    EH סהרה המערבית
    ER אריתריאה
    ES ספרד
    ET אתיופיה
    FI פינלנד
    FJ פיג׳י
    FK איי פוקלנד
    FM מיקרונזיה
    FO איי פארו
    FR צרפת
    GA גבון
    GB בריטניה
    GD גרנדה
    GE גאורגיה
    GF גיאנה הצרפתית
    GG גרנזי
    GH גאנה
    GI גיברלטר
    GL גרינלנד
    GM גמביה
    GN גינאה
    GP גוואדלופ
    GQ גינאה המשוונית
    GR יוון
    GS ג׳ורג׳יה הדרומית ואיי סנדוויץ׳ הדרומיים
    GT גואטמלה
    GU גואם
    GW גינאה-ביסאו
    GY גיאנה
    HK הונג קונג
    HM איי הרד ומקדונלד
    HN הונדורס
    HR קרואטיה
    HT האיטי
    HU הונגריה
    ID אינדונזיה
    IE אירלנד
    IL ישראל
    IM האי מאן
    IN הודו
    IO הטריטוריה הבריטית באוקיינוס ההודי
    IQ עיראק
    IR איראן
    IS איסלנד
    IT איטליה
    JE ג׳רזי
    JM ג׳מייקה
    JO ירדן
    JP יפן
    KE קניה
    KG קירגיזסטן
    KH קמבודיה
    KI קיריבאטי
    KM קומורו
    KN סנט קיטס ונוויס
    KP קוריאה הצפונית
    KR קוריאה הדרומית
    KW כווית
    KY איי קיימן
    KZ קזחסטן
    LA לאוס
    LB לבנון
    LC סנט לוסיה
    LI ליכטנשטיין
    LK סרי לנקה
    LR ליבריה
    LS לסוטו
    LT ליטא
    LU לוקסמבורג
    LV לטביה
    LY לוב
    MA מרוקו
    MC מונקו
    MD מולדובה
    ME מונטנגרו
    MF סן מרטן
    MG מדגסקר
    MH איי מרשל
    MK מקדוניה הצפונית
    ML מאלי
    MM מיאנמר (בורמה)
    MN מונגוליה
    MO מקאו
    MP איי מריאנה הצפוניים
    MQ מרטיניק
    MR מאוריטניה
    MS מונסראט
    MT מלטה
    MU מאוריציוס
    MV האיים המלדיביים
    MW מלאווי
    MX מקסיקו
    MY מלזיה
    MZ מוזמביק
    NA נמיביה
    NC קלדוניה החדשה
    NE ניז׳ר
    NF האי נורפוק
    NG ניגריה
    NI ניקרגואה
    NL הולנד
    NO נורווגיה
    NP נפאל
    NR נאורו
    NU ניווה
    NZ ניו זילנד
    OM עומאן
    PA פנמה
    PE פרו
    PF פולינזיה הצרפתית
    PG פפואה גינאה החדשה
    PH הפיליפינים
    PK פקיסטן
    PL פולין
    PM סנט פייר ומיקלון
    PN איי פיטקרן
    PR פוארטו ריקו
    PS פלסטין
    PT פורטוגל
    PW פלאו
    PY פרגוואי
    QA קטאר
    RE ראוניון
    RO רומניה
    RS סרביה
    RU רוסיה
    RW רואנדה
    SA ערב הסעודית
    SB איי שלמה
    SC איי סיישל
    SD סודן
    SE שוודיה
    SG סינגפור
    SH סנט הלנה
    SI סלובניה
    SJ סבאלברד ויאן מאיין
    SK סלובקיה
    SL סיירה לאון
    SM סן מרינו
    SN סנגל
    SO סומליה
    SR סורינאם
    SS דרום סודן
    ST סאו טומה ופרינסיפה
    SV אל סלבדור
    SX סנט מארטן
    SY סוריה
    SZ אסוואטיני
    TC איי טרקס וקייקוס
    TD צ׳אד
    TF הטריטוריות הדרומיות של צרפת
    TG טוגו
    TH תאילנד
    TJ טג׳יקיסטן
    TK טוקלאו
    TL מזרח טימור
    TM טורקמניסטן
    TN תוניסיה
    TO טונגה
    TR טורקיה
    TT טרינידד וטובגו
    TV טובאלו
    TW טייוואן
    TZ טנזניה
    UA אוקראינה
    UG אוגנדה
    UM האיים המרוחקים הקטנים של ארה״ב
    US ארצות הברית
    UY אורוגוואי
    UZ אוזבקיסטן
    VA הוותיקן
    VC סנט וינסנט והגרנדינים
    VE ונצואלה
    VG איי הבתולה הבריטיים
    VI איי הבתולה של ארצות הברית
    VN וייטנאם
    VU ונואטו
    WF איי ווליס ופוטונה
    WS סמואה
    XK קוסובו
    YE תימן
    YT מאיוט
    ZA דרום אפריקה
    ZM זמביה
    ZW זימבבואה
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "אנדורה"

        Cldr.AE ->
            "איחוד האמירויות הערביות"

        Cldr.AF ->
            "אפגניסטן"

        Cldr.AG ->
            "אנטיגואה וברבודה"

        Cldr.AI ->
            "אנגווילה"

        Cldr.AL ->
            "אלבניה"

        Cldr.AM ->
            "ארמניה"

        Cldr.AO ->
            "אנגולה"

        Cldr.AQ ->
            "אנטארקטיקה"

        Cldr.AR ->
            "ארגנטינה"

        Cldr.AS ->
            "סמואה האמריקנית"

        Cldr.AT ->
            "אוסטריה"

        Cldr.AU ->
            "אוסטרליה"

        Cldr.AW ->
            "ארובה"

        Cldr.AX ->
            "איי אולנד"

        Cldr.AZ ->
            "אזרבייג׳ן"

        Cldr.BA ->
            "בוסניה והרצגובינה"

        Cldr.BB ->
            "ברבדוס"

        Cldr.BD ->
            "בנגלדש"

        Cldr.BE ->
            "בלגיה"

        Cldr.BF ->
            "בורקינה פאסו"

        Cldr.BG ->
            "בולגריה"

        Cldr.BH ->
            "בחריין"

        Cldr.BI ->
            "בורונדי"

        Cldr.BJ ->
            "בנין"

        Cldr.BL ->
            "סנט ברתולומיאו"

        Cldr.BM ->
            "ברמודה"

        Cldr.BN ->
            "ברוניי"

        Cldr.BO ->
            "בוליביה"

        Cldr.BQ ->
            "האיים הקריביים ההולנדיים"

        Cldr.BR ->
            "ברזיל"

        Cldr.BS ->
            "איי בהאמה"

        Cldr.BT ->
            "בהוטן"

        Cldr.BV ->
            "האי בובה"

        Cldr.BW ->
            "בוטסואנה"

        Cldr.BY ->
            "בלארוס"

        Cldr.BZ ->
            "בליז"

        Cldr.CA ->
            "קנדה"

        Cldr.CC ->
            "איי קוקוס (קילינג)"

        Cldr.CD ->
            "קונגו (הרפובליקה הדמוקרטית של קונגו)"

        Cldr.CF ->
            "הרפובליקה המרכז-אפריקאית"

        Cldr.CG ->
            "קונגו (רפובליקה)"

        Cldr.CH ->
            "שווייץ"

        Cldr.CI ->
            "חוף השנהב"

        Cldr.CK ->
            "איי קוק"

        Cldr.CL ->
            "צ׳ילה"

        Cldr.CM ->
            "קמרון"

        Cldr.CN ->
            "סין"

        Cldr.CO ->
            "קולומביה"

        Cldr.CR ->
            "קוסטה ריקה"

        Cldr.CU ->
            "קובה"

        Cldr.CV ->
            "כף ורדה"

        Cldr.CW ->
            "קוראסאו"

        Cldr.CX ->
            "אי חג המולד"

        Cldr.CY ->
            "קפריסין"

        Cldr.CZ ->
            "הרפובליקה הצ׳כית"

        Cldr.DE ->
            "גרמניה"

        Cldr.DJ ->
            "ג׳יבוטי"

        Cldr.DK ->
            "דנמרק"

        Cldr.DM ->
            "דומיניקה"

        Cldr.DO ->
            "הרפובליקה הדומיניקנית"

        Cldr.DZ ->
            "אלג׳יריה"

        Cldr.EC ->
            "אקוודור"

        Cldr.EE ->
            "אסטוניה"

        Cldr.EG ->
            "מצרים"

        Cldr.EH ->
            "סהרה המערבית"

        Cldr.ER ->
            "אריתריאה"

        Cldr.ES ->
            "ספרד"

        Cldr.ET ->
            "אתיופיה"

        Cldr.FI ->
            "פינלנד"

        Cldr.FJ ->
            "פיג׳י"

        Cldr.FK ->
            "איי פוקלנד"

        Cldr.FM ->
            "מיקרונזיה"

        Cldr.FO ->
            "איי פארו"

        Cldr.FR ->
            "צרפת"

        Cldr.GA ->
            "גבון"

        Cldr.GB ->
            "בריטניה"

        Cldr.GD ->
            "גרנדה"

        Cldr.GE ->
            "גאורגיה"

        Cldr.GF ->
            "גיאנה הצרפתית"

        Cldr.GG ->
            "גרנזי"

        Cldr.GH ->
            "גאנה"

        Cldr.GI ->
            "גיברלטר"

        Cldr.GL ->
            "גרינלנד"

        Cldr.GM ->
            "גמביה"

        Cldr.GN ->
            "גינאה"

        Cldr.GP ->
            "גוואדלופ"

        Cldr.GQ ->
            "גינאה המשוונית"

        Cldr.GR ->
            "יוון"

        Cldr.GS ->
            "ג׳ורג׳יה הדרומית ואיי סנדוויץ׳ הדרומיים"

        Cldr.GT_ ->
            "גואטמלה"

        Cldr.GU ->
            "גואם"

        Cldr.GW ->
            "גינאה-ביסאו"

        Cldr.GY ->
            "גיאנה"

        Cldr.HK ->
            "הונג קונג"

        Cldr.HM ->
            "איי הרד ומקדונלד"

        Cldr.HN ->
            "הונדורס"

        Cldr.HR ->
            "קרואטיה"

        Cldr.HT ->
            "האיטי"

        Cldr.HU ->
            "הונגריה"

        Cldr.ID ->
            "אינדונזיה"

        Cldr.IE ->
            "אירלנד"

        Cldr.IL ->
            "ישראל"

        Cldr.IM ->
            "האי מאן"

        Cldr.IN ->
            "הודו"

        Cldr.IO ->
            "הטריטוריה הבריטית באוקיינוס ההודי"

        Cldr.IQ ->
            "עיראק"

        Cldr.IR ->
            "איראן"

        Cldr.IS ->
            "איסלנד"

        Cldr.IT ->
            "איטליה"

        Cldr.JE ->
            "ג׳רזי"

        Cldr.JM ->
            "ג׳מייקה"

        Cldr.JO ->
            "ירדן"

        Cldr.JP ->
            "יפן"

        Cldr.KE ->
            "קניה"

        Cldr.KG ->
            "קירגיזסטן"

        Cldr.KH ->
            "קמבודיה"

        Cldr.KI ->
            "קיריבאטי"

        Cldr.KM ->
            "קומורו"

        Cldr.KN ->
            "סנט קיטס ונוויס"

        Cldr.KP ->
            "קוריאה הצפונית"

        Cldr.KR ->
            "קוריאה הדרומית"

        Cldr.KW ->
            "כווית"

        Cldr.KY ->
            "איי קיימן"

        Cldr.KZ ->
            "קזחסטן"

        Cldr.LA ->
            "לאוס"

        Cldr.LB ->
            "לבנון"

        Cldr.LC ->
            "סנט לוסיה"

        Cldr.LI ->
            "ליכטנשטיין"

        Cldr.LK ->
            "סרי לנקה"

        Cldr.LR ->
            "ליבריה"

        Cldr.LS ->
            "לסוטו"

        Cldr.LT_ ->
            "ליטא"

        Cldr.LU ->
            "לוקסמבורג"

        Cldr.LV ->
            "לטביה"

        Cldr.LY ->
            "לוב"

        Cldr.MA ->
            "מרוקו"

        Cldr.MC ->
            "מונקו"

        Cldr.MD ->
            "מולדובה"

        Cldr.ME ->
            "מונטנגרו"

        Cldr.MF ->
            "סן מרטן"

        Cldr.MG ->
            "מדגסקר"

        Cldr.MH ->
            "איי מרשל"

        Cldr.MK ->
            "מקדוניה הצפונית"

        Cldr.ML ->
            "מאלי"

        Cldr.MM ->
            "מיאנמר (בורמה)"

        Cldr.MN ->
            "מונגוליה"

        Cldr.MO ->
            "מקאו"

        Cldr.MP ->
            "איי מריאנה הצפוניים"

        Cldr.MQ ->
            "מרטיניק"

        Cldr.MR ->
            "מאוריטניה"

        Cldr.MS ->
            "מונסראט"

        Cldr.MT ->
            "מלטה"

        Cldr.MU ->
            "מאוריציוס"

        Cldr.MV ->
            "האיים המלדיביים"

        Cldr.MW ->
            "מלאווי"

        Cldr.MX ->
            "מקסיקו"

        Cldr.MY ->
            "מלזיה"

        Cldr.MZ ->
            "מוזמביק"

        Cldr.NA ->
            "נמיביה"

        Cldr.NC ->
            "קלדוניה החדשה"

        Cldr.NE ->
            "ניז׳ר"

        Cldr.NF ->
            "האי נורפוק"

        Cldr.NG ->
            "ניגריה"

        Cldr.NI ->
            "ניקרגואה"

        Cldr.NL ->
            "הולנד"

        Cldr.NO ->
            "נורווגיה"

        Cldr.NP ->
            "נפאל"

        Cldr.NR ->
            "נאורו"

        Cldr.NU ->
            "ניווה"

        Cldr.NZ ->
            "ניו זילנד"

        Cldr.OM ->
            "עומאן"

        Cldr.PA ->
            "פנמה"

        Cldr.PE ->
            "פרו"

        Cldr.PF ->
            "פולינזיה הצרפתית"

        Cldr.PG ->
            "פפואה גינאה החדשה"

        Cldr.PH ->
            "הפיליפינים"

        Cldr.PK ->
            "פקיסטן"

        Cldr.PL ->
            "פולין"

        Cldr.PM ->
            "סנט פייר ומיקלון"

        Cldr.PN ->
            "איי פיטקרן"

        Cldr.PR ->
            "פוארטו ריקו"

        Cldr.PS ->
            "פלסטין"

        Cldr.PT ->
            "פורטוגל"

        Cldr.PW ->
            "פלאו"

        Cldr.PY ->
            "פרגוואי"

        Cldr.QA ->
            "קטאר"

        Cldr.RE ->
            "ראוניון"

        Cldr.RO ->
            "רומניה"

        Cldr.RS ->
            "סרביה"

        Cldr.RU ->
            "רוסיה"

        Cldr.RW ->
            "רואנדה"

        Cldr.SA ->
            "ערב הסעודית"

        Cldr.SB ->
            "איי שלמה"

        Cldr.SC ->
            "איי סיישל"

        Cldr.SD ->
            "סודן"

        Cldr.SE ->
            "שוודיה"

        Cldr.SG ->
            "סינגפור"

        Cldr.SH ->
            "סנט הלנה"

        Cldr.SI ->
            "סלובניה"

        Cldr.SJ ->
            "סבאלברד ויאן מאיין"

        Cldr.SK ->
            "סלובקיה"

        Cldr.SL ->
            "סיירה לאון"

        Cldr.SM ->
            "סן מרינו"

        Cldr.SN ->
            "סנגל"

        Cldr.SO ->
            "סומליה"

        Cldr.SR ->
            "סורינאם"

        Cldr.SS ->
            "דרום סודן"

        Cldr.ST ->
            "סאו טומה ופרינסיפה"

        Cldr.SV ->
            "אל סלבדור"

        Cldr.SX ->
            "סנט מארטן"

        Cldr.SY ->
            "סוריה"

        Cldr.SZ ->
            "אסוואטיני"

        Cldr.TC ->
            "איי טרקס וקייקוס"

        Cldr.TD ->
            "צ׳אד"

        Cldr.TF ->
            "הטריטוריות הדרומיות של צרפת"

        Cldr.TG ->
            "טוגו"

        Cldr.TH ->
            "תאילנד"

        Cldr.TJ ->
            "טג׳יקיסטן"

        Cldr.TK ->
            "טוקלאו"

        Cldr.TL ->
            "מזרח טימור"

        Cldr.TM ->
            "טורקמניסטן"

        Cldr.TN ->
            "תוניסיה"

        Cldr.TO ->
            "טונגה"

        Cldr.TR ->
            "טורקיה"

        Cldr.TT ->
            "טרינידד וטובגו"

        Cldr.TV ->
            "טובאלו"

        Cldr.TW ->
            "טייוואן"

        Cldr.TZ ->
            "טנזניה"

        Cldr.UA ->
            "אוקראינה"

        Cldr.UG ->
            "אוגנדה"

        Cldr.UM ->
            "האיים המרוחקים הקטנים של ארה״ב"

        Cldr.US ->
            "ארצות הברית"

        Cldr.UY ->
            "אורוגוואי"

        Cldr.UZ ->
            "אוזבקיסטן"

        Cldr.VA ->
            "הוותיקן"

        Cldr.VC ->
            "סנט וינסנט והגרנדינים"

        Cldr.VE ->
            "ונצואלה"

        Cldr.VG ->
            "איי הבתולה הבריטיים"

        Cldr.VI ->
            "איי הבתולה של ארצות הברית"

        Cldr.VN ->
            "וייטנאם"

        Cldr.VU ->
            "ונואטו"

        Cldr.WF ->
            "איי ווליס ופוטונה"

        Cldr.WS ->
            "סמואה"

        Cldr.XK ->
            "קוסובו"

        Cldr.YE ->
            "תימן"

        Cldr.YT ->
            "מאיוט"

        Cldr.ZA ->
            "דרום אפריקה"

        Cldr.ZM ->
            "זמביה"

        Cldr.ZW ->
            "זימבבואה"