module Cldr.Hindi exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Hindi.

    AD एंडोरा
    AE संयुक्त अरब अमीरात
    AF अफ़गानिस्तान
    AG एंटिगुआ और बरबुडा
    AI एंग्विला
    AL अल्बानिया
    AM आर्मेनिया
    AO अंगोला
    AQ अंटार्कटिका
    AR अर्जेंटीना
    AS अमेरिकी समोआ
    AT ऑस्ट्रिया
    AU ऑस्ट्रेलिया
    AW अरूबा
    AX एलैंड द्वीपसमूह
    AZ अज़रबैजान
    BA बोस्निया और हर्ज़ेगोविना
    BB बारबाडोस
    BD बांग्लादेश
    BE बेल्जियम
    BF बुर्किना फ़ासो
    BG बुल्गारिया
    BH बहरीन
    BI बुरुंडी
    BJ बेनिन
    BL सेंट बार्थेलेमी
    BM बरमूडा
    BN ब्रूनेई
    BO बोलीविया
    BQ कैरिबियन नीदरलैंड
    BR ब्राज़ील
    BS बहामास
    BT भूटान
    BV बोवेत द्वीप
    BW बोत्स्वाना
    BY बेलारूस
    BZ बेलीज़
    CA कनाडा
    CC कोकोस (कीलिंग) द्वीपसमूह
    CD कांगो - किंशासा
    CF मध्य अफ़्रीकी गणराज्य
    CG कांगो – ब्राज़ाविल
    CH स्विट्ज़रलैंड
    CI कोत दिवुआर
    CK कुक द्वीपसमूह
    CL चिली
    CM कैमरून
    CN चीन
    CO कोलंबिया
    CR कोस्टारिका
    CU क्यूबा
    CV केप वर्ड
    CW कुरासाओ
    CX क्रिसमस द्वीप
    CY साइप्रस
    CZ चेकिया
    DE जर्मनी
    DJ जिबूती
    DK डेनमार्क
    DM डोमिनिका
    DO डोमिनिकन गणराज्य
    DZ अल्जीरिया
    EC इक्वाडोर
    EE एस्टोनिया
    EG मिस्र
    EH पश्चिमी सहारा
    ER इरिट्रिया
    ES स्पेन
    ET इथियोपिया
    FI फ़िनलैंड
    FJ फ़िजी
    FK फ़ॉकलैंड द्वीपसमूह
    FM माइक्रोनेशिया
    FO फ़ेरो द्वीपसमूह
    FR फ़्रांस
    GA गैबॉन
    GB यूनाइटेड किंगडम
    GD ग्रेनाडा
    GE जॉर्जिया
    GF फ़्रेंच गुयाना
    GG गर्नसी
    GH घाना
    GI जिब्राल्टर
    GL ग्रीनलैंड
    GM गाम्बिया
    GN गिनी
    GP ग्वाडेलूप
    GQ इक्वेटोरियल गिनी
    GR यूनान
    GS दक्षिण जॉर्जिया और दक्षिण सैंडविच द्वीपसमूह
    GT ग्वाटेमाला
    GU गुआम
    GW गिनी-बिसाउ
    GY गुयाना
    HK हाँग काँग (चीन विशेष प्रशासनिक क्षेत्र)
    HM हर्ड द्वीप और मैकडोनॉल्ड द्वीपसमूह
    HN होंडूरास
    HR क्रोएशिया
    HT हैती
    HU हंगरी
    ID इंडोनेशिया
    IE आयरलैंड
    IL इज़राइल
    IM आइल ऑफ़ मैन
    IN भारत
    IO ब्रिटिश हिंद महासागरीय क्षेत्र
    IQ इराक
    IR ईरान
    IS आइसलैंड
    IT इटली
    JE जर्सी
    JM जमैका
    JO जॉर्डन
    JP जापान
    KE केन्या
    KG किर्गिज़स्तान
    KH कंबोडिया
    KI किरिबाती
    KM कोमोरोस
    KN सेंट किट्स और नेविस
    KP उत्तर कोरिया
    KR दक्षिण कोरिया
    KW कुवैत
    KY कैमेन द्वीपसमूह
    KZ कज़ाखस्तान
    LA लाओस
    LB लेबनान
    LC सेंट लूसिया
    LI लिचेंस्टीन
    LK श्रीलंका
    LR लाइबेरिया
    LS लेसोथो
    LT लिथुआनिया
    LU लग्ज़मबर्ग
    LV लातविया
    LY लीबिया
    MA मोरक्को
    MC मोनाको
    MD मॉल्डोवा
    ME मोंटेनेग्रो
    MF सेंट मार्टिन
    MG मेडागास्कर
    MH मार्शल द्वीपसमूह
    MK उत्तरी मकदूनिया
    ML माली
    MM म्यांमार (बर्मा)
    MN मंगोलिया
    MO मकाऊ (विशेष प्रशासनिक क्षेत्र चीन)
    MP उत्तरी मारियाना द्वीपसमूह
    MQ मार्टीनिक
    MR मॉरिटानिया
    MS मोंटसेरात
    MT माल्टा
    MU मॉरीशस
    MV मालदीव
    MW मलावी
    MX मैक्सिको
    MY मलेशिया
    MZ मोज़ांबिक
    NA नामीबिया
    NC न्यू कैलेडोनिया
    NE नाइजर
    NF नॉरफ़ॉक द्वीप
    NG नाइजीरिया
    NI निकारागुआ
    NL नीदरलैंड
    NO नॉर्वे
    NP नेपाल
    NR नाउरु
    NU नीयू
    NZ न्यूज़ीलैंड
    OM ओमान
    PA पनामा
    PE पेरू
    PF फ़्रेंच पोलिनेशिया
    PG पापुआ न्यू गिनी
    PH फ़िलिपींस
    PK पाकिस्तान
    PL पोलैंड
    PM सेंट पिएरे और मिक्वेलान
    PN पिटकैर्न द्वीपसमूह
    PR पोर्टो रिको
    PS फ़िलिस्तीनी क्षेत्र
    PT पुर्तगाल
    PW पलाऊ
    PY पराग्वे
    QA क़तर
    RE रियूनियन
    RO रोमानिया
    RS सर्बिया
    RU रूस
    RW रवांडा
    SA सऊदी अरब
    SB सोलोमन द्वीपसमूह
    SC सेशेल्स
    SD सूडान
    SE स्वीडन
    SG सिंगापुर
    SH सेंट हेलेना
    SI स्लोवेनिया
    SJ स्वालबार्ड और जान मायेन
    SK स्लोवाकिया
    SL सिएरा लियोन
    SM सैन मेरीनो
    SN सेनेगल
    SO सोमालिया
    SR सूरीनाम
    SS दक्षिण सूडान
    ST साओ टोम और प्रिंसिपे
    SV अल सल्वाडोर
    SX सिंट मार्टिन
    SY सीरिया
    SZ एस्वाटिनी
    TC तुर्क और कैकोज़ द्वीपसमूह
    TD चाड
    TF फ़्रांसीसी दक्षिणी क्षेत्र
    TG टोगो
    TH थाईलैंड
    TJ ताजिकिस्तान
    TK तोकेलाउ
    TL तिमोर-लेस्त
    TM तुर्कमेनिस्तान
    TN ट्यूनीशिया
    TO टोंगा
    TR तुर्किये
    TT त्रिनिदाद और टोबैगो
    TV तुवालू
    TW ताइवान
    TZ तंज़ानिया
    UA यूक्रेन
    UG युगांडा
    UM यू॰एस॰ आउटलाइंग द्वीपसमूह
    US संयुक्त राज्य
    UY उरूग्वे
    UZ उज़्बेकिस्तान
    VA वेटिकन सिटी
    VC सेंट विंसेंट और ग्रेनाडाइंस
    VE वेनेज़ुएला
    VG ब्रिटिश वर्जिन द्वीपसमूह
    VI यू॰एस॰ वर्जिन द्वीपसमूह
    VN वियतनाम
    VU वनुआतू
    WF वालिस और फ़्यूचूना
    WS समोआ
    XK कोसोवो
    YE यमन
    YT मायोते
    ZA दक्षिण अफ़्रीका
    ZM ज़ाम्बिया
    ZW ज़िम्बाब्वे
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "एंडोरा"

        Cldr.AE ->
            "संयुक्त अरब अमीरात"

        Cldr.AF ->
            "अफ़गानिस्तान"

        Cldr.AG ->
            "एंटिगुआ और बरबुडा"

        Cldr.AI ->
            "एंग्विला"

        Cldr.AL ->
            "अल्बानिया"

        Cldr.AM ->
            "आर्मेनिया"

        Cldr.AO ->
            "अंगोला"

        Cldr.AQ ->
            "अंटार्कटिका"

        Cldr.AR ->
            "अर्जेंटीना"

        Cldr.AS ->
            "अमेरिकी समोआ"

        Cldr.AT ->
            "ऑस्ट्रिया"

        Cldr.AU ->
            "ऑस्ट्रेलिया"

        Cldr.AW ->
            "अरूबा"

        Cldr.AX ->
            "एलैंड द्वीपसमूह"

        Cldr.AZ ->
            "अज़रबैजान"

        Cldr.BA ->
            "बोस्निया और हर्ज़ेगोविना"

        Cldr.BB ->
            "बारबाडोस"

        Cldr.BD ->
            "बांग्लादेश"

        Cldr.BE ->
            "बेल्जियम"

        Cldr.BF ->
            "बुर्किना फ़ासो"

        Cldr.BG ->
            "बुल्गारिया"

        Cldr.BH ->
            "बहरीन"

        Cldr.BI ->
            "बुरुंडी"

        Cldr.BJ ->
            "बेनिन"

        Cldr.BL ->
            "सेंट बार्थेलेमी"

        Cldr.BM ->
            "बरमूडा"

        Cldr.BN ->
            "ब्रूनेई"

        Cldr.BO ->
            "बोलीविया"

        Cldr.BQ ->
            "कैरिबियन नीदरलैंड"

        Cldr.BR ->
            "ब्राज़ील"

        Cldr.BS ->
            "बहामास"

        Cldr.BT ->
            "भूटान"

        Cldr.BV ->
            "बोवेत द्वीप"

        Cldr.BW ->
            "बोत्स्वाना"

        Cldr.BY ->
            "बेलारूस"

        Cldr.BZ ->
            "बेलीज़"

        Cldr.CA ->
            "कनाडा"

        Cldr.CC ->
            "कोकोस (कीलिंग) द्वीपसमूह"

        Cldr.CD ->
            "कांगो - किंशासा"

        Cldr.CF ->
            "मध्य अफ़्रीकी गणराज्य"

        Cldr.CG ->
            "कांगो – ब्राज़ाविल"

        Cldr.CH ->
            "स्विट्ज़रलैंड"

        Cldr.CI ->
            "कोत दिवुआर"

        Cldr.CK ->
            "कुक द्वीपसमूह"

        Cldr.CL ->
            "चिली"

        Cldr.CM ->
            "कैमरून"

        Cldr.CN ->
            "चीन"

        Cldr.CO ->
            "कोलंबिया"

        Cldr.CR ->
            "कोस्टारिका"

        Cldr.CU ->
            "क्यूबा"

        Cldr.CV ->
            "केप वर्ड"

        Cldr.CW ->
            "कुरासाओ"

        Cldr.CX ->
            "क्रिसमस द्वीप"

        Cldr.CY ->
            "साइप्रस"

        Cldr.CZ ->
            "चेकिया"

        Cldr.DE ->
            "जर्मनी"

        Cldr.DJ ->
            "जिबूती"

        Cldr.DK ->
            "डेनमार्क"

        Cldr.DM ->
            "डोमिनिका"

        Cldr.DO ->
            "डोमिनिकन गणराज्य"

        Cldr.DZ ->
            "अल्जीरिया"

        Cldr.EC ->
            "इक्वाडोर"

        Cldr.EE ->
            "एस्टोनिया"

        Cldr.EG ->
            "मिस्र"

        Cldr.EH ->
            "पश्चिमी सहारा"

        Cldr.ER ->
            "इरिट्रिया"

        Cldr.ES ->
            "स्पेन"

        Cldr.ET ->
            "इथियोपिया"

        Cldr.FI ->
            "फ़िनलैंड"

        Cldr.FJ ->
            "फ़िजी"

        Cldr.FK ->
            "फ़ॉकलैंड द्वीपसमूह"

        Cldr.FM ->
            "माइक्रोनेशिया"

        Cldr.FO ->
            "फ़ेरो द्वीपसमूह"

        Cldr.FR ->
            "फ़्रांस"

        Cldr.GA ->
            "गैबॉन"

        Cldr.GB ->
            "यूनाइटेड किंगडम"

        Cldr.GD ->
            "ग्रेनाडा"

        Cldr.GE ->
            "जॉर्जिया"

        Cldr.GF ->
            "फ़्रेंच गुयाना"

        Cldr.GG ->
            "गर्नसी"

        Cldr.GH ->
            "घाना"

        Cldr.GI ->
            "जिब्राल्टर"

        Cldr.GL ->
            "ग्रीनलैंड"

        Cldr.GM ->
            "गाम्बिया"

        Cldr.GN ->
            "गिनी"

        Cldr.GP ->
            "ग्वाडेलूप"

        Cldr.GQ ->
            "इक्वेटोरियल गिनी"

        Cldr.GR ->
            "यूनान"

        Cldr.GS ->
            "दक्षिण जॉर्जिया और दक्षिण सैंडविच द्वीपसमूह"

        Cldr.GT_ ->
            "ग्वाटेमाला"

        Cldr.GU ->
            "गुआम"

        Cldr.GW ->
            "गिनी-बिसाउ"

        Cldr.GY ->
            "गुयाना"

        Cldr.HK ->
            "हाँग काँग (चीन विशेष प्रशासनिक क्षेत्र)"

        Cldr.HM ->
            "हर्ड द्वीप और मैकडोनॉल्ड द्वीपसमूह"

        Cldr.HN ->
            "होंडूरास"

        Cldr.HR ->
            "क्रोएशिया"

        Cldr.HT ->
            "हैती"

        Cldr.HU ->
            "हंगरी"

        Cldr.ID ->
            "इंडोनेशिया"

        Cldr.IE ->
            "आयरलैंड"

        Cldr.IL ->
            "इज़राइल"

        Cldr.IM ->
            "आइल ऑफ़ मैन"

        Cldr.IN ->
            "भारत"

        Cldr.IO ->
            "ब्रिटिश हिंद महासागरीय क्षेत्र"

        Cldr.IQ ->
            "इराक"

        Cldr.IR ->
            "ईरान"

        Cldr.IS ->
            "आइसलैंड"

        Cldr.IT ->
            "इटली"

        Cldr.JE ->
            "जर्सी"

        Cldr.JM ->
            "जमैका"

        Cldr.JO ->
            "जॉर्डन"

        Cldr.JP ->
            "जापान"

        Cldr.KE ->
            "केन्या"

        Cldr.KG ->
            "किर्गिज़स्तान"

        Cldr.KH ->
            "कंबोडिया"

        Cldr.KI ->
            "किरिबाती"

        Cldr.KM ->
            "कोमोरोस"

        Cldr.KN ->
            "सेंट किट्स और नेविस"

        Cldr.KP ->
            "उत्तर कोरिया"

        Cldr.KR ->
            "दक्षिण कोरिया"

        Cldr.KW ->
            "कुवैत"

        Cldr.KY ->
            "कैमेन द्वीपसमूह"

        Cldr.KZ ->
            "कज़ाखस्तान"

        Cldr.LA ->
            "लाओस"

        Cldr.LB ->
            "लेबनान"

        Cldr.LC ->
            "सेंट लूसिया"

        Cldr.LI ->
            "लिचेंस्टीन"

        Cldr.LK ->
            "श्रीलंका"

        Cldr.LR ->
            "लाइबेरिया"

        Cldr.LS ->
            "लेसोथो"

        Cldr.LT_ ->
            "लिथुआनिया"

        Cldr.LU ->
            "लग्ज़मबर्ग"

        Cldr.LV ->
            "लातविया"

        Cldr.LY ->
            "लीबिया"

        Cldr.MA ->
            "मोरक्को"

        Cldr.MC ->
            "मोनाको"

        Cldr.MD ->
            "मॉल्डोवा"

        Cldr.ME ->
            "मोंटेनेग्रो"

        Cldr.MF ->
            "सेंट मार्टिन"

        Cldr.MG ->
            "मेडागास्कर"

        Cldr.MH ->
            "मार्शल द्वीपसमूह"

        Cldr.MK ->
            "उत्तरी मकदूनिया"

        Cldr.ML ->
            "माली"

        Cldr.MM ->
            "म्यांमार (बर्मा)"

        Cldr.MN ->
            "मंगोलिया"

        Cldr.MO ->
            "मकाऊ (विशेष प्रशासनिक क्षेत्र चीन)"

        Cldr.MP ->
            "उत्तरी मारियाना द्वीपसमूह"

        Cldr.MQ ->
            "मार्टीनिक"

        Cldr.MR ->
            "मॉरिटानिया"

        Cldr.MS ->
            "मोंटसेरात"

        Cldr.MT ->
            "माल्टा"

        Cldr.MU ->
            "मॉरीशस"

        Cldr.MV ->
            "मालदीव"

        Cldr.MW ->
            "मलावी"

        Cldr.MX ->
            "मैक्सिको"

        Cldr.MY ->
            "मलेशिया"

        Cldr.MZ ->
            "मोज़ांबिक"

        Cldr.NA ->
            "नामीबिया"

        Cldr.NC ->
            "न्यू कैलेडोनिया"

        Cldr.NE ->
            "नाइजर"

        Cldr.NF ->
            "नॉरफ़ॉक द्वीप"

        Cldr.NG ->
            "नाइजीरिया"

        Cldr.NI ->
            "निकारागुआ"

        Cldr.NL ->
            "नीदरलैंड"

        Cldr.NO ->
            "नॉर्वे"

        Cldr.NP ->
            "नेपाल"

        Cldr.NR ->
            "नाउरु"

        Cldr.NU ->
            "नीयू"

        Cldr.NZ ->
            "न्यूज़ीलैंड"

        Cldr.OM ->
            "ओमान"

        Cldr.PA ->
            "पनामा"

        Cldr.PE ->
            "पेरू"

        Cldr.PF ->
            "फ़्रेंच पोलिनेशिया"

        Cldr.PG ->
            "पापुआ न्यू गिनी"

        Cldr.PH ->
            "फ़िलिपींस"

        Cldr.PK ->
            "पाकिस्तान"

        Cldr.PL ->
            "पोलैंड"

        Cldr.PM ->
            "सेंट पिएरे और मिक्वेलान"

        Cldr.PN ->
            "पिटकैर्न द्वीपसमूह"

        Cldr.PR ->
            "पोर्टो रिको"

        Cldr.PS ->
            "फ़िलिस्तीनी क्षेत्र"

        Cldr.PT ->
            "पुर्तगाल"

        Cldr.PW ->
            "पलाऊ"

        Cldr.PY ->
            "पराग्वे"

        Cldr.QA ->
            "क़तर"

        Cldr.RE ->
            "रियूनियन"

        Cldr.RO ->
            "रोमानिया"

        Cldr.RS ->
            "सर्बिया"

        Cldr.RU ->
            "रूस"

        Cldr.RW ->
            "रवांडा"

        Cldr.SA ->
            "सऊदी अरब"

        Cldr.SB ->
            "सोलोमन द्वीपसमूह"

        Cldr.SC ->
            "सेशेल्स"

        Cldr.SD ->
            "सूडान"

        Cldr.SE ->
            "स्वीडन"

        Cldr.SG ->
            "सिंगापुर"

        Cldr.SH ->
            "सेंट हेलेना"

        Cldr.SI ->
            "स्लोवेनिया"

        Cldr.SJ ->
            "स्वालबार्ड और जान मायेन"

        Cldr.SK ->
            "स्लोवाकिया"

        Cldr.SL ->
            "सिएरा लियोन"

        Cldr.SM ->
            "सैन मेरीनो"

        Cldr.SN ->
            "सेनेगल"

        Cldr.SO ->
            "सोमालिया"

        Cldr.SR ->
            "सूरीनाम"

        Cldr.SS ->
            "दक्षिण सूडान"

        Cldr.ST ->
            "साओ टोम और प्रिंसिपे"

        Cldr.SV ->
            "अल सल्वाडोर"

        Cldr.SX ->
            "सिंट मार्टिन"

        Cldr.SY ->
            "सीरिया"

        Cldr.SZ ->
            "एस्वाटिनी"

        Cldr.TC ->
            "तुर्क और कैकोज़ द्वीपसमूह"

        Cldr.TD ->
            "चाड"

        Cldr.TF ->
            "फ़्रांसीसी दक्षिणी क्षेत्र"

        Cldr.TG ->
            "टोगो"

        Cldr.TH ->
            "थाईलैंड"

        Cldr.TJ ->
            "ताजिकिस्तान"

        Cldr.TK ->
            "तोकेलाउ"

        Cldr.TL ->
            "तिमोर-लेस्त"

        Cldr.TM ->
            "तुर्कमेनिस्तान"

        Cldr.TN ->
            "ट्यूनीशिया"

        Cldr.TO ->
            "टोंगा"

        Cldr.TR ->
            "तुर्किये"

        Cldr.TT ->
            "त्रिनिदाद और टोबैगो"

        Cldr.TV ->
            "तुवालू"

        Cldr.TW ->
            "ताइवान"

        Cldr.TZ ->
            "तंज़ानिया"

        Cldr.UA ->
            "यूक्रेन"

        Cldr.UG ->
            "युगांडा"

        Cldr.UM ->
            "यू॰एस॰ आउटलाइंग द्वीपसमूह"

        Cldr.US ->
            "संयुक्त राज्य"

        Cldr.UY ->
            "उरूग्वे"

        Cldr.UZ ->
            "उज़्बेकिस्तान"

        Cldr.VA ->
            "वेटिकन सिटी"

        Cldr.VC ->
            "सेंट विंसेंट और ग्रेनाडाइंस"

        Cldr.VE ->
            "वेनेज़ुएला"

        Cldr.VG ->
            "ब्रिटिश वर्जिन द्वीपसमूह"

        Cldr.VI ->
            "यू॰एस॰ वर्जिन द्वीपसमूह"

        Cldr.VN ->
            "वियतनाम"

        Cldr.VU ->
            "वनुआतू"

        Cldr.WF ->
            "वालिस और फ़्यूचूना"

        Cldr.WS ->
            "समोआ"

        Cldr.XK ->
            "कोसोवो"

        Cldr.YE ->
            "यमन"

        Cldr.YT ->
            "मायोते"

        Cldr.ZA ->
            "दक्षिण अफ़्रीका"

        Cldr.ZM ->
            "ज़ाम्बिया"

        Cldr.ZW ->
            "ज़िम्बाब्वे"