module Cldr.Kazakh exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Kazakh.

    AD Андорра
    AE Біріккен Араб Әмірліктері
    AF Ауғанстан
    AG Антигуа және Барбуда
    AI Ангилья
    AL Албания
    AM Армения
    AO Ангола
    AQ Антарктида
    AR Аргентина
    AS Америкалық Самоа
    AT Аустрия
    AU Аустралия
    AW Аруба
    AX Аланд аралдары
    AZ Әзірбайжан
    BA Босния және Герцеговина
    BB Барбадос
    BD Бангладеш
    BE Бельгия
    BF Буркина-Фасо
    BG Болгария
    BH Бахрейн
    BI Бурунди
    BJ Бенин
    BL Сен-Бартелеми
    BM Бермуд аралдары
    BN Бруней
    BO Боливия
    BQ Бонэйр, Синт-Эстатиус және Саба
    BR Бразилия
    BS Багам аралдары
    BT Бутан
    BV Буве аралы
    BW Ботсвана
    BY Беларусь
    BZ Белиз
    CA Канада
    CC Кокос (Килинг) аралдары
    CD Конго
    CF Орталық Африка Республикасы
    CG Конго-Браззавиль Республикасы
    CH Швейцария
    CI Кот-д’Ивуар
    CK Кук аралдары
    CL Чили
    CM Камерун
    CN Қытай
    CO Колумбия
    CR Коста-Рика
    CU Куба
    CV Кабо-Верде
    CW Кюрасао
    CX Рождество аралы
    CY Кипр
    CZ Чехия
    DE Германия
    DJ Джибути
    DK Дания
    DM Доминика
    DO Доминикан Республикасы
    DZ Алжир
    EC Эквадор
    EE Эстония
    EG Мысыр
    EH Батыс Сахара
    ER Эритрея
    ES Испания
    ET Эфиопия
    FI Финляндия
    FJ Фиджи
    FK Фолкленд аралдары
    FM Микронезия
    FO Фарер аралдары
    FR Франция
    GA Габон
    GB Ұлыбритания
    GD Гренада
    GE Грузия
    GF Француз Гвианасы
    GG Гернси
    GH Гана
    GI Гибралтар
    GL Гренландия
    GM Гамбия
    GN Гвинея
    GP Гваделупа
    GQ Экваторлық Гвинея
    GR Грекия
    GS Оңтүстік Георгия және Оңтүстік Сандвич аралдары
    GT Гватемала
    GU Гуам
    GW Гвинея-Бисау
    GY Гайана
    HK Сянган АӘА
    HM Херд аралы және Макдональд аралдары
    HN Гондурас
    HR Хорватия
    HT Гаити
    HU Венгрия
    ID Индонезия
    IE Ирландия
    IL Израиль
    IM Мэн аралы
    IN Үндістан
    IO Үнді мұхитындағы Британ аймағы
    IQ Ирак
    IR Иран
    IS Исландия
    IT Италия
    JE Джерси
    JM Ямайка
    JO Иордания
    JP Жапония
    KE Кения
    KG Қырғызстан
    KH Камбоджа
    KI Кирибати
    KM Комор аралдары
    KN Сент-Китс және Невис
    KP Солтүстік Корея
    KR Оңтүстік Корея
    KW Кувейт
    KY Кайман аралдары
    KZ Қазақстан
    LA Лаос
    LB Ливан
    LC Сент-Люсия
    LI Лихтенштейн
    LK Шри-Ланка
    LR Либерия
    LS Лесото
    LT Литва
    LU Люксембург
    LV Латвия
    LY Ливия
    MA Марокко
    MC Монако
    MD Молдова
    ME Черногория
    MF Сен-Мартен
    MG Мадагаскар
    MH Маршалл аралдары
    MK Солтүстік Македония
    ML Мали
    MM Мьянма (Бирма)
    MN Моңғолия
    MO Макао АӘА
    MP Солтүстік Мариана аралдары
    MQ Мартиника
    MR Мавритания
    MS Монтсеррат
    MT Мальта
    MU Маврикий
    MV Мальдив аралдары
    MW Малави
    MX Мексика
    MY Малайзия
    MZ Мозамбик
    NA Намибия
    NC Жаңа Каледония
    NE Нигер
    NF Норфолк аралы
    NG Нигерия
    NI Никарагуа
    NL Нидерланд
    NO Норвегия
    NP Непал
    NR Науру
    NU Ниуэ
    NZ Жаңа Зеландия
    OM Оман
    PA Панама
    PE Перу
    PF Француз Полинезиясы
    PG Папуа — Жаңа Гвинея
    PH Филиппин аралдары
    PK Пәкістан
    PL Польша
    PM Сен-Пьер және Микелон
    PN Питкэрн аралдары
    PR Пуэрто-Рико
    PS Палестина аймақтары
    PT Португалия
    PW Палау
    PY Парагвай
    QA Катар
    RE Реюньон
    RO Румыния
    RS Сербия
    RU Ресей
    RW Руанда
    SA Сауд Арабиясы
    SB Соломон аралдары
    SC Сейшель аралдары
    SD Судан
    SE Швеция
    SG Сингапур
    SH Әулие Елена аралы
    SI Словения
    SJ Шпицберген және Ян-Майен
    SK Словакия
    SL Сьерра-Леоне
    SM Сан-Марино
    SN Сенегал
    SO Сомали
    SR Суринам
    SS Оңтүстік Судан
    ST Сан-Томе және Принсипи
    SV Сальвадор
    SX Синт-Мартен
    SY Сирия
    SZ Эсватини
    TC Теркс және Кайкос аралдары
    TD Чад
    TF Францияның оңтүстік аймақтары
    TG Того
    TH Таиланд
    TJ Тәжікстан
    TK Токелау
    TL Тимор-Лесте
    TM Түрікменстан
    TN Тунис
    TO Тонга
    TR Түркия
    TT Тринидад және Тобаго
    TV Тувалу
    TW Тайвань
    TZ Танзания
    UA Украина
    UG Уганда
    UM АҚШ-тың сыртқы кіші аралдары
    US Америка Құрама Штаттары
    UY Уругвай
    UZ Өзбекстан
    VA Ватикан
    VC Сент-Винсент және Гренадин аралдары
    VE Венесуэла
    VG Британдық Виргин аралдары
    VI АҚШ-тың Виргин аралдары
    VN Вьетнам
    VU Вануату
    WF Уоллис және Футуна
    WS Самоа
    XK Косово
    YE Йемен
    YT Майотта
    ZA Оңтүстік Африка
    ZM Замбия
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Андорра"

        Cldr.AE ->
            "Біріккен Араб Әмірліктері"

        Cldr.AF ->
            "Ауғанстан"

        Cldr.AG ->
            "Антигуа және Барбуда"

        Cldr.AI ->
            "Ангилья"

        Cldr.AL ->
            "Албания"

        Cldr.AM ->
            "Армения"

        Cldr.AO ->
            "Ангола"

        Cldr.AQ ->
            "Антарктида"

        Cldr.AR ->
            "Аргентина"

        Cldr.AS ->
            "Америкалық Самоа"

        Cldr.AT ->
            "Аустрия"

        Cldr.AU ->
            "Аустралия"

        Cldr.AW ->
            "Аруба"

        Cldr.AX ->
            "Аланд аралдары"

        Cldr.AZ ->
            "Әзірбайжан"

        Cldr.BA ->
            "Босния және Герцеговина"

        Cldr.BB ->
            "Барбадос"

        Cldr.BD ->
            "Бангладеш"

        Cldr.BE ->
            "Бельгия"

        Cldr.BF ->
            "Буркина-Фасо"

        Cldr.BG ->
            "Болгария"

        Cldr.BH ->
            "Бахрейн"

        Cldr.BI ->
            "Бурунди"

        Cldr.BJ ->
            "Бенин"

        Cldr.BL ->
            "Сен-Бартелеми"

        Cldr.BM ->
            "Бермуд аралдары"

        Cldr.BN ->
            "Бруней"

        Cldr.BO ->
            "Боливия"

        Cldr.BQ ->
            "Бонэйр, Синт-Эстатиус және Саба"

        Cldr.BR ->
            "Бразилия"

        Cldr.BS ->
            "Багам аралдары"

        Cldr.BT ->
            "Бутан"

        Cldr.BV ->
            "Буве аралы"

        Cldr.BW ->
            "Ботсвана"

        Cldr.BY ->
            "Беларусь"

        Cldr.BZ ->
            "Белиз"

        Cldr.CA ->
            "Канада"

        Cldr.CC ->
            "Кокос (Килинг) аралдары"

        Cldr.CD ->
            "Конго"

        Cldr.CF ->
            "Орталық Африка Республикасы"

        Cldr.CG ->
            "Конго-Браззавиль Республикасы"

        Cldr.CH ->
            "Швейцария"

        Cldr.CI ->
            "Кот-д’Ивуар"

        Cldr.CK ->
            "Кук аралдары"

        Cldr.CL ->
            "Чили"

        Cldr.CM ->
            "Камерун"

        Cldr.CN ->
            "Қытай"

        Cldr.CO ->
            "Колумбия"

        Cldr.CR ->
            "Коста-Рика"

        Cldr.CU ->
            "Куба"

        Cldr.CV ->
            "Кабо-Верде"

        Cldr.CW ->
            "Кюрасао"

        Cldr.CX ->
            "Рождество аралы"

        Cldr.CY ->
            "Кипр"

        Cldr.CZ ->
            "Чехия"

        Cldr.DE ->
            "Германия"

        Cldr.DJ ->
            "Джибути"

        Cldr.DK ->
            "Дания"

        Cldr.DM ->
            "Доминика"

        Cldr.DO ->
            "Доминикан Республикасы"

        Cldr.DZ ->
            "Алжир"

        Cldr.EC ->
            "Эквадор"

        Cldr.EE ->
            "Эстония"

        Cldr.EG ->
            "Мысыр"

        Cldr.EH ->
            "Батыс Сахара"

        Cldr.ER ->
            "Эритрея"

        Cldr.ES ->
            "Испания"

        Cldr.ET ->
            "Эфиопия"

        Cldr.FI ->
            "Финляндия"

        Cldr.FJ ->
            "Фиджи"

        Cldr.FK ->
            "Фолкленд аралдары"

        Cldr.FM ->
            "Микронезия"

        Cldr.FO ->
            "Фарер аралдары"

        Cldr.FR ->
            "Франция"

        Cldr.GA ->
            "Габон"

        Cldr.GB ->
            "Ұлыбритания"

        Cldr.GD ->
            "Гренада"

        Cldr.GE ->
            "Грузия"

        Cldr.GF ->
            "Француз Гвианасы"

        Cldr.GG ->
            "Гернси"

        Cldr.GH ->
            "Гана"

        Cldr.GI ->
            "Гибралтар"

        Cldr.GL ->
            "Гренландия"

        Cldr.GM ->
            "Гамбия"

        Cldr.GN ->
            "Гвинея"

        Cldr.GP ->
            "Гваделупа"

        Cldr.GQ ->
            "Экваторлық Гвинея"

        Cldr.GR ->
            "Грекия"

        Cldr.GS ->
            "Оңтүстік Георгия және Оңтүстік Сандвич аралдары"

        Cldr.GT_ ->
            "Гватемала"

        Cldr.GU ->
            "Гуам"

        Cldr.GW ->
            "Гвинея-Бисау"

        Cldr.GY ->
            "Гайана"

        Cldr.HK ->
            "Сянган АӘА"

        Cldr.HM ->
            "Херд аралы және Макдональд аралдары"

        Cldr.HN ->
            "Гондурас"

        Cldr.HR ->
            "Хорватия"

        Cldr.HT ->
            "Гаити"

        Cldr.HU ->
            "Венгрия"

        Cldr.ID ->
            "Индонезия"

        Cldr.IE ->
            "Ирландия"

        Cldr.IL ->
            "Израиль"

        Cldr.IM ->
            "Мэн аралы"

        Cldr.IN ->
            "Үндістан"

        Cldr.IO ->
            "Үнді мұхитындағы Британ аймағы"

        Cldr.IQ ->
            "Ирак"

        Cldr.IR ->
            "Иран"

        Cldr.IS ->
            "Исландия"

        Cldr.IT ->
            "Италия"

        Cldr.JE ->
            "Джерси"

        Cldr.JM ->
            "Ямайка"

        Cldr.JO ->
            "Иордания"

        Cldr.JP ->
            "Жапония"

        Cldr.KE ->
            "Кения"

        Cldr.KG ->
            "Қырғызстан"

        Cldr.KH ->
            "Камбоджа"

        Cldr.KI ->
            "Кирибати"

        Cldr.KM ->
            "Комор аралдары"

        Cldr.KN ->
            "Сент-Китс және Невис"

        Cldr.KP ->
            "Солтүстік Корея"

        Cldr.KR ->
            "Оңтүстік Корея"

        Cldr.KW ->
            "Кувейт"

        Cldr.KY ->
            "Кайман аралдары"

        Cldr.KZ ->
            "Қазақстан"

        Cldr.LA ->
            "Лаос"

        Cldr.LB ->
            "Ливан"

        Cldr.LC ->
            "Сент-Люсия"

        Cldr.LI ->
            "Лихтенштейн"

        Cldr.LK ->
            "Шри-Ланка"

        Cldr.LR ->
            "Либерия"

        Cldr.LS ->
            "Лесото"

        Cldr.LT_ ->
            "Литва"

        Cldr.LU ->
            "Люксембург"

        Cldr.LV ->
            "Латвия"

        Cldr.LY ->
            "Ливия"

        Cldr.MA ->
            "Марокко"

        Cldr.MC ->
            "Монако"

        Cldr.MD ->
            "Молдова"

        Cldr.ME ->
            "Черногория"

        Cldr.MF ->
            "Сен-Мартен"

        Cldr.MG ->
            "Мадагаскар"

        Cldr.MH ->
            "Маршалл аралдары"

        Cldr.MK ->
            "Солтүстік Македония"

        Cldr.ML ->
            "Мали"

        Cldr.MM ->
            "Мьянма (Бирма)"

        Cldr.MN ->
            "Моңғолия"

        Cldr.MO ->
            "Макао АӘА"

        Cldr.MP ->
            "Солтүстік Мариана аралдары"

        Cldr.MQ ->
            "Мартиника"

        Cldr.MR ->
            "Мавритания"

        Cldr.MS ->
            "Монтсеррат"

        Cldr.MT ->
            "Мальта"

        Cldr.MU ->
            "Маврикий"

        Cldr.MV ->
            "Мальдив аралдары"

        Cldr.MW ->
            "Малави"

        Cldr.MX ->
            "Мексика"

        Cldr.MY ->
            "Малайзия"

        Cldr.MZ ->
            "Мозамбик"

        Cldr.NA ->
            "Намибия"

        Cldr.NC ->
            "Жаңа Каледония"

        Cldr.NE ->
            "Нигер"

        Cldr.NF ->
            "Норфолк аралы"

        Cldr.NG ->
            "Нигерия"

        Cldr.NI ->
            "Никарагуа"

        Cldr.NL ->
            "Нидерланд"

        Cldr.NO ->
            "Норвегия"

        Cldr.NP ->
            "Непал"

        Cldr.NR ->
            "Науру"

        Cldr.NU ->
            "Ниуэ"

        Cldr.NZ ->
            "Жаңа Зеландия"

        Cldr.OM ->
            "Оман"

        Cldr.PA ->
            "Панама"

        Cldr.PE ->
            "Перу"

        Cldr.PF ->
            "Француз Полинезиясы"

        Cldr.PG ->
            "Папуа — Жаңа Гвинея"

        Cldr.PH ->
            "Филиппин аралдары"

        Cldr.PK ->
            "Пәкістан"

        Cldr.PL ->
            "Польша"

        Cldr.PM ->
            "Сен-Пьер және Микелон"

        Cldr.PN ->
            "Питкэрн аралдары"

        Cldr.PR ->
            "Пуэрто-Рико"

        Cldr.PS ->
            "Палестина аймақтары"

        Cldr.PT ->
            "Португалия"

        Cldr.PW ->
            "Палау"

        Cldr.PY ->
            "Парагвай"

        Cldr.QA ->
            "Катар"

        Cldr.RE ->
            "Реюньон"

        Cldr.RO ->
            "Румыния"

        Cldr.RS ->
            "Сербия"

        Cldr.RU ->
            "Ресей"

        Cldr.RW ->
            "Руанда"

        Cldr.SA ->
            "Сауд Арабиясы"

        Cldr.SB ->
            "Соломон аралдары"

        Cldr.SC ->
            "Сейшель аралдары"

        Cldr.SD ->
            "Судан"

        Cldr.SE ->
            "Швеция"

        Cldr.SG ->
            "Сингапур"

        Cldr.SH ->
            "Әулие Елена аралы"

        Cldr.SI ->
            "Словения"

        Cldr.SJ ->
            "Шпицберген және Ян-Майен"

        Cldr.SK ->
            "Словакия"

        Cldr.SL ->
            "Сьерра-Леоне"

        Cldr.SM ->
            "Сан-Марино"

        Cldr.SN ->
            "Сенегал"

        Cldr.SO ->
            "Сомали"

        Cldr.SR ->
            "Суринам"

        Cldr.SS ->
            "Оңтүстік Судан"

        Cldr.ST ->
            "Сан-Томе және Принсипи"

        Cldr.SV ->
            "Сальвадор"

        Cldr.SX ->
            "Синт-Мартен"

        Cldr.SY ->
            "Сирия"

        Cldr.SZ ->
            "Эсватини"

        Cldr.TC ->
            "Теркс және Кайкос аралдары"

        Cldr.TD ->
            "Чад"

        Cldr.TF ->
            "Францияның оңтүстік аймақтары"

        Cldr.TG ->
            "Того"

        Cldr.TH ->
            "Таиланд"

        Cldr.TJ ->
            "Тәжікстан"

        Cldr.TK ->
            "Токелау"

        Cldr.TL ->
            "Тимор-Лесте"

        Cldr.TM ->
            "Түрікменстан"

        Cldr.TN ->
            "Тунис"

        Cldr.TO ->
            "Тонга"

        Cldr.TR ->
            "Түркия"

        Cldr.TT ->
            "Тринидад және Тобаго"

        Cldr.TV ->
            "Тувалу"

        Cldr.TW ->
            "Тайвань"

        Cldr.TZ ->
            "Танзания"

        Cldr.UA ->
            "Украина"

        Cldr.UG ->
            "Уганда"

        Cldr.UM ->
            "АҚШ-тың сыртқы кіші аралдары"

        Cldr.US ->
            "Америка Құрама Штаттары"

        Cldr.UY ->
            "Уругвай"

        Cldr.UZ ->
            "Өзбекстан"

        Cldr.VA ->
            "Ватикан"

        Cldr.VC ->
            "Сент-Винсент және Гренадин аралдары"

        Cldr.VE ->
            "Венесуэла"

        Cldr.VG ->
            "Британдық Виргин аралдары"

        Cldr.VI ->
            "АҚШ-тың Виргин аралдары"

        Cldr.VN ->
            "Вьетнам"

        Cldr.VU ->
            "Вануату"

        Cldr.WF ->
            "Уоллис және Футуна"

        Cldr.WS ->
            "Самоа"

        Cldr.XK ->
            "Косово"

        Cldr.YE ->
            "Йемен"

        Cldr.YT ->
            "Майотта"

        Cldr.ZA ->
            "Оңтүстік Африка"

        Cldr.ZM ->
            "Замбия"

        Cldr.ZW ->
            "Зимбабве"