module Cldr.Khmer exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Khmer.

    AD អង់ដូរ៉ា
    AE អេមីរ៉ាត​អារ៉ាប់​រួម
    AF អាហ្វហ្កានីស្ថាន
    AG អង់ទីហ្គា និង បាប៊ុយដា
    AI អង់ហ្គីឡា
    AL អាល់បានី
    AM អាមេនី
    AO អង់ហ្គោឡា
    AQ អង់តាក់ទិក
    AR អាហ្សង់ទីន
    AS សាម័រ អាមេរិកាំង
    AT អូទ្រីស
    AU អូស្ត្រាលី
    AW អារូបា
    AX កោះ​អាឡង់
    AZ អាស៊ែបៃហ្សង់
    BA បូស្ន៊ី និងហឺហ្ស៊ីហ្គូវីណា
    BB បាបាដុស
    BD បង់ក្លាដែស
    BE បែលហ្ស៊ិក
    BF បួគីណាហ្វាសូ
    BG ប៊ុលហ្ការី
    BH បារ៉ែន
    BI ប៊ូរុនឌី
    BJ បេណាំង
    BL សាំង​បាថេឡេមី
    BM ប៊ឺមុយដា
    BN ព្រុយណេ
    BO បូលីវី
    BQ ហូឡង់ ការ៉ាប៊ីន
    BR ប្រេស៊ីល
    BS បាហាម៉ា
    BT ប៊ូតង់
    BV កោះ​ប៊ូវ៉េត
    BW បុតស្វាណា
    BY បេឡារុស
    BZ បេលី
    CA កាណាដា
    CC កោះ​កូកូស (គីលីង)
    CD កុងហ្គោ (សាធារណរដ្ឋ​ប្រជាធិបតេយ្យ)
    CF សាធារណរដ្ឋអាហ្វ្រិកកណ្ដាល
    CG កុងហ្គោ (សធារណរដ្ឋ)
    CH ស្វ៊ីស
    CI កូតឌីវ័រ
    CK កោះ​ខូក
    CL ស៊ីលី
    CM កាមេរូន
    CN ចិន
    CO កូឡុំប៊ី
    CR កូស្តារីកា
    CU គុយបា
    CV កាប់វែរ
    CW កូរ៉ាកៅ
    CX កោះ​គ្រីស្មាស
    CY ស៊ីប
    CZ សាធារណរដ្ឋឆែក
    DE អាល្លឺម៉ង់
    DJ ជីប៊ូទី
    DK ដាណឺម៉ាក
    DM ដូមីនីក
    DO សាធារណរដ្ឋ​ដូមីនីក
    DZ អាល់ហ្សេរី
    EC អេក្វាទ័រ
    EE អេស្តូនី
    EG អេហ្ស៊ីប
    EH សាហារ៉ាខាងលិច
    ER អេរីត្រេ
    ES អេស្ប៉ាញ
    ET អេត្យូពី
    FI ហ្វាំងឡង់
    FJ ហ្វីជី
    FK កោះ​ហ្វក់ឡែន
    FM មីក្រូណេស៊ី
    FO កោះ​ហ្វារ៉ូ
    FR បារាំង
    GA ហ្គាបុង
    GB ចក្រភព​អង់គ្លេស
    GD ហ្គ្រើណាដ
    GE ហ្សកហ្ស៊ី
    GF ហ្គីអាណា បារាំង
    GG ហ្គេនស៊ី
    GH ហ្គាណា
    GI ហ្ស៊ីប្រាល់តា
    GL ហ្គ្រោអង់ឡង់
    GM ហ្គំប៊ី
    GN ហ្គីណេ
    GP ហ្គោដឺឡុប
    GQ ហ្គីណេអេក្វាទ័រ
    GR ក្រិក
    GS កោះ​ហ្សកហ្ស៊ី​ខាងត្បូង និង សង់វិច​ខាងត្បូង
    GT ក្វាតេម៉ាឡា
    GU ហ្គាំ
    GW ហ្គីណេប៊ីស្សូ
    GY ហ្គីយ៉ាន
    HK ហុងកុង
    HM កោះ​ហឺដនិង​ម៉ាក់ដូណាល់
    HN ហុងឌូរ៉ាស
    HR ក្រូអាស៊ី
    HT ហៃទី
    HU ហុងគ្រី
    ID ឥណ្ឌូណេស៊ី
    IE អៀរឡង់
    IL អ៊ីស្រាអែល
    IM អែលអុហ្វមែន
    IN ឥណ្ឌា
    IO ដែនដី​អង់គ្លេស​នៅ​មហា​សមុទ្រ​ឥណ្ឌា
    IQ អ៊ីរ៉ាក់
    IR អ៊ីរ៉ង់
    IS អ៊ីស្លង់
    IT អ៊ីតាលី
    JE ជើស៊ី
    JM ហ្សាម៉ាអ៊ីក
    JO ហ៊្សកដានី
    JP ជប៉ុន
    KE កេនយ៉ា
    KG កៀហ្ស៊ីស៊ីស្ថាន
    KH កម្ពុជា
    KI គិរីបាទី
    KM កូម័រ
    KN សាំង​គីត និង ណេវីស
    KP កូរ៉េ​ខាង​ជើង
    KR កូរ៉េ​ខាង​ត្បូង
    KW កូវ៉ែត
    KY កោះ​កៃម៉ង់
    KZ កាហ្សាក់ស្ថាន
    LA ឡាវ
    LB លីបង់
    LC សាំងលូស៊ី
    LI លិចតិនស្ដាញ
    LK ស្រីលង្កា
    LR លីបេរីយ៉ា
    LS ឡេសូតូ
    LT លីទុយអានី
    LU លុចសំបួ
    LV ឡេតូនី
    LY លីប៊ី
    MA ម៉ារ៉ុក
    MC ម៉ូណាកូ
    MD ម៉ុលដាវី
    ME ម៉ុងតេណេហ្គ្រោ
    MF សាំង​ម៉ាទីន
    MG ម៉ាដាហ្គាស្កា
    MH កោះ​ម៉ាស់សល
    MK ម៉ាសេដ្វានខាងជើង
    ML ម៉ាលី
    MM មីយ៉ាន់ម៉ា (ភូមា)
    MN ម៉ុងហ្គោលី
    MO ម៉ាកាវ
    MP កោះ​ម៉ារីណា​ខាង​ជើង
    MQ ម៉ាទីនីក
    MR ម៉ូរីតានី
    MS ម៉ុងស៊ែរ៉ា
    MT ម៉ាល់ត៍
    MU ម៉ូរីស
    MV ម៉ាល់ឌីវ
    MW ម៉ាឡាវី
    MX ម៉ិកស៊ិក
    MY ម៉ាឡេស៊ី
    MZ ម៉ូសំប៊ិក
    NA ណាមីប៊ី
    NC នូវែល​កាឡេដូនី
    NE នីហ្សេ
    NF កោះ​ណ័រហ្វក់
    NG នីហ្សេរីយ៉ា
    NI នីការ៉ាហ្គា
    NL ហូឡង់
    NO ន័រវែស
    NP នេប៉ាល់
    NR ណូរូ
    NU ណៀ
    NZ នូវែល​សេឡង់
    OM អូម៉ង់
    PA ប៉ាណាម៉ា
    PE ប៉េរូ
    PF ប៉ូលី​ណេស៊ី​បារាំង
    PG ប៉ាពូអាស៊ី​នូវែលហ្គីណេ
    PH ហ្វ៊ីលីពីន
    PK ប៉ាគីស្ថាន
    PL ប៉ូឡូញ
    PM សង់ព្យែរ និង​មីគីឡុង
    PN កោះ​ភីតកាន
    PR ព័រតូរីកូ
    PS ប៉ាឡេស្ទីន
    PT ព័រទុយហ្កាល់
    PW ផៅឡូ
    PY ប៉ារ៉ាហ្គាយ
    QA កាតា
    RE រេអុយញ៉ុង
    RO រូម៉ានី
    RS សែប៊ី
    RU រុស្ស៊ី
    RW រវ៉ាន់ដា
    SA អារ៉ាប៊ីសាអូឌីត
    SB កោះ​សូឡូម៉ុង
    SC សីស្ហែល
    SD ស៊ូដង់
    SE ស៊ុយអែត
    SG សិង្ហបុរី
    SH សង់​ហេឡេណា
    SI ស្លូវេនី
    SJ ស្វាលបាដ និង ហ្សង់ម៉ាយេន
    SK ស្លូវ៉ាគី
    SL សៀរ៉ាឡេអូន
    SM សាន​ម៉ារីណូ
    SN សេណេហ្គាល់
    SO សូម៉ាលី
    SR សូរីណាម
    SS ស៊ូដង់​ខាង​ត្បូង
    ST សៅតូម៉េ និង ប្រាំងស៊ីប
    SV អែលសាល់វ៉ាឌ័រ
    SX សីង​ម៉ាធីន
    SY ស៊ីរី
    SZ ស្វាស៊ីឡង់
    TC កោះ​ទួគ និង កៃកូស
    TD ឆាដ
    TF ដែនដី​បារាំង​នៅ​ភាគខាងត្បូង
    TG តូហ្គោ
    TH ថៃ
    TJ តាហ្ស៊ីគីស្ថាន
    TK តូខេឡៅ
    TL ទីម័រ​ខាង​កើត
    TM តួកម៉េនីស្ថាន
    TN ទុយនីស៊ី
    TO តុងហ្គា
    TR តួកគី
    TT ទ្រីនីដាត និង​តូបាហ្គោ
    TV ទូវ៉ាលូ
    TW តៃវ៉ាន់
    TZ តង់សានី
    UA អ៊ុយក្រែន
    UG អ៊ូហ្គង់ដា
    UM កោះ​អៅឡាយីង​អាមេរិក
    US សហរដ្ឋអាមេរិក
    UY អ៊ុយរូហ្គាយ
    UZ អ៊ូសបេគីស្ថាន
    VA បុរី​វ៉ាទីកង់
    VC សាំង​វ៉ាំងសង់ និង ហ្គ្រេណាឌីន
    VE វ៉េណេស៊ុយអេឡា
    VG កោះ​វឺជិន​ចក្រភព​អង់គ្លេស
    VI កោះ​វឺជីន​អាមេរិក
    VN វៀតណាម
    VU វ៉ានូទូ
    WF វ៉ាលីស និង​ហ្វូទូណា
    WS សាម័រ
    XK កូសូវ៉ូ
    YE យេម៉ែន
    YT ម៉ាយុត
    ZA អាហ្វ្រិកខាងត្បូង
    ZM សំប៊ី
    ZW ស៊ីមបាវ៉េ
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "អង់ដូរ៉ា"

        Cldr.AE ->
            "អេមីរ៉ាត​អារ៉ាប់​រួម"

        Cldr.AF ->
            "អាហ្វហ្កានីស្ថាន"

        Cldr.AG ->
            "អង់ទីហ្គា និង បាប៊ុយដា"

        Cldr.AI ->
            "អង់ហ្គីឡា"

        Cldr.AL ->
            "អាល់បានី"

        Cldr.AM ->
            "អាមេនី"

        Cldr.AO ->
            "អង់ហ្គោឡា"

        Cldr.AQ ->
            "អង់តាក់ទិក"

        Cldr.AR ->
            "អាហ្សង់ទីន"

        Cldr.AS ->
            "សាម័រ អាមេរិកាំង"

        Cldr.AT ->
            "អូទ្រីស"

        Cldr.AU ->
            "អូស្ត្រាលី"

        Cldr.AW ->
            "អារូបា"

        Cldr.AX ->
            "កោះ​អាឡង់"

        Cldr.AZ ->
            "អាស៊ែបៃហ្សង់"

        Cldr.BA ->
            "បូស្ន៊ី និងហឺហ្ស៊ីហ្គូវីណា"

        Cldr.BB ->
            "បាបាដុស"

        Cldr.BD ->
            "បង់ក្លាដែស"

        Cldr.BE ->
            "បែលហ្ស៊ិក"

        Cldr.BF ->
            "បួគីណាហ្វាសូ"

        Cldr.BG ->
            "ប៊ុលហ្ការី"

        Cldr.BH ->
            "បារ៉ែន"

        Cldr.BI ->
            "ប៊ូរុនឌី"

        Cldr.BJ ->
            "បេណាំង"

        Cldr.BL ->
            "សាំង​បាថេឡេមី"

        Cldr.BM ->
            "ប៊ឺមុយដា"

        Cldr.BN ->
            "ព្រុយណេ"

        Cldr.BO ->
            "បូលីវី"

        Cldr.BQ ->
            "ហូឡង់ ការ៉ាប៊ីន"

        Cldr.BR ->
            "ប្រេស៊ីល"

        Cldr.BS ->
            "បាហាម៉ា"

        Cldr.BT ->
            "ប៊ូតង់"

        Cldr.BV ->
            "កោះ​ប៊ូវ៉េត"

        Cldr.BW ->
            "បុតស្វាណា"

        Cldr.BY ->
            "បេឡារុស"

        Cldr.BZ ->
            "បេលី"

        Cldr.CA ->
            "កាណាដា"

        Cldr.CC ->
            "កោះ​កូកូស (គីលីង)"

        Cldr.CD ->
            "កុងហ្គោ (សាធារណរដ្ឋ​ប្រជាធិបតេយ្យ)"

        Cldr.CF ->
            "សាធារណរដ្ឋអាហ្វ្រិកកណ្ដាល"

        Cldr.CG ->
            "កុងហ្គោ (សធារណរដ្ឋ)"

        Cldr.CH ->
            "ស្វ៊ីស"

        Cldr.CI ->
            "កូតឌីវ័រ"

        Cldr.CK ->
            "កោះ​ខូក"

        Cldr.CL ->
            "ស៊ីលី"

        Cldr.CM ->
            "កាមេរូន"

        Cldr.CN ->
            "ចិន"

        Cldr.CO ->
            "កូឡុំប៊ី"

        Cldr.CR ->
            "កូស្តារីកា"

        Cldr.CU ->
            "គុយបា"

        Cldr.CV ->
            "កាប់វែរ"

        Cldr.CW ->
            "កូរ៉ាកៅ"

        Cldr.CX ->
            "កោះ​គ្រីស្មាស"

        Cldr.CY ->
            "ស៊ីប"

        Cldr.CZ ->
            "សាធារណរដ្ឋឆែក"

        Cldr.DE ->
            "អាល្លឺម៉ង់"

        Cldr.DJ ->
            "ជីប៊ូទី"

        Cldr.DK ->
            "ដាណឺម៉ាក"

        Cldr.DM ->
            "ដូមីនីក"

        Cldr.DO ->
            "សាធារណរដ្ឋ​ដូមីនីក"

        Cldr.DZ ->
            "អាល់ហ្សេរី"

        Cldr.EC ->
            "អេក្វាទ័រ"

        Cldr.EE ->
            "អេស្តូនី"

        Cldr.EG ->
            "អេហ្ស៊ីប"

        Cldr.EH ->
            "សាហារ៉ាខាងលិច"

        Cldr.ER ->
            "អេរីត្រេ"

        Cldr.ES ->
            "អេស្ប៉ាញ"

        Cldr.ET ->
            "អេត្យូពី"

        Cldr.FI ->
            "ហ្វាំងឡង់"

        Cldr.FJ ->
            "ហ្វីជី"

        Cldr.FK ->
            "កោះ​ហ្វក់ឡែន"

        Cldr.FM ->
            "មីក្រូណេស៊ី"

        Cldr.FO ->
            "កោះ​ហ្វារ៉ូ"

        Cldr.FR ->
            "បារាំង"

        Cldr.GA ->
            "ហ្គាបុង"

        Cldr.GB ->
            "ចក្រភព​អង់គ្លេស"

        Cldr.GD ->
            "ហ្គ្រើណាដ"

        Cldr.GE ->
            "ហ្សកហ្ស៊ី"

        Cldr.GF ->
            "ហ្គីអាណា បារាំង"

        Cldr.GG ->
            "ហ្គេនស៊ី"

        Cldr.GH ->
            "ហ្គាណា"

        Cldr.GI ->
            "ហ្ស៊ីប្រាល់តា"

        Cldr.GL ->
            "ហ្គ្រោអង់ឡង់"

        Cldr.GM ->
            "ហ្គំប៊ី"

        Cldr.GN ->
            "ហ្គីណេ"

        Cldr.GP ->
            "ហ្គោដឺឡុប"

        Cldr.GQ ->
            "ហ្គីណេអេក្វាទ័រ"

        Cldr.GR ->
            "ក្រិក"

        Cldr.GS ->
            "កោះ​ហ្សកហ្ស៊ី​ខាងត្បូង និង សង់វិច​ខាងត្បូង"

        Cldr.GT_ ->
            "ក្វាតេម៉ាឡា"

        Cldr.GU ->
            "ហ្គាំ"

        Cldr.GW ->
            "ហ្គីណេប៊ីស្សូ"

        Cldr.GY ->
            "ហ្គីយ៉ាន"

        Cldr.HK ->
            "ហុងកុង"

        Cldr.HM ->
            "កោះ​ហឺដនិង​ម៉ាក់ដូណាល់"

        Cldr.HN ->
            "ហុងឌូរ៉ាស"

        Cldr.HR ->
            "ក្រូអាស៊ី"

        Cldr.HT ->
            "ហៃទី"

        Cldr.HU ->
            "ហុងគ្រី"

        Cldr.ID ->
            "ឥណ្ឌូណេស៊ី"

        Cldr.IE ->
            "អៀរឡង់"

        Cldr.IL ->
            "អ៊ីស្រាអែល"

        Cldr.IM ->
            "អែលអុហ្វមែន"

        Cldr.IN ->
            "ឥណ្ឌា"

        Cldr.IO ->
            "ដែនដី​អង់គ្លេស​នៅ​មហា​សមុទ្រ​ឥណ្ឌា"

        Cldr.IQ ->
            "អ៊ីរ៉ាក់"

        Cldr.IR ->
            "អ៊ីរ៉ង់"

        Cldr.IS ->
            "អ៊ីស្លង់"

        Cldr.IT ->
            "អ៊ីតាលី"

        Cldr.JE ->
            "ជើស៊ី"

        Cldr.JM ->
            "ហ្សាម៉ាអ៊ីក"

        Cldr.JO ->
            "ហ៊្សកដានី"

        Cldr.JP ->
            "ជប៉ុន"

        Cldr.KE ->
            "កេនយ៉ា"

        Cldr.KG ->
            "កៀហ្ស៊ីស៊ីស្ថាន"

        Cldr.KH ->
            "កម្ពុជា"

        Cldr.KI ->
            "គិរីបាទី"

        Cldr.KM ->
            "កូម័រ"

        Cldr.KN ->
            "សាំង​គីត និង ណេវីស"

        Cldr.KP ->
            "កូរ៉េ​ខាង​ជើង"

        Cldr.KR ->
            "កូរ៉េ​ខាង​ត្បូង"

        Cldr.KW ->
            "កូវ៉ែត"

        Cldr.KY ->
            "កោះ​កៃម៉ង់"

        Cldr.KZ ->
            "កាហ្សាក់ស្ថាន"

        Cldr.LA ->
            "ឡាវ"

        Cldr.LB ->
            "លីបង់"

        Cldr.LC ->
            "សាំងលូស៊ី"

        Cldr.LI ->
            "លិចតិនស្ដាញ"

        Cldr.LK ->
            "ស្រីលង្កា"

        Cldr.LR ->
            "លីបេរីយ៉ា"

        Cldr.LS ->
            "ឡេសូតូ"

        Cldr.LT_ ->
            "លីទុយអានី"

        Cldr.LU ->
            "លុចសំបួ"

        Cldr.LV ->
            "ឡេតូនី"

        Cldr.LY ->
            "លីប៊ី"

        Cldr.MA ->
            "ម៉ារ៉ុក"

        Cldr.MC ->
            "ម៉ូណាកូ"

        Cldr.MD ->
            "ម៉ុលដាវី"

        Cldr.ME ->
            "ម៉ុងតេណេហ្គ្រោ"

        Cldr.MF ->
            "សាំង​ម៉ាទីន"

        Cldr.MG ->
            "ម៉ាដាហ្គាស្កា"

        Cldr.MH ->
            "កោះ​ម៉ាស់សល"

        Cldr.MK ->
            "ម៉ាសេដ្វានខាងជើង"

        Cldr.ML ->
            "ម៉ាលី"

        Cldr.MM ->
            "មីយ៉ាន់ម៉ា (ភូមា)"

        Cldr.MN ->
            "ម៉ុងហ្គោលី"

        Cldr.MO ->
            "ម៉ាកាវ"

        Cldr.MP ->
            "កោះ​ម៉ារីណា​ខាង​ជើង"

        Cldr.MQ ->
            "ម៉ាទីនីក"

        Cldr.MR ->
            "ម៉ូរីតានី"

        Cldr.MS ->
            "ម៉ុងស៊ែរ៉ា"

        Cldr.MT ->
            "ម៉ាល់ត៍"

        Cldr.MU ->
            "ម៉ូរីស"

        Cldr.MV ->
            "ម៉ាល់ឌីវ"

        Cldr.MW ->
            "ម៉ាឡាវី"

        Cldr.MX ->
            "ម៉ិកស៊ិក"

        Cldr.MY ->
            "ម៉ាឡេស៊ី"

        Cldr.MZ ->
            "ម៉ូសំប៊ិក"

        Cldr.NA ->
            "ណាមីប៊ី"

        Cldr.NC ->
            "នូវែល​កាឡេដូនី"

        Cldr.NE ->
            "នីហ្សេ"

        Cldr.NF ->
            "កោះ​ណ័រហ្វក់"

        Cldr.NG ->
            "នីហ្សេរីយ៉ា"

        Cldr.NI ->
            "នីការ៉ាហ្គា"

        Cldr.NL ->
            "ហូឡង់"

        Cldr.NO ->
            "ន័រវែស"

        Cldr.NP ->
            "នេប៉ាល់"

        Cldr.NR ->
            "ណូរូ"

        Cldr.NU ->
            "ណៀ"

        Cldr.NZ ->
            "នូវែល​សេឡង់"

        Cldr.OM ->
            "អូម៉ង់"

        Cldr.PA ->
            "ប៉ាណាម៉ា"

        Cldr.PE ->
            "ប៉េរូ"

        Cldr.PF ->
            "ប៉ូលី​ណេស៊ី​បារាំង"

        Cldr.PG ->
            "ប៉ាពូអាស៊ី​នូវែលហ្គីណេ"

        Cldr.PH ->
            "ហ្វ៊ីលីពីន"

        Cldr.PK ->
            "ប៉ាគីស្ថាន"

        Cldr.PL ->
            "ប៉ូឡូញ"

        Cldr.PM ->
            "សង់ព្យែរ និង​មីគីឡុង"

        Cldr.PN ->
            "កោះ​ភីតកាន"

        Cldr.PR ->
            "ព័រតូរីកូ"

        Cldr.PS ->
            "ប៉ាឡេស្ទីន"

        Cldr.PT ->
            "ព័រទុយហ្កាល់"

        Cldr.PW ->
            "ផៅឡូ"

        Cldr.PY ->
            "ប៉ារ៉ាហ្គាយ"

        Cldr.QA ->
            "កាតា"

        Cldr.RE ->
            "រេអុយញ៉ុង"

        Cldr.RO ->
            "រូម៉ានី"

        Cldr.RS ->
            "សែប៊ី"

        Cldr.RU ->
            "រុស្ស៊ី"

        Cldr.RW ->
            "រវ៉ាន់ដា"

        Cldr.SA ->
            "អារ៉ាប៊ីសាអូឌីត"

        Cldr.SB ->
            "កោះ​សូឡូម៉ុង"

        Cldr.SC ->
            "សីស្ហែល"

        Cldr.SD ->
            "ស៊ូដង់"

        Cldr.SE ->
            "ស៊ុយអែត"

        Cldr.SG ->
            "សិង្ហបុរី"

        Cldr.SH ->
            "សង់​ហេឡេណា"

        Cldr.SI ->
            "ស្លូវេនី"

        Cldr.SJ ->
            "ស្វាលបាដ និង ហ្សង់ម៉ាយេន"

        Cldr.SK ->
            "ស្លូវ៉ាគី"

        Cldr.SL ->
            "សៀរ៉ាឡេអូន"

        Cldr.SM ->
            "សាន​ម៉ារីណូ"

        Cldr.SN ->
            "សេណេហ្គាល់"

        Cldr.SO ->
            "សូម៉ាលី"

        Cldr.SR ->
            "សូរីណាម"

        Cldr.SS ->
            "ស៊ូដង់​ខាង​ត្បូង"

        Cldr.ST ->
            "សៅតូម៉េ និង ប្រាំងស៊ីប"

        Cldr.SV ->
            "អែលសាល់វ៉ាឌ័រ"

        Cldr.SX ->
            "សីង​ម៉ាធីន"

        Cldr.SY ->
            "ស៊ីរី"

        Cldr.SZ ->
            "ស្វាស៊ីឡង់"

        Cldr.TC ->
            "កោះ​ទួគ និង កៃកូស"

        Cldr.TD ->
            "ឆាដ"

        Cldr.TF ->
            "ដែនដី​បារាំង​នៅ​ភាគខាងត្បូង"

        Cldr.TG ->
            "តូហ្គោ"

        Cldr.TH ->
            "ថៃ"

        Cldr.TJ ->
            "តាហ្ស៊ីគីស្ថាន"

        Cldr.TK ->
            "តូខេឡៅ"

        Cldr.TL ->
            "ទីម័រ​ខាង​កើត"

        Cldr.TM ->
            "តួកម៉េនីស្ថាន"

        Cldr.TN ->
            "ទុយនីស៊ី"

        Cldr.TO ->
            "តុងហ្គា"

        Cldr.TR ->
            "តួកគី"

        Cldr.TT ->
            "ទ្រីនីដាត និង​តូបាហ្គោ"

        Cldr.TV ->
            "ទូវ៉ាលូ"

        Cldr.TW ->
            "តៃវ៉ាន់"

        Cldr.TZ ->
            "តង់សានី"

        Cldr.UA ->
            "អ៊ុយក្រែន"

        Cldr.UG ->
            "អ៊ូហ្គង់ដា"

        Cldr.UM ->
            "កោះ​អៅឡាយីង​អាមេរិក"

        Cldr.US ->
            "សហរដ្ឋអាមេរិក"

        Cldr.UY ->
            "អ៊ុយរូហ្គាយ"

        Cldr.UZ ->
            "អ៊ូសបេគីស្ថាន"

        Cldr.VA ->
            "បុរី​វ៉ាទីកង់"

        Cldr.VC ->
            "សាំង​វ៉ាំងសង់ និង ហ្គ្រេណាឌីន"

        Cldr.VE ->
            "វ៉េណេស៊ុយអេឡា"

        Cldr.VG ->
            "កោះ​វឺជិន​ចក្រភព​អង់គ្លេស"

        Cldr.VI ->
            "កោះ​វឺជីន​អាមេរិក"

        Cldr.VN ->
            "វៀតណាម"

        Cldr.VU ->
            "វ៉ានូទូ"

        Cldr.WF ->
            "វ៉ាលីស និង​ហ្វូទូណា"

        Cldr.WS ->
            "សាម័រ"

        Cldr.XK ->
            "កូសូវ៉ូ"

        Cldr.YE ->
            "យេម៉ែន"

        Cldr.YT ->
            "ម៉ាយុត"

        Cldr.ZA ->
            "អាហ្វ្រិកខាងត្បូង"

        Cldr.ZM ->
            "សំប៊ី"

        Cldr.ZW ->
            "ស៊ីមបាវ៉េ"