module Cldr.Konkani exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Konkani.

    AD अंडोरा
    AE युनाइटेड अरब इमीरॅट्स
    AF अफगानिस्तान
    AG एँटिगुआ आनी बारबुडा
    AI अंगुला
    AL अल्बानीया
    AM आर्मीनीया
    AO अंगोला
    AQ अंटार्क्टिका
    AR अर्जेंटिना
    AS अमेरिकी सामोआ
    AT ऑस्ट्रिया
    AU ऑस्ट्रेलीया
    AW अरुबा
    AX अलांड जुवे
    AZ अजरबैजान
    BA बोस्निया आनी हेर्जेगोविना
    BB बारबाडोस
    BD बांगलादेश
    BE बेल्जियम
    BF बुर्किना फॅसो
    BG बल्गेरीया
    BH बेहरेन
    BI बुरुंडी
    BJ बेनीन
    BL सॅंट बार्थेल्मी
    BM बर्मुडा
    BN ब्रूनेई
    BO बोलिव्हिया
    BQ कॅरिबियन निदरलँड
    BR ब्राझील
    BS बहामास
    BT भूतान
    BV बोवट आयलँड
    BW बोत्सवाना
    BY बेलारूस
    BZ बेलिझ
    CA कॅनडा
    CC कोकोस (कीलिंग) आयलँड
    CD कोंगो (डीआरसी)
    CF मध्य अफ्रीकी लोकसत्तकराज्य
    CG कोंगो (प्रजासत्ताक)
    CH स्विट्ज़रलैंड
    CI कोत द’ईवोआर
    CK कुक आयलँड्स
    CL चिली
    CM कॅमेरून
    CN चीन
    CO कोलंबिया
    CR कोस्ता रिका
    CU क्युबा
    CV केप वर्दी
    CW कुरसावो
    CX क्रिसमस आयलँड
    CY सायप्रस
    CZ चेक लोकसत्ताक
    DE जर्मनी
    DJ जिबूती
    DK डेनमार्क
    DM डोमिनीका
    DO डोमिनिकन प्रजासत्ताक
    DZ अल्जेरिया
    EC इक्वाडोर
    EE एस्टोनिया
    EG ईजिप्त
    EH अस्तंत सहारा
    ER इरिट्रिया
    ES स्पेन
    ET इथियोपिया
    FI फिनलँड
    FJ फिजी
    FK फ़ॉकलैंड आइलैंड्स
    FM मायक्रोनेशिया
    FO फैरो आयलँड्स
    FR फ्रान्स
    GA गॅबोन
    GB युनायटेड किंगडम
    GD ग्रेनॅडा
    GE जॉर्जिया
    GF फ्रेन्च गयाना
    GG गर्नसी
    GH घाना
    GI जिब्राल्टर
    GL ग्रीनलँड
    GM गॅम्बिया
    GN गुएनिया
    GP ग्वाडेलोप
    GQ इक्वेटोरियल गुएनिया
    GR ग्रीस
    GS दक्षिण जोर्जिया आनी दक्षिण सॅण्डविच आयलँड्स
    GT ग्वाटेमाला
    GU गुआम
    GW गुअनिया-बिसाउ
    GY गयाना
    HK हाँग काँग
    HM हर्ड ऍंड मॅक्डोनाल्ड आयलँड्स
    HN हॉनडुरस
    HR क्रोयेशीया
    HT हैती
    HU हंगेरी
    ID इंडोनेशीया
    IE आयरलँड
    IL इस्त्राइल
    IM इसले ऑफ मॅन
    IN भारत
    IO ब्रिटिश हिंद महासागरीय क्षेत्र
    IQ इराक
    IR इरान
    IS आइसलैंड
    IT इटली
    JE जर्सी
    JM जमैका
    JO जॉर्डन
    JP जपान
    KE केनया
    KG किर्गिझस्तान
    KH कंबोडिया
    KI किरिबाती
    KM कोमोरोस
    KN सेंट किट्स आनी नेविस
    KP उत्तर कोरिया
    KR दक्षिण कोरिया
    KW कुवेत
    KY कैमेन आइलैंड्स
    KZ कझाकस्तान
    LA लाओस
    LB लेबनान
    LC सँट लुसिया
    LI लिचेंस्टीन
    LK श्री लंका
    LR लायबेरीया
    LS लिसोथो
    LT लिथुआनिया
    LU लक्सेमबर्ग
    LV लॅटविया
    LY लीबिया
    MA मोरोक्को
    MC मोनॅको
    MD माल्डोवा
    ME मॉन्टॅनग्रो
    MF सॅंट मार्टिन
    MG माडागास्कर
    MH मार्शल आयलँड्स
    MK उत्तर मॅसिडोनिया
    ML माली
    MM म्यानमार (बर्मा)
    MN मंगोलिया
    MO मकाव
    MP उत्तरी मरिना आयसलैण्ड
    MQ मार्टीनिक
    MR मॉरिटानिया
    MS मॉन्टसेराट
    MT माल्टा
    MU मॉरिशस
    MV मालदीव
    MW मलावी
    MX मेक्सिको
    MY मलेशिया
    MZ मॉझांबीक
    NA नामीबिया
    NC न्यू कॅलिडोनिया
    NE नायजर
    NF नॉरफॉक आयलँड
    NG नायजेरिया
    NI निकारगुवा
    NL नॅदरलँड
    NO नॉर्वे
    NP नेपाळ
    NR नावरू
    NU नीयू
    NZ न्युझीलॅन्ड
    OM ओमान
    PA पनामा
    PE पेरू
    PF फ्रेन्च पोलिनेसिया
    PG पापुआ न्यु गिनी
    PH फिलीपिन्झ
    PK पाकिस्तान
    PL पोलंड
    PM सेंट पिएर आनी मिकेलन
    PN पिटकॅरन आयलँड्स
    PR प्युएर्तो रिको
    PS पेलेस्टायन
    PT पुर्तगाल
    PW पलाऊ
    PY पैराग्वे
    QA कतार
    RE रीयूनियन
    RO रोमानीया
    RS सर्बिया
    RU रूस
    RW रवांडा
    SA सऊदी अरेबिया
    SB सोलोमन आइलँड्स
    SC सेशेल्स
    SD सूडान
    SE स्वीडन
    SG सिंगापूर
    SH सेंट हेलिना
    SI स्लोवेनिया
    SJ स्वालबार्ड आनी जान मेयन
    SK स्लोवाकिया
    SL सिएरा लियॉन
    SM सॅन मारीनो
    SN सिनिगल
    SO सोमालिया
    SR सुरीनाम
    SS दक्षिण सुडान
    ST साओ टोम आनी प्रिन्सिप
    SV एल साल्वाडोर
    SX सिंट मार्टेन
    SY सिरिया
    SZ इस्वातिनी
    TC तुर्क्स आनी कॅकोज आयलँड्स
    TD चाड
    TF फ्रेंच दक्षिणी प्रांत
    TG टोगो
    TH थायलँड
    TJ तजीकिस्तान
    TK टोकलाऊ
    TL ईस्ट तिमूर
    TM तुर्कमेनिस्तान
    TN ट्यूनीशिया
    TO टोंगा
    TR तुर्की
    TT ट्रिनीदाद आनी टोबॅगो
    TV टुवालू
    TW तायवान
    TZ तांझानिया
    UA युक्रेन
    UG युगांडा
    UM यु. एस. मायनर आवटलायींग आयलँड्‍स
    US युनायटेड स्टेट्स
    UY उरूग्वे
    UZ उझ्बेकिस्तान
    VA वॅटिकन सिटी
    VC सेंट विंसेंट ऐंड द ग्रेनेडाइंस
    VE विनेझुएला
    VG ब्रिटिश वर्जिन आयलँड्स
    VI यु. एस. वर्जिन आयलँड्‍स
    VN व्हिएतनाम
    VU वनातू
    WF वालिस आनी फ्यूचूना
    WS सामोआ
    XK कोसोवो
    YE येमेन
    YT मेयोट
    ZA दक्षिण आफ्रीका
    ZM झांबिया
    ZW जिम्बाब्वे
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "अंडोरा"

        Cldr.AE ->
            "युनाइटेड अरब इमीरॅट्स"

        Cldr.AF ->
            "अफगानिस्तान"

        Cldr.AG ->
            "एँटिगुआ आनी बारबुडा"

        Cldr.AI ->
            "अंगुला"

        Cldr.AL ->
            "अल्बानीया"

        Cldr.AM ->
            "आर्मीनीया"

        Cldr.AO ->
            "अंगोला"

        Cldr.AQ ->
            "अंटार्क्टिका"

        Cldr.AR ->
            "अर्जेंटिना"

        Cldr.AS ->
            "अमेरिकी सामोआ"

        Cldr.AT ->
            "ऑस्ट्रिया"

        Cldr.AU ->
            "ऑस्ट्रेलीया"

        Cldr.AW ->
            "अरुबा"

        Cldr.AX ->
            "अलांड जुवे"

        Cldr.AZ ->
            "अजरबैजान"

        Cldr.BA ->
            "बोस्निया आनी हेर्जेगोविना"

        Cldr.BB ->
            "बारबाडोस"

        Cldr.BD ->
            "बांगलादेश"

        Cldr.BE ->
            "बेल्जियम"

        Cldr.BF ->
            "बुर्किना फॅसो"

        Cldr.BG ->
            "बल्गेरीया"

        Cldr.BH ->
            "बेहरेन"

        Cldr.BI ->
            "बुरुंडी"

        Cldr.BJ ->
            "बेनीन"

        Cldr.BL ->
            "सॅंट बार्थेल्मी"

        Cldr.BM ->
            "बर्मुडा"

        Cldr.BN ->
            "ब्रूनेई"

        Cldr.BO ->
            "बोलिव्हिया"

        Cldr.BQ ->
            "कॅरिबियन निदरलँड"

        Cldr.BR ->
            "ब्राझील"

        Cldr.BS ->
            "बहामास"

        Cldr.BT ->
            "भूतान"

        Cldr.BV ->
            "बोवट आयलँड"

        Cldr.BW ->
            "बोत्सवाना"

        Cldr.BY ->
            "बेलारूस"

        Cldr.BZ ->
            "बेलिझ"

        Cldr.CA ->
            "कॅनडा"

        Cldr.CC ->
            "कोकोस (कीलिंग) आयलँड"

        Cldr.CD ->
            "कोंगो (डीआरसी)"

        Cldr.CF ->
            "मध्य अफ्रीकी लोकसत्तकराज्य"

        Cldr.CG ->
            "कोंगो (प्रजासत्ताक)"

        Cldr.CH ->
            "स्विट्ज़रलैंड"

        Cldr.CI ->
            "कोत द’ईवोआर"

        Cldr.CK ->
            "कुक आयलँड्स"

        Cldr.CL ->
            "चिली"

        Cldr.CM ->
            "कॅमेरून"

        Cldr.CN ->
            "चीन"

        Cldr.CO ->
            "कोलंबिया"

        Cldr.CR ->
            "कोस्ता रिका"

        Cldr.CU ->
            "क्युबा"

        Cldr.CV ->
            "केप वर्दी"

        Cldr.CW ->
            "कुरसावो"

        Cldr.CX ->
            "क्रिसमस आयलँड"

        Cldr.CY ->
            "सायप्रस"

        Cldr.CZ ->
            "चेक लोकसत्ताक"

        Cldr.DE ->
            "जर्मनी"

        Cldr.DJ ->
            "जिबूती"

        Cldr.DK ->
            "डेनमार्क"

        Cldr.DM ->
            "डोमिनीका"

        Cldr.DO ->
            "डोमिनिकन प्रजासत्ताक"

        Cldr.DZ ->
            "अल्जेरिया"

        Cldr.EC ->
            "इक्वाडोर"

        Cldr.EE ->
            "एस्टोनिया"

        Cldr.EG ->
            "ईजिप्त"

        Cldr.EH ->
            "अस्तंत सहारा"

        Cldr.ER ->
            "इरिट्रिया"

        Cldr.ES ->
            "स्पेन"

        Cldr.ET ->
            "इथियोपिया"

        Cldr.FI ->
            "फिनलँड"

        Cldr.FJ ->
            "फिजी"

        Cldr.FK ->
            "फ़ॉकलैंड आइलैंड्स"

        Cldr.FM ->
            "मायक्रोनेशिया"

        Cldr.FO ->
            "फैरो आयलँड्स"

        Cldr.FR ->
            "फ्रान्स"

        Cldr.GA ->
            "गॅबोन"

        Cldr.GB ->
            "युनायटेड किंगडम"

        Cldr.GD ->
            "ग्रेनॅडा"

        Cldr.GE ->
            "जॉर्जिया"

        Cldr.GF ->
            "फ्रेन्च गयाना"

        Cldr.GG ->
            "गर्नसी"

        Cldr.GH ->
            "घाना"

        Cldr.GI ->
            "जिब्राल्टर"

        Cldr.GL ->
            "ग्रीनलँड"

        Cldr.GM ->
            "गॅम्बिया"

        Cldr.GN ->
            "गुएनिया"

        Cldr.GP ->
            "ग्वाडेलोप"

        Cldr.GQ ->
            "इक्वेटोरियल गुएनिया"

        Cldr.GR ->
            "ग्रीस"

        Cldr.GS ->
            "दक्षिण जोर्जिया आनी दक्षिण सॅण्डविच आयलँड्स"

        Cldr.GT_ ->
            "ग्वाटेमाला"

        Cldr.GU ->
            "गुआम"

        Cldr.GW ->
            "गुअनिया-बिसाउ"

        Cldr.GY ->
            "गयाना"

        Cldr.HK ->
            "हाँग काँग"

        Cldr.HM ->
            "हर्ड ऍंड मॅक्डोनाल्ड आयलँड्स"

        Cldr.HN ->
            "हॉनडुरस"

        Cldr.HR ->
            "क्रोयेशीया"

        Cldr.HT ->
            "हैती"

        Cldr.HU ->
            "हंगेरी"

        Cldr.ID ->
            "इंडोनेशीया"

        Cldr.IE ->
            "आयरलँड"

        Cldr.IL ->
            "इस्त्राइल"

        Cldr.IM ->
            "इसले ऑफ मॅन"

        Cldr.IN ->
            "भारत"

        Cldr.IO ->
            "ब्रिटिश हिंद महासागरीय क्षेत्र"

        Cldr.IQ ->
            "इराक"

        Cldr.IR ->
            "इरान"

        Cldr.IS ->
            "आइसलैंड"

        Cldr.IT ->
            "इटली"

        Cldr.JE ->
            "जर्सी"

        Cldr.JM ->
            "जमैका"

        Cldr.JO ->
            "जॉर्डन"

        Cldr.JP ->
            "जपान"

        Cldr.KE ->
            "केनया"

        Cldr.KG ->
            "किर्गिझस्तान"

        Cldr.KH ->
            "कंबोडिया"

        Cldr.KI ->
            "किरिबाती"

        Cldr.KM ->
            "कोमोरोस"

        Cldr.KN ->
            "सेंट किट्स आनी नेविस"

        Cldr.KP ->
            "उत्तर कोरिया"

        Cldr.KR ->
            "दक्षिण कोरिया"

        Cldr.KW ->
            "कुवेत"

        Cldr.KY ->
            "कैमेन आइलैंड्स"

        Cldr.KZ ->
            "कझाकस्तान"

        Cldr.LA ->
            "लाओस"

        Cldr.LB ->
            "लेबनान"

        Cldr.LC ->
            "सँट लुसिया"

        Cldr.LI ->
            "लिचेंस्टीन"

        Cldr.LK ->
            "श्री लंका"

        Cldr.LR ->
            "लायबेरीया"

        Cldr.LS ->
            "लिसोथो"

        Cldr.LT_ ->
            "लिथुआनिया"

        Cldr.LU ->
            "लक्सेमबर्ग"

        Cldr.LV ->
            "लॅटविया"

        Cldr.LY ->
            "लीबिया"

        Cldr.MA ->
            "मोरोक्को"

        Cldr.MC ->
            "मोनॅको"

        Cldr.MD ->
            "माल्डोवा"

        Cldr.ME ->
            "मॉन्टॅनग्रो"

        Cldr.MF ->
            "सॅंट मार्टिन"

        Cldr.MG ->
            "माडागास्कर"

        Cldr.MH ->
            "मार्शल आयलँड्स"

        Cldr.MK ->
            "उत्तर मॅसिडोनिया"

        Cldr.ML ->
            "माली"

        Cldr.MM ->
            "म्यानमार (बर्मा)"

        Cldr.MN ->
            "मंगोलिया"

        Cldr.MO ->
            "मकाव"

        Cldr.MP ->
            "उत्तरी मरिना आयसलैण्ड"

        Cldr.MQ ->
            "मार्टीनिक"

        Cldr.MR ->
            "मॉरिटानिया"

        Cldr.MS ->
            "मॉन्टसेराट"

        Cldr.MT ->
            "माल्टा"

        Cldr.MU ->
            "मॉरिशस"

        Cldr.MV ->
            "मालदीव"

        Cldr.MW ->
            "मलावी"

        Cldr.MX ->
            "मेक्सिको"

        Cldr.MY ->
            "मलेशिया"

        Cldr.MZ ->
            "मॉझांबीक"

        Cldr.NA ->
            "नामीबिया"

        Cldr.NC ->
            "न्यू कॅलिडोनिया"

        Cldr.NE ->
            "नायजर"

        Cldr.NF ->
            "नॉरफॉक आयलँड"

        Cldr.NG ->
            "नायजेरिया"

        Cldr.NI ->
            "निकारगुवा"

        Cldr.NL ->
            "नॅदरलँड"

        Cldr.NO ->
            "नॉर्वे"

        Cldr.NP ->
            "नेपाळ"

        Cldr.NR ->
            "नावरू"

        Cldr.NU ->
            "नीयू"

        Cldr.NZ ->
            "न्युझीलॅन्ड"

        Cldr.OM ->
            "ओमान"

        Cldr.PA ->
            "पनामा"

        Cldr.PE ->
            "पेरू"

        Cldr.PF ->
            "फ्रेन्च पोलिनेसिया"

        Cldr.PG ->
            "पापुआ न्यु गिनी"

        Cldr.PH ->
            "फिलीपिन्झ"

        Cldr.PK ->
            "पाकिस्तान"

        Cldr.PL ->
            "पोलंड"

        Cldr.PM ->
            "सेंट पिएर आनी मिकेलन"

        Cldr.PN ->
            "पिटकॅरन आयलँड्स"

        Cldr.PR ->
            "प्युएर्तो रिको"

        Cldr.PS ->
            "पेलेस्टायन"

        Cldr.PT ->
            "पुर्तगाल"

        Cldr.PW ->
            "पलाऊ"

        Cldr.PY ->
            "पैराग्वे"

        Cldr.QA ->
            "कतार"

        Cldr.RE ->
            "रीयूनियन"

        Cldr.RO ->
            "रोमानीया"

        Cldr.RS ->
            "सर्बिया"

        Cldr.RU ->
            "रूस"

        Cldr.RW ->
            "रवांडा"

        Cldr.SA ->
            "सऊदी अरेबिया"

        Cldr.SB ->
            "सोलोमन आइलँड्स"

        Cldr.SC ->
            "सेशेल्स"

        Cldr.SD ->
            "सूडान"

        Cldr.SE ->
            "स्वीडन"

        Cldr.SG ->
            "सिंगापूर"

        Cldr.SH ->
            "सेंट हेलिना"

        Cldr.SI ->
            "स्लोवेनिया"

        Cldr.SJ ->
            "स्वालबार्ड आनी जान मेयन"

        Cldr.SK ->
            "स्लोवाकिया"

        Cldr.SL ->
            "सिएरा लियॉन"

        Cldr.SM ->
            "सॅन मारीनो"

        Cldr.SN ->
            "सिनिगल"

        Cldr.SO ->
            "सोमालिया"

        Cldr.SR ->
            "सुरीनाम"

        Cldr.SS ->
            "दक्षिण सुडान"

        Cldr.ST ->
            "साओ टोम आनी प्रिन्सिप"

        Cldr.SV ->
            "एल साल्वाडोर"

        Cldr.SX ->
            "सिंट मार्टेन"

        Cldr.SY ->
            "सिरिया"

        Cldr.SZ ->
            "इस्वातिनी"

        Cldr.TC ->
            "तुर्क्स आनी कॅकोज आयलँड्स"

        Cldr.TD ->
            "चाड"

        Cldr.TF ->
            "फ्रेंच दक्षिणी प्रांत"

        Cldr.TG ->
            "टोगो"

        Cldr.TH ->
            "थायलँड"

        Cldr.TJ ->
            "तजीकिस्तान"

        Cldr.TK ->
            "टोकलाऊ"

        Cldr.TL ->
            "ईस्ट तिमूर"

        Cldr.TM ->
            "तुर्कमेनिस्तान"

        Cldr.TN ->
            "ट्यूनीशिया"

        Cldr.TO ->
            "टोंगा"

        Cldr.TR ->
            "तुर्की"

        Cldr.TT ->
            "ट्रिनीदाद आनी टोबॅगो"

        Cldr.TV ->
            "टुवालू"

        Cldr.TW ->
            "तायवान"

        Cldr.TZ ->
            "तांझानिया"

        Cldr.UA ->
            "युक्रेन"

        Cldr.UG ->
            "युगांडा"

        Cldr.UM ->
            "यु. एस. मायनर आवटलायींग आयलँड्‍स"

        Cldr.US ->
            "युनायटेड स्टेट्स"

        Cldr.UY ->
            "उरूग्वे"

        Cldr.UZ ->
            "उझ्बेकिस्तान"

        Cldr.VA ->
            "वॅटिकन सिटी"

        Cldr.VC ->
            "सेंट विंसेंट ऐंड द ग्रेनेडाइंस"

        Cldr.VE ->
            "विनेझुएला"

        Cldr.VG ->
            "ब्रिटिश वर्जिन आयलँड्स"

        Cldr.VI ->
            "यु. एस. वर्जिन आयलँड्‍स"

        Cldr.VN ->
            "व्हिएतनाम"

        Cldr.VU ->
            "वनातू"

        Cldr.WF ->
            "वालिस आनी फ्यूचूना"

        Cldr.WS ->
            "सामोआ"

        Cldr.XK ->
            "कोसोवो"

        Cldr.YE ->
            "येमेन"

        Cldr.YT ->
            "मेयोट"

        Cldr.ZA ->
            "दक्षिण आफ्रीका"

        Cldr.ZM ->
            "झांबिया"

        Cldr.ZW ->
            "जिम्बाब्वे"