module Cldr.Macedonian exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Macedonian.

    AD Андора
    AE Обединети Арапски Емирати
    AF Авганистан
    AG Антига и Барбуда
    AI Ангвила
    AL Албанија
    AM Ерменија
    AO Ангола
    AQ Антарктик
    AR Аргентина
    AS Американска Самоа
    AT Австрија
    AU Австралија
    AW Аруба
    AX Оландски Острови
    AZ Азербејџан
    BA Босна и Херцеговина
    BB Барбадос
    BD Бангладеш
    BE Белгија
    BF Буркина Фасо
    BG Бугарија
    BH Бахреин
    BI Бурунди
    BJ Бенин
    BL Свети Вартоломеј
    BM Бермуди
    BN Брунеј
    BO Боливија
    BQ Карипска Холандија
    BR Бразил
    BS Бахами
    BT Бутан
    BV Остров Буве
    BW Боцвана
    BY Белорусија
    BZ Белизе
    CA Канада
    CC Кокосови (Килиншки) Острови
    CD Конго - Киншаса
    CF Централноафриканска Република
    CG Конго - Бразавил
    CH Швајцарија
    CI Брегот на Слоновата Коска
    CK Кукови Острови
    CL Чиле
    CM Камерун
    CN Кина
    CO Колумбија
    CR Костарика
    CU Куба
    CV Кабо Верде
    CW Курасао
    CX Божиќен Остров
    CY Кипар
    CZ Чешка
    DE Германија
    DJ Џибути
    DK Данска
    DM Доминика
    DO Доминиканска Република
    DZ Алжир
    EC Еквадор
    EE Естонија
    EG Египет
    EH Западна Сахара
    ER Еритреја
    ES Шпанија
    ET Етиопија
    FI Финска
    FJ Фиџи
    FK Фолкландски Острови
    FM Микронезија
    FO Фарски Острови
    FR Франција
    GA Габон
    GB Обединето Кралство
    GD Гренада
    GE Грузија
    GF Француска Гвајана
    GG Гернзи
    GH Гана
    GI Гибралтар
    GL Гренланд
    GM Гамбија
    GN Гвинеја
    GP Гвадалупе
    GQ Екваторска Гвинеја
    GR Грција
    GS Јужна Џорџија и Јужни Сендвички Острови
    GT Гватемала
    GU Гуам
    GW Гвинеја Бисао
    GY Гвајана
    HK Хонгконг САР Кина
    HM Остров Херд и Острови Мекдоналд
    HN Хондурас
    HR Хрватска
    HT Хаити
    HU Унгарија
    ID Индонезија
    IE Ирска
    IL Израел
    IM Остров Ман
    IN Индија
    IO Британска Индоокеанска Територија
    IQ Ирак
    IR Иран
    IS Исланд
    IT Италија
    JE Џерси
    JM Јамајка
    JO Јордан
    JP Јапонија
    KE Кенија
    KG Киргистан
    KH Камбоџа
    KI Кирибати
    KM Коморски Острови
    KN Свети Китс и Невис
    KP Северна Кореја
    KR Јужна Кореја
    KW Кувајт
    KY Кајмански Острови
    KZ Казахстан
    LA Лаос
    LB Либан
    LC Сент Лусија
    LI Лихтенштајн
    LK Шри Ланка
    LR Либерија
    LS Лесото
    LT Литванија
    LU Луксембург
    LV Латвија
    LY Либија
    MA Мароко
    MC Монако
    MD Молдавија
    ME Црна Гора
    MF Сент Мартин
    MG Мадагаскар
    MH Маршалски Острови
    MK Северна Македонија
    ML Мали
    MM Мјанмар (Бурма)
    MN Монголија
    MO Макао САР
    MP Северни Маријански Острови
    MQ Мартиник
    MR Мавританија
    MS Монсерат
    MT Малта
    MU Маврициус
    MV Малдиви
    MW Малави
    MX Мексико
    MY Малезија
    MZ Мозамбик
    NA Намибија
    NC Нова Каледонија
    NE Нигер
    NF Норфолшки Остров
    NG Нигерија
    NI Никарагва
    NL Холандија
    NO Норвешка
    NP Непал
    NR Науру
    NU Ниује
    NZ Нов Зеланд
    OM Оман
    PA Панама
    PE Перу
    PF Француска Полинезија
    PG Папуа Нова Гвинеја
    PH Филипини
    PK Пакистан
    PL Полска
    PM Сент Пјер и Микелан
    PN Питкернски Острови
    PR Порторико
    PS Палестински Територии
    PT Португалија
    PW Палау
    PY Парагвај
    QA Катар
    RE Рејунион
    RO Романија
    RS Србија
    RU Русија
    RW Руанда
    SA Саудиска Арабија
    SB Соломонски Острови
    SC Сејшели
    SD Судан
    SE Шведска
    SG Сингапур
    SH Света Елена
    SI Словенија
    SJ Свалбард и Јан Мајен
    SK Словачка
    SL Сиера Леоне
    SM Сан Марино
    SN Сенегал
    SO Сомалија
    SR Суринам
    SS Јужен Судан
    ST Саун Томе и Принсип
    SV Ел Салвадор
    SX Свети Мартин
    SY Сирија
    SZ Свазиленд
    TC Острови Туркс и Каикос
    TD Чад
    TF Француски Јужни Територии
    TG Того
    TH Тајланд
    TJ Таџикистан
    TK Токелау
    TL Тимор Лесте
    TM Туркменистан
    TN Тунис
    TO Тонга
    TR Турција
    TT Тринидад и Тобаго
    TV Тувалу
    TW Тајван
    TZ Танзанија
    UA Украина
    UG Уганда
    UM Американски територии во Пацификот
    US Соединети Американски Држави
    UY Уругвај
    UZ Узбекистан
    VA Ватикан
    VC Сент Винсент и Гренадини
    VE Венецуела
    VG Британски Девствени Острови
    VI Американски Девствени Острови
    VN Виетнам
    VU Вануату
    WF Валис и Футуна
    WS Самоа
    XK Косово
    YE Јемен
    YT Мајот
    ZA Јужноафриканска Република
    ZM Замбија
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Андора"

        Cldr.AE ->
            "Обединети Арапски Емирати"

        Cldr.AF ->
            "Авганистан"

        Cldr.AG ->
            "Антига и Барбуда"

        Cldr.AI ->
            "Ангвила"

        Cldr.AL ->
            "Албанија"

        Cldr.AM ->
            "Ерменија"

        Cldr.AO ->
            "Ангола"

        Cldr.AQ ->
            "Антарктик"

        Cldr.AR ->
            "Аргентина"

        Cldr.AS ->
            "Американска Самоа"

        Cldr.AT ->
            "Австрија"

        Cldr.AU ->
            "Австралија"

        Cldr.AW ->
            "Аруба"

        Cldr.AX ->
            "Оландски Острови"

        Cldr.AZ ->
            "Азербејџан"

        Cldr.BA ->
            "Босна и Херцеговина"

        Cldr.BB ->
            "Барбадос"

        Cldr.BD ->
            "Бангладеш"

        Cldr.BE ->
            "Белгија"

        Cldr.BF ->
            "Буркина Фасо"

        Cldr.BG ->
            "Бугарија"

        Cldr.BH ->
            "Бахреин"

        Cldr.BI ->
            "Бурунди"

        Cldr.BJ ->
            "Бенин"

        Cldr.BL ->
            "Свети Вартоломеј"

        Cldr.BM ->
            "Бермуди"

        Cldr.BN ->
            "Брунеј"

        Cldr.BO ->
            "Боливија"

        Cldr.BQ ->
            "Карипска Холандија"

        Cldr.BR ->
            "Бразил"

        Cldr.BS ->
            "Бахами"

        Cldr.BT ->
            "Бутан"

        Cldr.BV ->
            "Остров Буве"

        Cldr.BW ->
            "Боцвана"

        Cldr.BY ->
            "Белорусија"

        Cldr.BZ ->
            "Белизе"

        Cldr.CA ->
            "Канада"

        Cldr.CC ->
            "Кокосови (Килиншки) Острови"

        Cldr.CD ->
            "Конго - Киншаса"

        Cldr.CF ->
            "Централноафриканска Република"

        Cldr.CG ->
            "Конго - Бразавил"

        Cldr.CH ->
            "Швајцарија"

        Cldr.CI ->
            "Брегот на Слоновата Коска"

        Cldr.CK ->
            "Кукови Острови"

        Cldr.CL ->
            "Чиле"

        Cldr.CM ->
            "Камерун"

        Cldr.CN ->
            "Кина"

        Cldr.CO ->
            "Колумбија"

        Cldr.CR ->
            "Костарика"

        Cldr.CU ->
            "Куба"

        Cldr.CV ->
            "Кабо Верде"

        Cldr.CW ->
            "Курасао"

        Cldr.CX ->
            "Божиќен Остров"

        Cldr.CY ->
            "Кипар"

        Cldr.CZ ->
            "Чешка"

        Cldr.DE ->
            "Германија"

        Cldr.DJ ->
            "Џибути"

        Cldr.DK ->
            "Данска"

        Cldr.DM ->
            "Доминика"

        Cldr.DO ->
            "Доминиканска Република"

        Cldr.DZ ->
            "Алжир"

        Cldr.EC ->
            "Еквадор"

        Cldr.EE ->
            "Естонија"

        Cldr.EG ->
            "Египет"

        Cldr.EH ->
            "Западна Сахара"

        Cldr.ER ->
            "Еритреја"

        Cldr.ES ->
            "Шпанија"

        Cldr.ET ->
            "Етиопија"

        Cldr.FI ->
            "Финска"

        Cldr.FJ ->
            "Фиџи"

        Cldr.FK ->
            "Фолкландски Острови"

        Cldr.FM ->
            "Микронезија"

        Cldr.FO ->
            "Фарски Острови"

        Cldr.FR ->
            "Франција"

        Cldr.GA ->
            "Габон"

        Cldr.GB ->
            "Обединето Кралство"

        Cldr.GD ->
            "Гренада"

        Cldr.GE ->
            "Грузија"

        Cldr.GF ->
            "Француска Гвајана"

        Cldr.GG ->
            "Гернзи"

        Cldr.GH ->
            "Гана"

        Cldr.GI ->
            "Гибралтар"

        Cldr.GL ->
            "Гренланд"

        Cldr.GM ->
            "Гамбија"

        Cldr.GN ->
            "Гвинеја"

        Cldr.GP ->
            "Гвадалупе"

        Cldr.GQ ->
            "Екваторска Гвинеја"

        Cldr.GR ->
            "Грција"

        Cldr.GS ->
            "Јужна Џорџија и Јужни Сендвички Острови"

        Cldr.GT_ ->
            "Гватемала"

        Cldr.GU ->
            "Гуам"

        Cldr.GW ->
            "Гвинеја Бисао"

        Cldr.GY ->
            "Гвајана"

        Cldr.HK ->
            "Хонгконг САР Кина"

        Cldr.HM ->
            "Остров Херд и Острови Мекдоналд"

        Cldr.HN ->
            "Хондурас"

        Cldr.HR ->
            "Хрватска"

        Cldr.HT ->
            "Хаити"

        Cldr.HU ->
            "Унгарија"

        Cldr.ID ->
            "Индонезија"

        Cldr.IE ->
            "Ирска"

        Cldr.IL ->
            "Израел"

        Cldr.IM ->
            "Остров Ман"

        Cldr.IN ->
            "Индија"

        Cldr.IO ->
            "Британска Индоокеанска Територија"

        Cldr.IQ ->
            "Ирак"

        Cldr.IR ->
            "Иран"

        Cldr.IS ->
            "Исланд"

        Cldr.IT ->
            "Италија"

        Cldr.JE ->
            "Џерси"

        Cldr.JM ->
            "Јамајка"

        Cldr.JO ->
            "Јордан"

        Cldr.JP ->
            "Јапонија"

        Cldr.KE ->
            "Кенија"

        Cldr.KG ->
            "Киргистан"

        Cldr.KH ->
            "Камбоџа"

        Cldr.KI ->
            "Кирибати"

        Cldr.KM ->
            "Коморски Острови"

        Cldr.KN ->
            "Свети Китс и Невис"

        Cldr.KP ->
            "Северна Кореја"

        Cldr.KR ->
            "Јужна Кореја"

        Cldr.KW ->
            "Кувајт"

        Cldr.KY ->
            "Кајмански Острови"

        Cldr.KZ ->
            "Казахстан"

        Cldr.LA ->
            "Лаос"

        Cldr.LB ->
            "Либан"

        Cldr.LC ->
            "Сент Лусија"

        Cldr.LI ->
            "Лихтенштајн"

        Cldr.LK ->
            "Шри Ланка"

        Cldr.LR ->
            "Либерија"

        Cldr.LS ->
            "Лесото"

        Cldr.LT_ ->
            "Литванија"

        Cldr.LU ->
            "Луксембург"

        Cldr.LV ->
            "Латвија"

        Cldr.LY ->
            "Либија"

        Cldr.MA ->
            "Мароко"

        Cldr.MC ->
            "Монако"

        Cldr.MD ->
            "Молдавија"

        Cldr.ME ->
            "Црна Гора"

        Cldr.MF ->
            "Сент Мартин"

        Cldr.MG ->
            "Мадагаскар"

        Cldr.MH ->
            "Маршалски Острови"

        Cldr.MK ->
            "Северна Македонија"

        Cldr.ML ->
            "Мали"

        Cldr.MM ->
            "Мјанмар (Бурма)"

        Cldr.MN ->
            "Монголија"

        Cldr.MO ->
            "Макао САР"

        Cldr.MP ->
            "Северни Маријански Острови"

        Cldr.MQ ->
            "Мартиник"

        Cldr.MR ->
            "Мавританија"

        Cldr.MS ->
            "Монсерат"

        Cldr.MT ->
            "Малта"

        Cldr.MU ->
            "Маврициус"

        Cldr.MV ->
            "Малдиви"

        Cldr.MW ->
            "Малави"

        Cldr.MX ->
            "Мексико"

        Cldr.MY ->
            "Малезија"

        Cldr.MZ ->
            "Мозамбик"

        Cldr.NA ->
            "Намибија"

        Cldr.NC ->
            "Нова Каледонија"

        Cldr.NE ->
            "Нигер"

        Cldr.NF ->
            "Норфолшки Остров"

        Cldr.NG ->
            "Нигерија"

        Cldr.NI ->
            "Никарагва"

        Cldr.NL ->
            "Холандија"

        Cldr.NO ->
            "Норвешка"

        Cldr.NP ->
            "Непал"

        Cldr.NR ->
            "Науру"

        Cldr.NU ->
            "Ниује"

        Cldr.NZ ->
            "Нов Зеланд"

        Cldr.OM ->
            "Оман"

        Cldr.PA ->
            "Панама"

        Cldr.PE ->
            "Перу"

        Cldr.PF ->
            "Француска Полинезија"

        Cldr.PG ->
            "Папуа Нова Гвинеја"

        Cldr.PH ->
            "Филипини"

        Cldr.PK ->
            "Пакистан"

        Cldr.PL ->
            "Полска"

        Cldr.PM ->
            "Сент Пјер и Микелан"

        Cldr.PN ->
            "Питкернски Острови"

        Cldr.PR ->
            "Порторико"

        Cldr.PS ->
            "Палестински Територии"

        Cldr.PT ->
            "Португалија"

        Cldr.PW ->
            "Палау"

        Cldr.PY ->
            "Парагвај"

        Cldr.QA ->
            "Катар"

        Cldr.RE ->
            "Рејунион"

        Cldr.RO ->
            "Романија"

        Cldr.RS ->
            "Србија"

        Cldr.RU ->
            "Русија"

        Cldr.RW ->
            "Руанда"

        Cldr.SA ->
            "Саудиска Арабија"

        Cldr.SB ->
            "Соломонски Острови"

        Cldr.SC ->
            "Сејшели"

        Cldr.SD ->
            "Судан"

        Cldr.SE ->
            "Шведска"

        Cldr.SG ->
            "Сингапур"

        Cldr.SH ->
            "Света Елена"

        Cldr.SI ->
            "Словенија"

        Cldr.SJ ->
            "Свалбард и Јан Мајен"

        Cldr.SK ->
            "Словачка"

        Cldr.SL ->
            "Сиера Леоне"

        Cldr.SM ->
            "Сан Марино"

        Cldr.SN ->
            "Сенегал"

        Cldr.SO ->
            "Сомалија"

        Cldr.SR ->
            "Суринам"

        Cldr.SS ->
            "Јужен Судан"

        Cldr.ST ->
            "Саун Томе и Принсип"

        Cldr.SV ->
            "Ел Салвадор"

        Cldr.SX ->
            "Свети Мартин"

        Cldr.SY ->
            "Сирија"

        Cldr.SZ ->
            "Свазиленд"

        Cldr.TC ->
            "Острови Туркс и Каикос"

        Cldr.TD ->
            "Чад"

        Cldr.TF ->
            "Француски Јужни Територии"

        Cldr.TG ->
            "Того"

        Cldr.TH ->
            "Тајланд"

        Cldr.TJ ->
            "Таџикистан"

        Cldr.TK ->
            "Токелау"

        Cldr.TL ->
            "Тимор Лесте"

        Cldr.TM ->
            "Туркменистан"

        Cldr.TN ->
            "Тунис"

        Cldr.TO ->
            "Тонга"

        Cldr.TR ->
            "Турција"

        Cldr.TT ->
            "Тринидад и Тобаго"

        Cldr.TV ->
            "Тувалу"

        Cldr.TW ->
            "Тајван"

        Cldr.TZ ->
            "Танзанија"

        Cldr.UA ->
            "Украина"

        Cldr.UG ->
            "Уганда"

        Cldr.UM ->
            "Американски територии во Пацификот"

        Cldr.US ->
            "Соединети Американски Држави"

        Cldr.UY ->
            "Уругвај"

        Cldr.UZ ->
            "Узбекистан"

        Cldr.VA ->
            "Ватикан"

        Cldr.VC ->
            "Сент Винсент и Гренадини"

        Cldr.VE ->
            "Венецуела"

        Cldr.VG ->
            "Британски Девствени Острови"

        Cldr.VI ->
            "Американски Девствени Острови"

        Cldr.VN ->
            "Виетнам"

        Cldr.VU ->
            "Вануату"

        Cldr.WF ->
            "Валис и Футуна"

        Cldr.WS ->
            "Самоа"

        Cldr.XK ->
            "Косово"

        Cldr.YE ->
            "Јемен"

        Cldr.YT ->
            "Мајот"

        Cldr.ZA ->
            "Јужноафриканска Република"

        Cldr.ZM ->
            "Замбија"

        Cldr.ZW ->
            "Зимбабве"