module Cldr.Mongolian exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Mongolian.

    AD Андорра
    AE Арабын Нэгдсэн Эмирт Улс
    AF Афганистан
    AG Антигуа ба Барбуда
    AI Ангилья
    AL Албани
    AM Армени
    AO Ангол
    AQ Антарктид
    AR Аргентин
    AS Америкийн Самоа
    AT Австри
    AU Австрали
    AW Аруба
    AX Аландын арлууд
    AZ Азербайжан
    BA Босни-Герцеговин
    BB Барбадос
    BD Бангладеш
    BE Бельги
    BF Буркина Фасо
    BG Болгар
    BH Бахрейн
    BI Бурунди
    BJ Бенин
    BL Сент-Бартельми
    BM Бермуда
    BN Бруней
    BO Боливи
    BQ Карибын Нидерланд
    BR Бразил
    BS Багамын арлууд
    BT Бутан
    BV Буве арал
    BW Ботсван
    BY Беларусь
    BZ Белизе
    CA Канад
    CC Кокос (Кийлинг) арлууд
    CD Бүгд Найрамдах Ардчилсан Конго Улс
    CF Төв Африкийн Бүгд Найрамдах Улс
    CG Конго (Бүгд Найрамдах улс)
    CH Швейцарь
    CI Кот-д’Ивуар
    CK Күүкийн арлууд
    CL Чили
    CM Камерун
    CN Хятад
    CO Колумби
    CR Коста-Рика
    CU Куба
    CV Кабо-Верде
    CW Кюрасао
    CX Зул сарын арал
    CY Кипр
    CZ Бүгд Найрамдах Чех Улс
    DE Герман
    DJ Джибути
    DK Дани
    DM Доминика
    DO Бүгд Найрамдах Доминикан Улс
    DZ Алжир
    EC Эквадор
    EE Эстони
    EG Египет
    EH Баруун Сахар
    ER Эритрей
    ES Испани
    ET Этиоп
    FI Финлянд
    FJ Фижи
    FK Фолклендийн арлууд
    FM Микронези
    FO Фарерын арлууд
    FR Франц
    GA Габон
    GB Их Британи
    GD Гренада
    GE Гүрж
    GF Францын Гвиана
    GG Гернси
    GH Гана
    GI Гибралтар
    GL Гренланд
    GM Гамби
    GN Гвиней
    GP Гваделуп
    GQ Экваторын Гвиней
    GR Грек
    GS Өмнөд Жоржиа ба Өмнөд Сэндвичийн арлууд
    GT Гватемал
    GU Гуам
    GW Гвиней-Бисау
    GY Гайана
    HK Хонг Конг
    HM Херд ба Макдональдийн арлууд
    HN Гондурас
    HR Хорват
    HT Гаити
    HU Унгар
    ID Индонез
    IE Ирланд
    IL Израиль
    IM Мэн Арал
    IN Энэтхэг
    IO Британийн харьяа Энэтхэгийн далай дахь нутаг дэвсгэр
    IQ Ирак
    IR Иран
    IS Исланд
    IT Итали
    JE Жерси
    JM Ямайка
    JO Йордан
    JP Япон
    KE Кени
    KG Кыргызстан
    KH Камбож
    KI Кирибати
    KM Коморын арлууд
    KN Сент-Киттс ба Невис
    KP Хойд Солонгос
    KR Өмнөд Солонгос
    KW Кувейт
    KY Кайманы арлууд
    KZ Казахстан
    LA Лаос
    LB Ливан
    LC Сент Люсиа
    LI Лихтенштейн
    LK Шри-Ланка
    LR Либери
    LS Лесото
    LT Литва
    LU Люксембург
    LV Латви
    LY Ливи
    MA Морокко
    MC Монако
    MD Молдова
    ME Монтенегро
    MF Сент-Мартин
    MG Мадагаскар
    MH Маршаллын арлууд
    MK Хойд Македон
    ML Мали
    MM Мьянмар
    MN Монгол
    MO Макао
    MP Хойд Марианы арлууд
    MQ Мартиник
    MR Мавритани
    MS Монтсеррат
    MT Мальта
    MU Маврикий
    MV Мальдив
    MW Малави
    MX Мексик
    MY Малайз
    MZ Мозамбик
    NA Намиби
    NC Шинэ Каледони
    NE Нигер
    NF Норфолк арал
    NG Нигери
    NI Никарагуа
    NL Нидерланд
    NO Норвеги
    NP Балба
    NR Науру
    NU Ниуэ
    NZ Шинэ Зеланд
    OM Оман
    PA Панам
    PE Перу
    PF Францын Полинез
    PG Папуа Шинэ Гвиней
    PH Филиппин
    PK Пакистан
    PL Польш
    PM Сент-Пьер ба Микело
    PN Питкэрн арлууд
    PR Пуэрто-Рико
    PS Палестин
    PT Португал
    PW Палау
    PY Парагвай
    QA Катар
    RE Реюнион
    RO Румын
    RS Серби
    RU Орос
    RW Руанда
    SA Саудын Араб
    SB Соломоны арлууд
    SC Сейшелийн арлууд
    SD Судан
    SE Швед
    SG Сингапур
    SH Сент Хелена
    SI Словени
    SJ Свалбард ба Ян Майен
    SK Словак
    SL Сьерра-Леоне
    SM Сан-Марино
    SN Сенегал
    SO Сомали
    SR Суринам
    SS Өмнөд Судан
    ST Сан-Томе ба Принсипи
    SV Эль Сальвадор
    SX Синт Мартен
    SY Сири
    SZ Эсватини
    TC Турк ба Кайкосын Арлууд
    TD Чад
    TF Францын өмнөд газар нутаг
    TG Того
    TH Тайланд
    TJ Тажикистан
    TK Токелау
    TL Зүүн Тимор
    TM Туркменистан
    TN Тунис
    TO Тонга
    TR Турк
    TT Тринидад ба Тобаго
    TV Тувалу
    TW Тайвань
    TZ Танзани
    UA Украин
    UG Уганда
    UM Америкийн Нэгдсэн Улсын бага арлууд
    US Америкийн Нэгдсэн Улс
    UY Уругвай
    UZ Узбекистан
    VA Ватикан хот улс
    VC Сент-Винсент ба Гренадин
    VE Венесуэл
    VG Британийн Виржиний арлууд
    VI АНУ-ын Виржиний арлууд
    VN Вьетнам
    VU Вануату
    WF Уоллис ба Футуна
    WS Самоа
    XK Косово
    YE Йемен
    YT Майотта
    ZA Өмнөд Африк
    ZM Замби
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Андорра"

        Cldr.AE ->
            "Арабын Нэгдсэн Эмирт Улс"

        Cldr.AF ->
            "Афганистан"

        Cldr.AG ->
            "Антигуа ба Барбуда"

        Cldr.AI ->
            "Ангилья"

        Cldr.AL ->
            "Албани"

        Cldr.AM ->
            "Армени"

        Cldr.AO ->
            "Ангол"

        Cldr.AQ ->
            "Антарктид"

        Cldr.AR ->
            "Аргентин"

        Cldr.AS ->
            "Америкийн Самоа"

        Cldr.AT ->
            "Австри"

        Cldr.AU ->
            "Австрали"

        Cldr.AW ->
            "Аруба"

        Cldr.AX ->
            "Аландын арлууд"

        Cldr.AZ ->
            "Азербайжан"

        Cldr.BA ->
            "Босни-Герцеговин"

        Cldr.BB ->
            "Барбадос"

        Cldr.BD ->
            "Бангладеш"

        Cldr.BE ->
            "Бельги"

        Cldr.BF ->
            "Буркина Фасо"

        Cldr.BG ->
            "Болгар"

        Cldr.BH ->
            "Бахрейн"

        Cldr.BI ->
            "Бурунди"

        Cldr.BJ ->
            "Бенин"

        Cldr.BL ->
            "Сент-Бартельми"

        Cldr.BM ->
            "Бермуда"

        Cldr.BN ->
            "Бруней"

        Cldr.BO ->
            "Боливи"

        Cldr.BQ ->
            "Карибын Нидерланд"

        Cldr.BR ->
            "Бразил"

        Cldr.BS ->
            "Багамын арлууд"

        Cldr.BT ->
            "Бутан"

        Cldr.BV ->
            "Буве арал"

        Cldr.BW ->
            "Ботсван"

        Cldr.BY ->
            "Беларусь"

        Cldr.BZ ->
            "Белизе"

        Cldr.CA ->
            "Канад"

        Cldr.CC ->
            "Кокос (Кийлинг) арлууд"

        Cldr.CD ->
            "Бүгд Найрамдах Ардчилсан Конго Улс"

        Cldr.CF ->
            "Төв Африкийн Бүгд Найрамдах Улс"

        Cldr.CG ->
            "Конго (Бүгд Найрамдах улс)"

        Cldr.CH ->
            "Швейцарь"

        Cldr.CI ->
            "Кот-д’Ивуар"

        Cldr.CK ->
            "Күүкийн арлууд"

        Cldr.CL ->
            "Чили"

        Cldr.CM ->
            "Камерун"

        Cldr.CN ->
            "Хятад"

        Cldr.CO ->
            "Колумби"

        Cldr.CR ->
            "Коста-Рика"

        Cldr.CU ->
            "Куба"

        Cldr.CV ->
            "Кабо-Верде"

        Cldr.CW ->
            "Кюрасао"

        Cldr.CX ->
            "Зул сарын арал"

        Cldr.CY ->
            "Кипр"

        Cldr.CZ ->
            "Бүгд Найрамдах Чех Улс"

        Cldr.DE ->
            "Герман"

        Cldr.DJ ->
            "Джибути"

        Cldr.DK ->
            "Дани"

        Cldr.DM ->
            "Доминика"

        Cldr.DO ->
            "Бүгд Найрамдах Доминикан Улс"

        Cldr.DZ ->
            "Алжир"

        Cldr.EC ->
            "Эквадор"

        Cldr.EE ->
            "Эстони"

        Cldr.EG ->
            "Египет"

        Cldr.EH ->
            "Баруун Сахар"

        Cldr.ER ->
            "Эритрей"

        Cldr.ES ->
            "Испани"

        Cldr.ET ->
            "Этиоп"

        Cldr.FI ->
            "Финлянд"

        Cldr.FJ ->
            "Фижи"

        Cldr.FK ->
            "Фолклендийн арлууд"

        Cldr.FM ->
            "Микронези"

        Cldr.FO ->
            "Фарерын арлууд"

        Cldr.FR ->
            "Франц"

        Cldr.GA ->
            "Габон"

        Cldr.GB ->
            "Их Британи"

        Cldr.GD ->
            "Гренада"

        Cldr.GE ->
            "Гүрж"

        Cldr.GF ->
            "Францын Гвиана"

        Cldr.GG ->
            "Гернси"

        Cldr.GH ->
            "Гана"

        Cldr.GI ->
            "Гибралтар"

        Cldr.GL ->
            "Гренланд"

        Cldr.GM ->
            "Гамби"

        Cldr.GN ->
            "Гвиней"

        Cldr.GP ->
            "Гваделуп"

        Cldr.GQ ->
            "Экваторын Гвиней"

        Cldr.GR ->
            "Грек"

        Cldr.GS ->
            "Өмнөд Жоржиа ба Өмнөд Сэндвичийн арлууд"

        Cldr.GT_ ->
            "Гватемал"

        Cldr.GU ->
            "Гуам"

        Cldr.GW ->
            "Гвиней-Бисау"

        Cldr.GY ->
            "Гайана"

        Cldr.HK ->
            "Хонг Конг"

        Cldr.HM ->
            "Херд ба Макдональдийн арлууд"

        Cldr.HN ->
            "Гондурас"

        Cldr.HR ->
            "Хорват"

        Cldr.HT ->
            "Гаити"

        Cldr.HU ->
            "Унгар"

        Cldr.ID ->
            "Индонез"

        Cldr.IE ->
            "Ирланд"

        Cldr.IL ->
            "Израиль"

        Cldr.IM ->
            "Мэн Арал"

        Cldr.IN ->
            "Энэтхэг"

        Cldr.IO ->
            "Британийн харьяа Энэтхэгийн далай дахь нутаг дэвсгэр"

        Cldr.IQ ->
            "Ирак"

        Cldr.IR ->
            "Иран"

        Cldr.IS ->
            "Исланд"

        Cldr.IT ->
            "Итали"

        Cldr.JE ->
            "Жерси"

        Cldr.JM ->
            "Ямайка"

        Cldr.JO ->
            "Йордан"

        Cldr.JP ->
            "Япон"

        Cldr.KE ->
            "Кени"

        Cldr.KG ->
            "Кыргызстан"

        Cldr.KH ->
            "Камбож"

        Cldr.KI ->
            "Кирибати"

        Cldr.KM ->
            "Коморын арлууд"

        Cldr.KN ->
            "Сент-Киттс ба Невис"

        Cldr.KP ->
            "Хойд Солонгос"

        Cldr.KR ->
            "Өмнөд Солонгос"

        Cldr.KW ->
            "Кувейт"

        Cldr.KY ->
            "Кайманы арлууд"

        Cldr.KZ ->
            "Казахстан"

        Cldr.LA ->
            "Лаос"

        Cldr.LB ->
            "Ливан"

        Cldr.LC ->
            "Сент Люсиа"

        Cldr.LI ->
            "Лихтенштейн"

        Cldr.LK ->
            "Шри-Ланка"

        Cldr.LR ->
            "Либери"

        Cldr.LS ->
            "Лесото"

        Cldr.LT_ ->
            "Литва"

        Cldr.LU ->
            "Люксембург"

        Cldr.LV ->
            "Латви"

        Cldr.LY ->
            "Ливи"

        Cldr.MA ->
            "Морокко"

        Cldr.MC ->
            "Монако"

        Cldr.MD ->
            "Молдова"

        Cldr.ME ->
            "Монтенегро"

        Cldr.MF ->
            "Сент-Мартин"

        Cldr.MG ->
            "Мадагаскар"

        Cldr.MH ->
            "Маршаллын арлууд"

        Cldr.MK ->
            "Хойд Македон"

        Cldr.ML ->
            "Мали"

        Cldr.MM ->
            "Мьянмар"

        Cldr.MN ->
            "Монгол"

        Cldr.MO ->
            "Макао"

        Cldr.MP ->
            "Хойд Марианы арлууд"

        Cldr.MQ ->
            "Мартиник"

        Cldr.MR ->
            "Мавритани"

        Cldr.MS ->
            "Монтсеррат"

        Cldr.MT ->
            "Мальта"

        Cldr.MU ->
            "Маврикий"

        Cldr.MV ->
            "Мальдив"

        Cldr.MW ->
            "Малави"

        Cldr.MX ->
            "Мексик"

        Cldr.MY ->
            "Малайз"

        Cldr.MZ ->
            "Мозамбик"

        Cldr.NA ->
            "Намиби"

        Cldr.NC ->
            "Шинэ Каледони"

        Cldr.NE ->
            "Нигер"

        Cldr.NF ->
            "Норфолк арал"

        Cldr.NG ->
            "Нигери"

        Cldr.NI ->
            "Никарагуа"

        Cldr.NL ->
            "Нидерланд"

        Cldr.NO ->
            "Норвеги"

        Cldr.NP ->
            "Балба"

        Cldr.NR ->
            "Науру"

        Cldr.NU ->
            "Ниуэ"

        Cldr.NZ ->
            "Шинэ Зеланд"

        Cldr.OM ->
            "Оман"

        Cldr.PA ->
            "Панам"

        Cldr.PE ->
            "Перу"

        Cldr.PF ->
            "Францын Полинез"

        Cldr.PG ->
            "Папуа Шинэ Гвиней"

        Cldr.PH ->
            "Филиппин"

        Cldr.PK ->
            "Пакистан"

        Cldr.PL ->
            "Польш"

        Cldr.PM ->
            "Сент-Пьер ба Микело"

        Cldr.PN ->
            "Питкэрн арлууд"

        Cldr.PR ->
            "Пуэрто-Рико"

        Cldr.PS ->
            "Палестин"

        Cldr.PT ->
            "Португал"

        Cldr.PW ->
            "Палау"

        Cldr.PY ->
            "Парагвай"

        Cldr.QA ->
            "Катар"

        Cldr.RE ->
            "Реюнион"

        Cldr.RO ->
            "Румын"

        Cldr.RS ->
            "Серби"

        Cldr.RU ->
            "Орос"

        Cldr.RW ->
            "Руанда"

        Cldr.SA ->
            "Саудын Араб"

        Cldr.SB ->
            "Соломоны арлууд"

        Cldr.SC ->
            "Сейшелийн арлууд"

        Cldr.SD ->
            "Судан"

        Cldr.SE ->
            "Швед"

        Cldr.SG ->
            "Сингапур"

        Cldr.SH ->
            "Сент Хелена"

        Cldr.SI ->
            "Словени"

        Cldr.SJ ->
            "Свалбард ба Ян Майен"

        Cldr.SK ->
            "Словак"

        Cldr.SL ->
            "Сьерра-Леоне"

        Cldr.SM ->
            "Сан-Марино"

        Cldr.SN ->
            "Сенегал"

        Cldr.SO ->
            "Сомали"

        Cldr.SR ->
            "Суринам"

        Cldr.SS ->
            "Өмнөд Судан"

        Cldr.ST ->
            "Сан-Томе ба Принсипи"

        Cldr.SV ->
            "Эль Сальвадор"

        Cldr.SX ->
            "Синт Мартен"

        Cldr.SY ->
            "Сири"

        Cldr.SZ ->
            "Эсватини"

        Cldr.TC ->
            "Турк ба Кайкосын Арлууд"

        Cldr.TD ->
            "Чад"

        Cldr.TF ->
            "Францын өмнөд газар нутаг"

        Cldr.TG ->
            "Того"

        Cldr.TH ->
            "Тайланд"

        Cldr.TJ ->
            "Тажикистан"

        Cldr.TK ->
            "Токелау"

        Cldr.TL ->
            "Зүүн Тимор"

        Cldr.TM ->
            "Туркменистан"

        Cldr.TN ->
            "Тунис"

        Cldr.TO ->
            "Тонга"

        Cldr.TR ->
            "Турк"

        Cldr.TT ->
            "Тринидад ба Тобаго"

        Cldr.TV ->
            "Тувалу"

        Cldr.TW ->
            "Тайвань"

        Cldr.TZ ->
            "Танзани"

        Cldr.UA ->
            "Украин"

        Cldr.UG ->
            "Уганда"

        Cldr.UM ->
            "Америкийн Нэгдсэн Улсын бага арлууд"

        Cldr.US ->
            "Америкийн Нэгдсэн Улс"

        Cldr.UY ->
            "Уругвай"

        Cldr.UZ ->
            "Узбекистан"

        Cldr.VA ->
            "Ватикан хот улс"

        Cldr.VC ->
            "Сент-Винсент ба Гренадин"

        Cldr.VE ->
            "Венесуэл"

        Cldr.VG ->
            "Британийн Виржиний арлууд"

        Cldr.VI ->
            "АНУ-ын Виржиний арлууд"

        Cldr.VN ->
            "Вьетнам"

        Cldr.VU ->
            "Вануату"

        Cldr.WF ->
            "Уоллис ба Футуна"

        Cldr.WS ->
            "Самоа"

        Cldr.XK ->
            "Косово"

        Cldr.YE ->
            "Йемен"

        Cldr.YT ->
            "Майотта"

        Cldr.ZA ->
            "Өмнөд Африк"

        Cldr.ZM ->
            "Замби"

        Cldr.ZW ->
            "Зимбабве"