module Cldr.Odia exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Odia.

    AD ଆଣ୍ଡୋରା
    AE ସଂଯୁକ୍ତ ଆରବ ଏମିରେଟସ୍
    AF ଆଫଗାନିସ୍ତାନ୍
    AG ଆଣ୍ଟିଗୁଆ ଏବଂ ବାରବୁଦା
    AI ଆଙ୍ଗୁଇଲ୍ଲା
    AL ଆଲବାନିଆ
    AM ଆର୍ମେନିଆ
    AO ଆଙ୍ଗୋଲା
    AQ ଆଣ୍ଟାର୍କାଟିକା
    AR ଆର୍ଜେଣ୍ଟିନା
    AS ଆମେରିକାନ୍ ସାମୋଆ
    AT ଅଷ୍ଟ୍ରିଆ
    AU ଅଷ୍ଟ୍ରେଲିଆ
    AW ଆରୁବା
    AX ଅଲାଣ୍ଡ ଦ୍ଵୀପପୁଞ୍ଜ
    AZ ଆଜେରବାଇଜାନ୍
    BA ବୋସନିଆ ଏବଂ ହର୍ଜଗୋଭିନା
    BB ବାରବାଡୋସ୍
    BD ବାଂଲାଦେଶ
    BE ବେଲଜିୟମ୍
    BF ବୁର୍କିନା ଫାସୋ
    BG ବୁଲଗେରିଆ
    BH ବାହାରିନ୍
    BI ବୁରୁଣ୍ଡି
    BJ ବେନିନ୍
    BL ସେଣ୍ଟ ବାର୍ଥେଲେମି
    BM ବର୍ମୁଡା
    BN ବ୍ରୁନେଇ
    BO ବୋଲଭିଆ
    BQ କାରବିୟନ୍‌ ନେଦରଲ୍ୟାଣ୍ଡ
    BR ବ୍ରାଜିଲ୍
    BS ବାହାମାସ୍
    BT ଭୁଟାନ
    BV ବୌଭେଟ୍‌ ଦ୍ୱୀପ
    BW ବୋଟସ୍ୱାନା
    BY ବେଲାରୁଷ୍
    BZ ବେଲିଜ୍
    CA କାନାଡା
    CC କୋକୋସ୍ (କୀଲିଂ) ଦ୍ଵୀପପୁଞ୍ଜ
    CD କଙ୍ଗୋ (ଡିଆରସି)
    CF ମଧ୍ୟ ଆଫ୍ରିକୀୟ ସାଧାରଣତନ୍ତ୍ର
    CG କଙ୍ଗୋ-ବ୍ରାଜିଭିଲ୍ଲେ
    CH ସ୍ୱିଜରଲ୍ୟାଣ୍ଡ
    CI କୋତ୍ ଡି ଭ୍ଵାର୍
    CK କୁକ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ
    CL ଚିଲ୍ଲୀ
    CM କାମେରୁନ୍
    CN ଚିନ୍
    CO କୋଲମ୍ବିଆ
    CR କୋଷ୍ଟା ରିକା
    CU କ୍ୱିବା
    CV କେପ୍ ଭର୍ଦେ
    CW କୁରାକାଓ
    CX ଖ୍ରୀଷ୍ଟମାସ ଦ୍ୱୀପ
    CY ସାଇପ୍ରସ୍
    CZ ଚେଚିଆ
    DE ଜର୍ମାନୀ
    DJ ଜିବୋଟି
    DK ଡେନମାର୍କ
    DM ଡୋମିନିକା
    DO ଡୋମିନିକାନ୍‌ ସାଧାରଣତନ୍ତ୍ର
    DZ ଆଲଜେରିଆ
    EC ଇକ୍ୱାଡୋର୍
    EE ଏସ୍ତୋନିଆ
    EG ଇଜିପ୍ଟ
    EH ପଶ୍ଚିମ ସାହାରା
    ER ଇରିଟ୍ରିୟା
    ES ସ୍ପେନ୍
    ET ଇଥିଓପିଆ
    FI ଫିନଲ୍ୟାଣ୍ଡ
    FJ ଫିଜି
    FK ଫକ୍‌ଲ୍ୟାଣ୍ଡ ଦ୍ଵୀପପୁଞ୍ଜ
    FM ମାଇକ୍ରୋନେସିଆ
    FO ଫାରୋଇ ଦ୍ୱୀପପୁଞ୍ଜ
    FR ଫ୍ରାନ୍ସ
    GA ଗାବୋନ୍
    GB ଯୁକ୍ତରାଜ୍ୟ
    GD ଗ୍ରେନାଡା
    GE ଜର୍ଜିଆ
    GF ଫ୍ରେଞ୍ଚ ଗୁଇନା
    GG ଗୁଏରନେସି
    GH ଘାନା
    GI ଜିବ୍ରାଲ୍ଟର୍
    GL ଗ୍ରୀନଲ୍ୟାଣ୍ଡ
    GM ଗାମ୍ବିଆ
    GN ଗୁଇନିଆ
    GP ଗୁଆଡେଲୋପ୍
    GQ ଇକ୍ବାଟେରିଆଲ୍ ଗୁଇନିଆ
    GR ଗ୍ରୀସ୍
    GS ଦକ୍ଷିଣ ଜର୍ଜିଆ ଏବଂ ଦକ୍ଷିଣ ସାଣ୍ଡୱିଚ୍ ଦ୍ୱୀପପୁଞ୍ଜ
    GT ଗୁଏତମାଲା
    GU ଗୁଆମ୍
    GW ଗୁଇନିଆ-ବିସାଉ
    GY ଗୁଇନା
    HK ହଂ କଂ ଏସଏଆର୍‌ ଚାଇନା
    HM ହାର୍ଡ୍‌ ଏବଂ ମ୍ୟାକଡୋନାଲ୍ଡ ଦ୍ୱୀପପୁଞ୍ଜ
    HN ହୋଣ୍ଡୁରାସ୍‌
    HR କ୍ରୋଏସିଆ
    HT ହାଇତି
    HU ହଙ୍ଗେରୀ
    ID ଇଣ୍ଡୋନେସିଆ
    IE ଆୟରଲ୍ୟାଣ୍ଡ
    IL ଇସ୍ରାଏଲ୍
    IM ଆଇଲ୍‌ ଅଫ୍‌ ମ୍ୟାନ୍‌
    IN ଭାରତ
    IO ବ୍ରିଟିଶ୍‌ ଭାରତ ମାହାସାଗର କ୍ଷେତ୍ର
    IQ ଇରାକ୍
    IR ଇରାନ
    IS ଆଇସଲ୍ୟାଣ୍ଡ
    IT ଇଟାଲୀ
    JE ଜର୍ସି
    JM ଜାମାଇକା
    JO ଜୋର୍ଡାନ୍
    JP ଜାପାନ
    KE କେନିୟା
    KG କିର୍ଗିଜିସ୍ତାନ
    KH କାମ୍ବୋଡିଆ
    KI କିରିବାଟି
    KM କୋମୋରସ୍
    KN ସେଣ୍ଟ କିଟସ୍‌ ଏବଂ ନେଭିସ୍‌
    KP ଉତ୍ତର କୋରିଆ
    KR ଦକ୍ଷିଣ କୋରିଆ
    KW କୁଏତ୍
    KY କେମ୍ୟାନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ
    KZ କାଜାକାସ୍ତାନ
    LA ଲାଓସ୍
    LB ଲେବାନନ୍
    LC ସେଣ୍ଟ ଲୁସିଆ
    LI ଲିଚେଟନଷ୍ଟେଇନ୍
    LK ଶ୍ରୀଲଙ୍କା
    LR ଲାଇବେରିଆ
    LS ଲେସୋଥୋ
    LT ଲିଥୁଆନିଆ
    LU ଲକ୍ସେମବର୍ଗ
    LV ଲାଟଭିଆ
    LY ଲିବ୍ୟା
    MA ମୋରୋକ୍କୋ
    MC ମୋନାକୋ
    MD ମୋଲଡୋଭା
    ME ମଣ୍ଟେନିଗ୍ରୋ
    MF ସେଣ୍ଟ ମାର୍ଟିନ୍
    MG ମାଡାଗାସ୍କର୍
    MH ମାର୍ଶାଲ୍ ଦ୍ୱୀପପୁଞ୍ଜ
    MK ଉତ୍ତର ମାସେଡୋନିଆ
    ML ମାଲି
    MM ମିଆଁମାର
    MN ମଙ୍ଗୋଲିଆ
    MO ମାକାଉ ଏସଏଆର୍‌ ଚାଇନା
    MP ଉତ୍ତର ମାରିଆନା ଦ୍ୱୀପପୁଞ୍ଜ
    MQ ମାର୍ଟିନିକ୍ୟୁ
    MR ମୌରିଟାନିଆ
    MS ମଣ୍ଟେସେରାଟ୍
    MT ମାଲ୍ଟା
    MU ମରିସସ
    MV ମାଲଦିଭସ୍‌
    MW ମାଲୱି
    MX ମେକ୍ସିକୋ
    MY ମାଲେସିଆ
    MZ ମୋଜାମ୍ବିକ୍‌
    NA ନାମିବିଆ
    NC ନୂତନ କାଲେଡୋନିଆ
    NE ନାଇଜର
    NF ନର୍ଫକ୍ ଦ୍ଵୀପ
    NG ନାଇଜେରିଆ
    NI ନିକାରାଗୁଆ
    NL ନେଦରଲ୍ୟାଣ୍ଡ
    NO ନରୱେ
    NP ନେପାଳ
    NR ନାଉରୁ
    NU ନିଉ
    NZ ନ୍ୟୁଜିଲାଣ୍ଡ
    OM ଓମାନ୍
    PA ପାନାମା
    PE ପେରୁ
    PF ଫ୍ରେଞ୍ଚ ପଲିନେସିଆ
    PG ପପୁଆ ନ୍ୟୁ ଗୁଏନିଆ
    PH ଫିଲିପାଇନସ୍
    PK ପାକିସ୍ତାନ
    PL ପୋଲାଣ୍ଡ
    PM ସେଣ୍ଟ ପିଏରେ ଏବଂ ମିକ୍ୱେଲନ୍‌
    PN ପିଟକାଇରିନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ
    PR ପୁଏର୍ତ୍ତୋ ରିକୋ
    PS ପାଲେଷ୍ଟେନିୟ ଭୂଭାଗ
    PT ପର୍ତ୍ତୁଗାଲ୍
    PW ପାଲାଉ
    PY ପାରାଗୁଏ
    QA କତାର୍
    RE ରିୟୁନିଅନ୍
    RO ରୋମାନିଆ
    RS ସର୍ବିଆ
    RU ରୁଷିଆ
    RW ରାୱାଣ୍ଡା
    SA ସାଉଦି ଆରବିଆ
    SB ସୋଲୋମନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ
    SC ସେଚେଲସ୍
    SD ସୁଦାନ
    SE ସ୍ୱେଡେନ୍
    SG ସିଙ୍ଗାପୁର୍
    SH ସେଣ୍ଟ ହେଲେନା
    SI ସ୍ଲୋଭେନିଆ
    SJ ସାଲବାର୍ଡ ଏବଂ ଜାନ୍‌ ମାୟେନ୍‌
    SK ସ୍ଲୋଭାକିଆ
    SL ସିଏରା ଲିଓନ
    SM ସାନ୍ ମାରିନୋ
    SN ସେନେଗାଲ୍
    SO ସୋମାଲିଆ
    SR ସୁରିନାମ
    SS ଦକ୍ଷିଣ ସୁଦାନ
    ST ସାଓ ଟୋମେ ଏବଂ ପ୍ରିନସିପି
    SV ଏଲ୍ ସାଲଭାଡୋର୍
    SX ସିଣ୍ଟ ମାର୍ଟୀନ୍‌
    SY ସିରିଆ
    SZ ଇସ୍ୱାତିନୀ
    TC ତୁର୍କସ୍‌ ଏବଂ କାଇକୋସ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ
    TD ଚାଦ୍
    TF ଫରାସୀ ଦକ୍ଷିଣ କ୍ଷେତ୍ର
    TG ଟୋଗୋ
    TH ଥାଇଲ୍ୟାଣ୍ଡ
    TJ ତାଜିକିସ୍ଥାନ୍
    TK ଟୋକେଲାଉ
    TL ତିମୋର୍-ଲେଷ୍ଟେ
    TM ତୁର୍କମେନିସ୍ତାନ
    TN ଟ୍ୟୁନିସିଆ
    TO ଟୋଙ୍ଗା
    TR ତୁର୍କୀ
    TT ତ୍ରିନିଦାଦ୍ ଏବଂ ଟୋବାଗୋ
    TV ତୁଭାଲୁ
    TW ତାଇୱାନ
    TZ ତାଞ୍ଜାନିଆ
    UA ୟୁକ୍ରେନ୍
    UG ଉଗାଣ୍ଡା
    UM ଯୁକ୍ତରାଷ୍ଟ୍ର ଆଉଟ୍‌ଲାଇଙ୍ଗ ଦ୍ଵୀପପୁଞ୍ଜ
    US ଯୁକ୍ତ ରାଷ୍ଟ୍ର
    UY ଉରୁଗୁଏ
    UZ ଉଜବେକିସ୍ତାନ
    VA ଭାଟିକାନ୍ ସିଟି
    VC ସେଣ୍ଟ ଭିନସେଣ୍ଟ ଏବଂ ଦି ଗ୍ରେନାଡିସ୍
    VE ଭେନେଜୁଏଲା
    VG ବ୍ରିଟିଶ୍‌ ଭର୍ଜିନ୍ ଦ୍ୱୀପପୁଞ୍ଜ
    VI ଯୁକ୍ତରାଷ୍ଟ୍ର ଭିର୍ଜିନ୍ ଦ୍ଵୀପପୁଞ୍ଜ
    VN ଭିଏତନାମ୍
    VU ଭାନୁଆତୁ
    WF ୱାଲିସ୍ ଏବଂ ଫୁତୁନା
    WS ସାମୋଆ
    XK କୋସୋଭୋ
    YE ୟେମେନ୍
    YT ମାୟୋଟେ
    ZA ଦକ୍ଷିଣ ଆଫ୍ରିକା
    ZM ଜାମ୍ବିଆ
    ZW ଜିମ୍ବାୱେ
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "ଆଣ୍ଡୋରା"

        Cldr.AE ->
            "ସଂଯୁକ୍ତ ଆରବ ଏମିରେଟସ୍"

        Cldr.AF ->
            "ଆଫଗାନିସ୍ତାନ୍"

        Cldr.AG ->
            "ଆଣ୍ଟିଗୁଆ ଏବଂ ବାରବୁଦା"

        Cldr.AI ->
            "ଆଙ୍ଗୁଇଲ୍ଲା"

        Cldr.AL ->
            "ଆଲବାନିଆ"

        Cldr.AM ->
            "ଆର୍ମେନିଆ"

        Cldr.AO ->
            "ଆଙ୍ଗୋଲା"

        Cldr.AQ ->
            "ଆଣ୍ଟାର୍କାଟିକା"

        Cldr.AR ->
            "ଆର୍ଜେଣ୍ଟିନା"

        Cldr.AS ->
            "ଆମେରିକାନ୍ ସାମୋଆ"

        Cldr.AT ->
            "ଅଷ୍ଟ୍ରିଆ"

        Cldr.AU ->
            "ଅଷ୍ଟ୍ରେଲିଆ"

        Cldr.AW ->
            "ଆରୁବା"

        Cldr.AX ->
            "ଅଲାଣ୍ଡ ଦ୍ଵୀପପୁଞ୍ଜ"

        Cldr.AZ ->
            "ଆଜେରବାଇଜାନ୍"

        Cldr.BA ->
            "ବୋସନିଆ ଏବଂ ହର୍ଜଗୋଭିନା"

        Cldr.BB ->
            "ବାରବାଡୋସ୍"

        Cldr.BD ->
            "ବାଂଲାଦେଶ"

        Cldr.BE ->
            "ବେଲଜିୟମ୍"

        Cldr.BF ->
            "ବୁର୍କିନା ଫାସୋ"

        Cldr.BG ->
            "ବୁଲଗେରିଆ"

        Cldr.BH ->
            "ବାହାରିନ୍"

        Cldr.BI ->
            "ବୁରୁଣ୍ଡି"

        Cldr.BJ ->
            "ବେନିନ୍"

        Cldr.BL ->
            "ସେଣ୍ଟ ବାର୍ଥେଲେମି"

        Cldr.BM ->
            "ବର୍ମୁଡା"

        Cldr.BN ->
            "ବ୍ରୁନେଇ"

        Cldr.BO ->
            "ବୋଲଭିଆ"

        Cldr.BQ ->
            "କାରବିୟନ୍‌ ନେଦରଲ୍ୟାଣ୍ଡ"

        Cldr.BR ->
            "ବ୍ରାଜିଲ୍"

        Cldr.BS ->
            "ବାହାମାସ୍"

        Cldr.BT ->
            "ଭୁଟାନ"

        Cldr.BV ->
            "ବୌଭେଟ୍‌ ଦ୍ୱୀପ"

        Cldr.BW ->
            "ବୋଟସ୍ୱାନା"

        Cldr.BY ->
            "ବେଲାରୁଷ୍"

        Cldr.BZ ->
            "ବେଲିଜ୍"

        Cldr.CA ->
            "କାନାଡା"

        Cldr.CC ->
            "କୋକୋସ୍ (କୀଲିଂ) ଦ୍ଵୀପପୁଞ୍ଜ"

        Cldr.CD ->
            "କଙ୍ଗୋ (ଡିଆରସି)"

        Cldr.CF ->
            "ମଧ୍ୟ ଆଫ୍ରିକୀୟ ସାଧାରଣତନ୍ତ୍ର"

        Cldr.CG ->
            "କଙ୍ଗୋ-ବ୍ରାଜିଭିଲ୍ଲେ"

        Cldr.CH ->
            "ସ୍ୱିଜରଲ୍ୟାଣ୍ଡ"

        Cldr.CI ->
            "କୋତ୍ ଡି ଭ୍ଵାର୍"

        Cldr.CK ->
            "କୁକ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.CL ->
            "ଚିଲ୍ଲୀ"

        Cldr.CM ->
            "କାମେରୁନ୍"

        Cldr.CN ->
            "ଚିନ୍"

        Cldr.CO ->
            "କୋଲମ୍ବିଆ"

        Cldr.CR ->
            "କୋଷ୍ଟା ରିକା"

        Cldr.CU ->
            "କ୍ୱିବା"

        Cldr.CV ->
            "କେପ୍ ଭର୍ଦେ"

        Cldr.CW ->
            "କୁରାକାଓ"

        Cldr.CX ->
            "ଖ୍ରୀଷ୍ଟମାସ ଦ୍ୱୀପ"

        Cldr.CY ->
            "ସାଇପ୍ରସ୍"

        Cldr.CZ ->
            "ଚେଚିଆ"

        Cldr.DE ->
            "ଜର୍ମାନୀ"

        Cldr.DJ ->
            "ଜିବୋଟି"

        Cldr.DK ->
            "ଡେନମାର୍କ"

        Cldr.DM ->
            "ଡୋମିନିକା"

        Cldr.DO ->
            "ଡୋମିନିକାନ୍‌ ସାଧାରଣତନ୍ତ୍ର"

        Cldr.DZ ->
            "ଆଲଜେରିଆ"

        Cldr.EC ->
            "ଇକ୍ୱାଡୋର୍"

        Cldr.EE ->
            "ଏସ୍ତୋନିଆ"

        Cldr.EG ->
            "ଇଜିପ୍ଟ"

        Cldr.EH ->
            "ପଶ୍ଚିମ ସାହାରା"

        Cldr.ER ->
            "ଇରିଟ୍ରିୟା"

        Cldr.ES ->
            "ସ୍ପେନ୍"

        Cldr.ET ->
            "ଇଥିଓପିଆ"

        Cldr.FI ->
            "ଫିନଲ୍ୟାଣ୍ଡ"

        Cldr.FJ ->
            "ଫିଜି"

        Cldr.FK ->
            "ଫକ୍‌ଲ୍ୟାଣ୍ଡ ଦ୍ଵୀପପୁଞ୍ଜ"

        Cldr.FM ->
            "ମାଇକ୍ରୋନେସିଆ"

        Cldr.FO ->
            "ଫାରୋଇ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.FR ->
            "ଫ୍ରାନ୍ସ"

        Cldr.GA ->
            "ଗାବୋନ୍"

        Cldr.GB ->
            "ଯୁକ୍ତରାଜ୍ୟ"

        Cldr.GD ->
            "ଗ୍ରେନାଡା"

        Cldr.GE ->
            "ଜର୍ଜିଆ"

        Cldr.GF ->
            "ଫ୍ରେଞ୍ଚ ଗୁଇନା"

        Cldr.GG ->
            "ଗୁଏରନେସି"

        Cldr.GH ->
            "ଘାନା"

        Cldr.GI ->
            "ଜିବ୍ରାଲ୍ଟର୍"

        Cldr.GL ->
            "ଗ୍ରୀନଲ୍ୟାଣ୍ଡ"

        Cldr.GM ->
            "ଗାମ୍ବିଆ"

        Cldr.GN ->
            "ଗୁଇନିଆ"

        Cldr.GP ->
            "ଗୁଆଡେଲୋପ୍"

        Cldr.GQ ->
            "ଇକ୍ବାଟେରିଆଲ୍ ଗୁଇନିଆ"

        Cldr.GR ->
            "ଗ୍ରୀସ୍"

        Cldr.GS ->
            "ଦକ୍ଷିଣ ଜର୍ଜିଆ ଏବଂ ଦକ୍ଷିଣ ସାଣ୍ଡୱିଚ୍ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.GT_ ->
            "ଗୁଏତମାଲା"

        Cldr.GU ->
            "ଗୁଆମ୍"

        Cldr.GW ->
            "ଗୁଇନିଆ-ବିସାଉ"

        Cldr.GY ->
            "ଗୁଇନା"

        Cldr.HK ->
            "ହଂ କଂ ଏସଏଆର୍‌ ଚାଇନା"

        Cldr.HM ->
            "ହାର୍ଡ୍‌ ଏବଂ ମ୍ୟାକଡୋନାଲ୍ଡ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.HN ->
            "ହୋଣ୍ଡୁରାସ୍‌"

        Cldr.HR ->
            "କ୍ରୋଏସିଆ"

        Cldr.HT ->
            "ହାଇତି"

        Cldr.HU ->
            "ହଙ୍ଗେରୀ"

        Cldr.ID ->
            "ଇଣ୍ଡୋନେସିଆ"

        Cldr.IE ->
            "ଆୟରଲ୍ୟାଣ୍ଡ"

        Cldr.IL ->
            "ଇସ୍ରାଏଲ୍"

        Cldr.IM ->
            "ଆଇଲ୍‌ ଅଫ୍‌ ମ୍ୟାନ୍‌"

        Cldr.IN ->
            "ଭାରତ"

        Cldr.IO ->
            "ବ୍ରିଟିଶ୍‌ ଭାରତ ମାହାସାଗର କ୍ଷେତ୍ର"

        Cldr.IQ ->
            "ଇରାକ୍"

        Cldr.IR ->
            "ଇରାନ"

        Cldr.IS ->
            "ଆଇସଲ୍ୟାଣ୍ଡ"

        Cldr.IT ->
            "ଇଟାଲୀ"

        Cldr.JE ->
            "ଜର୍ସି"

        Cldr.JM ->
            "ଜାମାଇକା"

        Cldr.JO ->
            "ଜୋର୍ଡାନ୍"

        Cldr.JP ->
            "ଜାପାନ"

        Cldr.KE ->
            "କେନିୟା"

        Cldr.KG ->
            "କିର୍ଗିଜିସ୍ତାନ"

        Cldr.KH ->
            "କାମ୍ବୋଡିଆ"

        Cldr.KI ->
            "କିରିବାଟି"

        Cldr.KM ->
            "କୋମୋରସ୍"

        Cldr.KN ->
            "ସେଣ୍ଟ କିଟସ୍‌ ଏବଂ ନେଭିସ୍‌"

        Cldr.KP ->
            "ଉତ୍ତର କୋରିଆ"

        Cldr.KR ->
            "ଦକ୍ଷିଣ କୋରିଆ"

        Cldr.KW ->
            "କୁଏତ୍"

        Cldr.KY ->
            "କେମ୍ୟାନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.KZ ->
            "କାଜାକାସ୍ତାନ"

        Cldr.LA ->
            "ଲାଓସ୍"

        Cldr.LB ->
            "ଲେବାନନ୍"

        Cldr.LC ->
            "ସେଣ୍ଟ ଲୁସିଆ"

        Cldr.LI ->
            "ଲିଚେଟନଷ୍ଟେଇନ୍"

        Cldr.LK ->
            "ଶ୍ରୀଲଙ୍କା"

        Cldr.LR ->
            "ଲାଇବେରିଆ"

        Cldr.LS ->
            "ଲେସୋଥୋ"

        Cldr.LT_ ->
            "ଲିଥୁଆନିଆ"

        Cldr.LU ->
            "ଲକ୍ସେମବର୍ଗ"

        Cldr.LV ->
            "ଲାଟଭିଆ"

        Cldr.LY ->
            "ଲିବ୍ୟା"

        Cldr.MA ->
            "ମୋରୋକ୍କୋ"

        Cldr.MC ->
            "ମୋନାକୋ"

        Cldr.MD ->
            "ମୋଲଡୋଭା"

        Cldr.ME ->
            "ମଣ୍ଟେନିଗ୍ରୋ"

        Cldr.MF ->
            "ସେଣ୍ଟ ମାର୍ଟିନ୍"

        Cldr.MG ->
            "ମାଡାଗାସ୍କର୍"

        Cldr.MH ->
            "ମାର୍ଶାଲ୍ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.MK ->
            "ଉତ୍ତର ମାସେଡୋନିଆ"

        Cldr.ML ->
            "ମାଲି"

        Cldr.MM ->
            "ମିଆଁମାର"

        Cldr.MN ->
            "ମଙ୍ଗୋଲିଆ"

        Cldr.MO ->
            "ମାକାଉ ଏସଏଆର୍‌ ଚାଇନା"

        Cldr.MP ->
            "ଉତ୍ତର ମାରିଆନା ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.MQ ->
            "ମାର୍ଟିନିକ୍ୟୁ"

        Cldr.MR ->
            "ମୌରିଟାନିଆ"

        Cldr.MS ->
            "ମଣ୍ଟେସେରାଟ୍"

        Cldr.MT ->
            "ମାଲ୍ଟା"

        Cldr.MU ->
            "ମରିସସ"

        Cldr.MV ->
            "ମାଲଦିଭସ୍‌"

        Cldr.MW ->
            "ମାଲୱି"

        Cldr.MX ->
            "ମେକ୍ସିକୋ"

        Cldr.MY ->
            "ମାଲେସିଆ"

        Cldr.MZ ->
            "ମୋଜାମ୍ବିକ୍‌"

        Cldr.NA ->
            "ନାମିବିଆ"

        Cldr.NC ->
            "ନୂତନ କାଲେଡୋନିଆ"

        Cldr.NE ->
            "ନାଇଜର"

        Cldr.NF ->
            "ନର୍ଫକ୍ ଦ୍ଵୀପ"

        Cldr.NG ->
            "ନାଇଜେରିଆ"

        Cldr.NI ->
            "ନିକାରାଗୁଆ"

        Cldr.NL ->
            "ନେଦରଲ୍ୟାଣ୍ଡ"

        Cldr.NO ->
            "ନରୱେ"

        Cldr.NP ->
            "ନେପାଳ"

        Cldr.NR ->
            "ନାଉରୁ"

        Cldr.NU ->
            "ନିଉ"

        Cldr.NZ ->
            "ନ୍ୟୁଜିଲାଣ୍ଡ"

        Cldr.OM ->
            "ଓମାନ୍"

        Cldr.PA ->
            "ପାନାମା"

        Cldr.PE ->
            "ପେରୁ"

        Cldr.PF ->
            "ଫ୍ରେଞ୍ଚ ପଲିନେସିଆ"

        Cldr.PG ->
            "ପପୁଆ ନ୍ୟୁ ଗୁଏନିଆ"

        Cldr.PH ->
            "ଫିଲିପାଇନସ୍"

        Cldr.PK ->
            "ପାକିସ୍ତାନ"

        Cldr.PL ->
            "ପୋଲାଣ୍ଡ"

        Cldr.PM ->
            "ସେଣ୍ଟ ପିଏରେ ଏବଂ ମିକ୍ୱେଲନ୍‌"

        Cldr.PN ->
            "ପିଟକାଇରିନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.PR ->
            "ପୁଏର୍ତ୍ତୋ ରିକୋ"

        Cldr.PS ->
            "ପାଲେଷ୍ଟେନିୟ ଭୂଭାଗ"

        Cldr.PT ->
            "ପର୍ତ୍ତୁଗାଲ୍"

        Cldr.PW ->
            "ପାଲାଉ"

        Cldr.PY ->
            "ପାରାଗୁଏ"

        Cldr.QA ->
            "କତାର୍"

        Cldr.RE ->
            "ରିୟୁନିଅନ୍"

        Cldr.RO ->
            "ରୋମାନିଆ"

        Cldr.RS ->
            "ସର୍ବିଆ"

        Cldr.RU ->
            "ରୁଷିଆ"

        Cldr.RW ->
            "ରାୱାଣ୍ଡା"

        Cldr.SA ->
            "ସାଉଦି ଆରବିଆ"

        Cldr.SB ->
            "ସୋଲୋମନ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.SC ->
            "ସେଚେଲସ୍"

        Cldr.SD ->
            "ସୁଦାନ"

        Cldr.SE ->
            "ସ୍ୱେଡେନ୍"

        Cldr.SG ->
            "ସିଙ୍ଗାପୁର୍"

        Cldr.SH ->
            "ସେଣ୍ଟ ହେଲେନା"

        Cldr.SI ->
            "ସ୍ଲୋଭେନିଆ"

        Cldr.SJ ->
            "ସାଲବାର୍ଡ ଏବଂ ଜାନ୍‌ ମାୟେନ୍‌"

        Cldr.SK ->
            "ସ୍ଲୋଭାକିଆ"

        Cldr.SL ->
            "ସିଏରା ଲିଓନ"

        Cldr.SM ->
            "ସାନ୍ ମାରିନୋ"

        Cldr.SN ->
            "ସେନେଗାଲ୍"

        Cldr.SO ->
            "ସୋମାଲିଆ"

        Cldr.SR ->
            "ସୁରିନାମ"

        Cldr.SS ->
            "ଦକ୍ଷିଣ ସୁଦାନ"

        Cldr.ST ->
            "ସାଓ ଟୋମେ ଏବଂ ପ୍ରିନସିପି"

        Cldr.SV ->
            "ଏଲ୍ ସାଲଭାଡୋର୍"

        Cldr.SX ->
            "ସିଣ୍ଟ ମାର୍ଟୀନ୍‌"

        Cldr.SY ->
            "ସିରିଆ"

        Cldr.SZ ->
            "ଇସ୍ୱାତିନୀ"

        Cldr.TC ->
            "ତୁର୍କସ୍‌ ଏବଂ କାଇକୋସ୍‌ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.TD ->
            "ଚାଦ୍"

        Cldr.TF ->
            "ଫରାସୀ ଦକ୍ଷିଣ କ୍ଷେତ୍ର"

        Cldr.TG ->
            "ଟୋଗୋ"

        Cldr.TH ->
            "ଥାଇଲ୍ୟାଣ୍ଡ"

        Cldr.TJ ->
            "ତାଜିକିସ୍ଥାନ୍"

        Cldr.TK ->
            "ଟୋକେଲାଉ"

        Cldr.TL ->
            "ତିମୋର୍-ଲେଷ୍ଟେ"

        Cldr.TM ->
            "ତୁର୍କମେନିସ୍ତାନ"

        Cldr.TN ->
            "ଟ୍ୟୁନିସିଆ"

        Cldr.TO ->
            "ଟୋଙ୍ଗା"

        Cldr.TR ->
            "ତୁର୍କୀ"

        Cldr.TT ->
            "ତ୍ରିନିଦାଦ୍ ଏବଂ ଟୋବାଗୋ"

        Cldr.TV ->
            "ତୁଭାଲୁ"

        Cldr.TW ->
            "ତାଇୱାନ"

        Cldr.TZ ->
            "ତାଞ୍ଜାନିଆ"

        Cldr.UA ->
            "ୟୁକ୍ରେନ୍"

        Cldr.UG ->
            "ଉଗାଣ୍ଡା"

        Cldr.UM ->
            "ଯୁକ୍ତରାଷ୍ଟ୍ର ଆଉଟ୍‌ଲାଇଙ୍ଗ ଦ୍ଵୀପପୁଞ୍ଜ"

        Cldr.US ->
            "ଯୁକ୍ତ ରାଷ୍ଟ୍ର"

        Cldr.UY ->
            "ଉରୁଗୁଏ"

        Cldr.UZ ->
            "ଉଜବେକିସ୍ତାନ"

        Cldr.VA ->
            "ଭାଟିକାନ୍ ସିଟି"

        Cldr.VC ->
            "ସେଣ୍ଟ ଭିନସେଣ୍ଟ ଏବଂ ଦି ଗ୍ରେନାଡିସ୍"

        Cldr.VE ->
            "ଭେନେଜୁଏଲା"

        Cldr.VG ->
            "ବ୍ରିଟିଶ୍‌ ଭର୍ଜିନ୍ ଦ୍ୱୀପପୁଞ୍ଜ"

        Cldr.VI ->
            "ଯୁକ୍ତରାଷ୍ଟ୍ର ଭିର୍ଜିନ୍ ଦ୍ଵୀପପୁଞ୍ଜ"

        Cldr.VN ->
            "ଭିଏତନାମ୍"

        Cldr.VU ->
            "ଭାନୁଆତୁ"

        Cldr.WF ->
            "ୱାଲିସ୍ ଏବଂ ଫୁତୁନା"

        Cldr.WS ->
            "ସାମୋଆ"

        Cldr.XK ->
            "କୋସୋଭୋ"

        Cldr.YE ->
            "ୟେମେନ୍"

        Cldr.YT ->
            "ମାୟୋଟେ"

        Cldr.ZA ->
            "ଦକ୍ଷିଣ ଆଫ୍ରିକା"

        Cldr.ZM ->
            "ଜାମ୍ବିଆ"

        Cldr.ZW ->
            "ଜିମ୍ବାୱେ"