module Cldr.Pashto exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Pashto.

    AD اندورا
    AE متحده عرب امارات
    AF افغانستان
    AG انټيګوا او باربودا
    AI انګیلا
    AL البانیه
    AM ارمنستان
    AO انګولا
    AQ انتارکتیکا
    AR ارجنټاين
    AS امریکایی ساماوا
    AT اتریش
    AU آسټرالیا
    AW آروبا
    AX الاند ټاپوان
    AZ اذربايجان
    BA بوسنيا او هېرزګوينا
    BB باربادوس
    BD بنگله دېش
    BE بیلجیم
    BF بورکینا فاسو
    BG بلغاریه
    BH بحرين
    BI بروندي
    BJ بینن
    BL سينټ بارتيلمي
    BM برمودا
    BN برونائي
    BO بولیویا
    BQ کیریبین هالینډ
    BR برازیل
    BS باهماس
    BT بهوټان
    BV بوویټ ټاپو
    BW بوتسوانه
    BY بیلاروس
    BZ بلیز
    CA کاناډا
    CC کوکوز (کيلنګ) ټاپوګان
    CD کانګو - کینشاسا
    CF وسطي افريقا جمهور
    CG کانګو - بروزوییل
    CH سویس
    CI د عاج ساحل
    CK کوک ټاپوګان
    CL چیلي
    CM کامرون
    CN چین
    CO کولمبیا
    CR کوستاریکا
    CU کیوبا
    CV کیپ ورد
    CW کوراکاو
    CX د کريسمس ټاپو
    CY قبرس
    CZ چکیا
    DE المان
    DJ جبوتي
    DK ډنمارک
    DM دومینیکا
    DO جمهوريه ډومينيکن
    DZ الجزایر
    EC اکوادور
    EE استونیا
    EG مصر
    EH لويديځ صحارا
    ER اریتره
    ES هسپانیه
    ET حبشه
    FI فنلینډ
    FJ فجي
    FK فاکلينډ ټاپوګان
    FM میکرونیزیا
    FO فارو ټاپو
    FR فرانسه
    GA ګابن
    GB برتانیه
    GD ګرنادا
    GE گورجستان
    GF فرانسوي ګانا
    GG ګرنسي
    GH ګانا
    GI جبل الطارق
    GL ګرینلینډ
    GM ګامبیا
    GN ګینه
    GP ګوادلوپ
    GQ استوایی ګیني
    GR یونان
    GS سويلي جارجيا او سويلي سېنډوچ ټاپوګان
    GT ګواتیمالا
    GU ګوام
    GW ګینه بیسو
    GY ګیانا
    HK هانګ کانګ SAR چین
    HM هارډ او ميکډانلډ ټاپوګان
    HN هانډوراس
    HR کرواشيا
    HT هایټي
    HU مجارستان
    ID اندونیزیا
    IE آيرلېنډ
    IL اسراييل
    IM د آئل آف مین
    IN هند
    IO د برتانوي هند سمندري سيمه
    IQ عراق
    IR ايران
    IS آیسلینډ
    IT ایټالیه
    JE جرسی
    JM جمیکا
    JO اردن
    JP جاپان
    KE کینیا
    KG قرغزستان
    KH کمبودیا
    KI کیري باتي
    KM کوموروس
    KN سینټ کټس او نیویس
    KP شمالی کوریا
    KR سویلي کوریا
    KW کويت
    KY کیمان ټاپوګان
    KZ قزاقستان
    LA لاوس
    LB لبنان
    LC سینټ لوسیا
    LI لیختن اشتاین
    LK سريلنکا
    LR لايبيريا
    LS لسوتو
    LT لیتوانیا
    LU لوګزامبورګ
    LV ليتهويا
    LY لیبیا
    MA مراکش
    MC موناکو
    MD مولدوا
    ME مونټینیګرو
    MF سینټ مارټن
    MG مدغاسکر
    MH مارشل ټاپوګان
    MK شمالي مقدونيه
    ML مالي
    MM ميانمار (برما)
    MN منګوليا
    MO مکاو SAR چین
    MP شمالي ماريانا ټاپوګان
    MQ مارټینیک
    MR موریتانیا
    MS مانټیسیرت
    MT مالټا
    MU موریشیس
    MV مالديپ
    MW مالاوي
    MX میکسیکو
    MY مالیزیا
    MZ موزمبيق
    NA نیمبیا
    NC نوی کالیډونیا
    NE نايجير
    NF نارفولک ټاپوګان
    NG نایجیریا
    NI نکاراګوا
    NL هالېنډ
    NO ناروۍ
    NP نیپال
    NR نایرو
    NU نیوو
    NZ نیوزیلنډ
    OM عمان
    PA پاناما
    PE پیرو
    PF فرانسوي پولينيسيا
    PG پاپوا نيو ګيني
    PH فلپين
    PK پاکستان
    PL پولنډ
    PM سینټ پییر او میکولون
    PN پيټکيرن ټاپوګان
    PR پورتو ریکو
    PS فلسطیني سيمې
    PT پورتګال
    PW پلاؤ
    PY پاراګوی
    QA قطر
    RE ریونین
    RO رومانیا
    RS سربيا
    RU روسیه
    RW روندا
    SA سعودي عربستان
    SB سليمان ټاپوګان
    SC سیچیلیس
    SD سوډان
    SE سویډن
    SG سينگاپور
    SH سینټ هیلینا
    SI سلوانیا
    SJ سوالبارد او جان ميين
    SK سلواکیا
    SL سییرا لیون
    SM سان مارینو
    SN سينيګال
    SO سومالیا
    SR سورینام
    SS سويلي سوډان
    ST ساو ټیم او پرنسیپ
    SV سالوېډور
    SX سینټ مارټین
    SY سوریه
    SZ اسواټيني
    TC د ترکیې او کیکاسو ټاپو
    TD چاډ
    TF د فرانسې جنوبي سیمې
    TG ټوګو
    TH تهايلنډ
    TJ تاجکستان
    TK توکیلو
    TL تيمور-ليسټ
    TM تورکمنستان
    TN تونس
    TO تونګا
    TR ترکي
    TT ټرينيډاډ او ټوباګو
    TV توالیو
    TW تائيوان
    TZ تنزانیا
    UA اوکراین
    UG یوګانډا
    UM د متحده ایالاتو ټاپوګان
    US متحده آيالات
    UY یوروګوی
    UZ اوزبکستان
    VA واتیکان ښار
    VC سینټ ویسنټینټ او ګرینډینز
    VE وینزویلا
    VG بریتانوی ویګور ټاپوګان
    VI د متحده آيالاتو ورجن ټاپوګان
    VN وېتنام
    VU واناتو
    WF والیس او فوتونا
    WS ساماوا
    XK کوسوو
    YE یمن
    YT مايوټ
    ZA سویلي افریقا
    ZM زیمبیا
    ZW زیمبابوی
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "اندورا"

        Cldr.AE ->
            "متحده عرب امارات"

        Cldr.AF ->
            "افغانستان"

        Cldr.AG ->
            "انټيګوا او باربودا"

        Cldr.AI ->
            "انګیلا"

        Cldr.AL ->
            "البانیه"

        Cldr.AM ->
            "ارمنستان"

        Cldr.AO ->
            "انګولا"

        Cldr.AQ ->
            "انتارکتیکا"

        Cldr.AR ->
            "ارجنټاين"

        Cldr.AS ->
            "امریکایی ساماوا"

        Cldr.AT ->
            "اتریش"

        Cldr.AU ->
            "آسټرالیا"

        Cldr.AW ->
            "آروبا"

        Cldr.AX ->
            "الاند ټاپوان"

        Cldr.AZ ->
            "اذربايجان"

        Cldr.BA ->
            "بوسنيا او هېرزګوينا"

        Cldr.BB ->
            "باربادوس"

        Cldr.BD ->
            "بنگله دېش"

        Cldr.BE ->
            "بیلجیم"

        Cldr.BF ->
            "بورکینا فاسو"

        Cldr.BG ->
            "بلغاریه"

        Cldr.BH ->
            "بحرين"

        Cldr.BI ->
            "بروندي"

        Cldr.BJ ->
            "بینن"

        Cldr.BL ->
            "سينټ بارتيلمي"

        Cldr.BM ->
            "برمودا"

        Cldr.BN ->
            "برونائي"

        Cldr.BO ->
            "بولیویا"

        Cldr.BQ ->
            "کیریبین هالینډ"

        Cldr.BR ->
            "برازیل"

        Cldr.BS ->
            "باهماس"

        Cldr.BT ->
            "بهوټان"

        Cldr.BV ->
            "بوویټ ټاپو"

        Cldr.BW ->
            "بوتسوانه"

        Cldr.BY ->
            "بیلاروس"

        Cldr.BZ ->
            "بلیز"

        Cldr.CA ->
            "کاناډا"

        Cldr.CC ->
            "کوکوز (کيلنګ) ټاپوګان"

        Cldr.CD ->
            "کانګو - کینشاسا"

        Cldr.CF ->
            "وسطي افريقا جمهور"

        Cldr.CG ->
            "کانګو - بروزوییل"

        Cldr.CH ->
            "سویس"

        Cldr.CI ->
            "د عاج ساحل"

        Cldr.CK ->
            "کوک ټاپوګان"

        Cldr.CL ->
            "چیلي"

        Cldr.CM ->
            "کامرون"

        Cldr.CN ->
            "چین"

        Cldr.CO ->
            "کولمبیا"

        Cldr.CR ->
            "کوستاریکا"

        Cldr.CU ->
            "کیوبا"

        Cldr.CV ->
            "کیپ ورد"

        Cldr.CW ->
            "کوراکاو"

        Cldr.CX ->
            "د کريسمس ټاپو"

        Cldr.CY ->
            "قبرس"

        Cldr.CZ ->
            "چکیا"

        Cldr.DE ->
            "المان"

        Cldr.DJ ->
            "جبوتي"

        Cldr.DK ->
            "ډنمارک"

        Cldr.DM ->
            "دومینیکا"

        Cldr.DO ->
            "جمهوريه ډومينيکن"

        Cldr.DZ ->
            "الجزایر"

        Cldr.EC ->
            "اکوادور"

        Cldr.EE ->
            "استونیا"

        Cldr.EG ->
            "مصر"

        Cldr.EH ->
            "لويديځ صحارا"

        Cldr.ER ->
            "اریتره"

        Cldr.ES ->
            "هسپانیه"

        Cldr.ET ->
            "حبشه"

        Cldr.FI ->
            "فنلینډ"

        Cldr.FJ ->
            "فجي"

        Cldr.FK ->
            "فاکلينډ ټاپوګان"

        Cldr.FM ->
            "میکرونیزیا"

        Cldr.FO ->
            "فارو ټاپو"

        Cldr.FR ->
            "فرانسه"

        Cldr.GA ->
            "ګابن"

        Cldr.GB ->
            "برتانیه"

        Cldr.GD ->
            "ګرنادا"

        Cldr.GE ->
            "گورجستان"

        Cldr.GF ->
            "فرانسوي ګانا"

        Cldr.GG ->
            "ګرنسي"

        Cldr.GH ->
            "ګانا"

        Cldr.GI ->
            "جبل الطارق"

        Cldr.GL ->
            "ګرینلینډ"

        Cldr.GM ->
            "ګامبیا"

        Cldr.GN ->
            "ګینه"

        Cldr.GP ->
            "ګوادلوپ"

        Cldr.GQ ->
            "استوایی ګیني"

        Cldr.GR ->
            "یونان"

        Cldr.GS ->
            "سويلي جارجيا او سويلي سېنډوچ ټاپوګان"

        Cldr.GT_ ->
            "ګواتیمالا"

        Cldr.GU ->
            "ګوام"

        Cldr.GW ->
            "ګینه بیسو"

        Cldr.GY ->
            "ګیانا"

        Cldr.HK ->
            "هانګ کانګ SAR چین"

        Cldr.HM ->
            "هارډ او ميکډانلډ ټاپوګان"

        Cldr.HN ->
            "هانډوراس"

        Cldr.HR ->
            "کرواشيا"

        Cldr.HT ->
            "هایټي"

        Cldr.HU ->
            "مجارستان"

        Cldr.ID ->
            "اندونیزیا"

        Cldr.IE ->
            "آيرلېنډ"

        Cldr.IL ->
            "اسراييل"

        Cldr.IM ->
            "د آئل آف مین"

        Cldr.IN ->
            "هند"

        Cldr.IO ->
            "د برتانوي هند سمندري سيمه"

        Cldr.IQ ->
            "عراق"

        Cldr.IR ->
            "ايران"

        Cldr.IS ->
            "آیسلینډ"

        Cldr.IT ->
            "ایټالیه"

        Cldr.JE ->
            "جرسی"

        Cldr.JM ->
            "جمیکا"

        Cldr.JO ->
            "اردن"

        Cldr.JP ->
            "جاپان"

        Cldr.KE ->
            "کینیا"

        Cldr.KG ->
            "قرغزستان"

        Cldr.KH ->
            "کمبودیا"

        Cldr.KI ->
            "کیري باتي"

        Cldr.KM ->
            "کوموروس"

        Cldr.KN ->
            "سینټ کټس او نیویس"

        Cldr.KP ->
            "شمالی کوریا"

        Cldr.KR ->
            "سویلي کوریا"

        Cldr.KW ->
            "کويت"

        Cldr.KY ->
            "کیمان ټاپوګان"

        Cldr.KZ ->
            "قزاقستان"

        Cldr.LA ->
            "لاوس"

        Cldr.LB ->
            "لبنان"

        Cldr.LC ->
            "سینټ لوسیا"

        Cldr.LI ->
            "لیختن اشتاین"

        Cldr.LK ->
            "سريلنکا"

        Cldr.LR ->
            "لايبيريا"

        Cldr.LS ->
            "لسوتو"

        Cldr.LT_ ->
            "لیتوانیا"

        Cldr.LU ->
            "لوګزامبورګ"

        Cldr.LV ->
            "ليتهويا"

        Cldr.LY ->
            "لیبیا"

        Cldr.MA ->
            "مراکش"

        Cldr.MC ->
            "موناکو"

        Cldr.MD ->
            "مولدوا"

        Cldr.ME ->
            "مونټینیګرو"

        Cldr.MF ->
            "سینټ مارټن"

        Cldr.MG ->
            "مدغاسکر"

        Cldr.MH ->
            "مارشل ټاپوګان"

        Cldr.MK ->
            "شمالي مقدونيه"

        Cldr.ML ->
            "مالي"

        Cldr.MM ->
            "ميانمار (برما)"

        Cldr.MN ->
            "منګوليا"

        Cldr.MO ->
            "مکاو SAR چین"

        Cldr.MP ->
            "شمالي ماريانا ټاپوګان"

        Cldr.MQ ->
            "مارټینیک"

        Cldr.MR ->
            "موریتانیا"

        Cldr.MS ->
            "مانټیسیرت"

        Cldr.MT ->
            "مالټا"

        Cldr.MU ->
            "موریشیس"

        Cldr.MV ->
            "مالديپ"

        Cldr.MW ->
            "مالاوي"

        Cldr.MX ->
            "میکسیکو"

        Cldr.MY ->
            "مالیزیا"

        Cldr.MZ ->
            "موزمبيق"

        Cldr.NA ->
            "نیمبیا"

        Cldr.NC ->
            "نوی کالیډونیا"

        Cldr.NE ->
            "نايجير"

        Cldr.NF ->
            "نارفولک ټاپوګان"

        Cldr.NG ->
            "نایجیریا"

        Cldr.NI ->
            "نکاراګوا"

        Cldr.NL ->
            "هالېنډ"

        Cldr.NO ->
            "ناروۍ"

        Cldr.NP ->
            "نیپال"

        Cldr.NR ->
            "نایرو"

        Cldr.NU ->
            "نیوو"

        Cldr.NZ ->
            "نیوزیلنډ"

        Cldr.OM ->
            "عمان"

        Cldr.PA ->
            "پاناما"

        Cldr.PE ->
            "پیرو"

        Cldr.PF ->
            "فرانسوي پولينيسيا"

        Cldr.PG ->
            "پاپوا نيو ګيني"

        Cldr.PH ->
            "فلپين"

        Cldr.PK ->
            "پاکستان"

        Cldr.PL ->
            "پولنډ"

        Cldr.PM ->
            "سینټ پییر او میکولون"

        Cldr.PN ->
            "پيټکيرن ټاپوګان"

        Cldr.PR ->
            "پورتو ریکو"

        Cldr.PS ->
            "فلسطیني سيمې"

        Cldr.PT ->
            "پورتګال"

        Cldr.PW ->
            "پلاؤ"

        Cldr.PY ->
            "پاراګوی"

        Cldr.QA ->
            "قطر"

        Cldr.RE ->
            "ریونین"

        Cldr.RO ->
            "رومانیا"

        Cldr.RS ->
            "سربيا"

        Cldr.RU ->
            "روسیه"

        Cldr.RW ->
            "روندا"

        Cldr.SA ->
            "سعودي عربستان"

        Cldr.SB ->
            "سليمان ټاپوګان"

        Cldr.SC ->
            "سیچیلیس"

        Cldr.SD ->
            "سوډان"

        Cldr.SE ->
            "سویډن"

        Cldr.SG ->
            "سينگاپور"

        Cldr.SH ->
            "سینټ هیلینا"

        Cldr.SI ->
            "سلوانیا"

        Cldr.SJ ->
            "سوالبارد او جان ميين"

        Cldr.SK ->
            "سلواکیا"

        Cldr.SL ->
            "سییرا لیون"

        Cldr.SM ->
            "سان مارینو"

        Cldr.SN ->
            "سينيګال"

        Cldr.SO ->
            "سومالیا"

        Cldr.SR ->
            "سورینام"

        Cldr.SS ->
            "سويلي سوډان"

        Cldr.ST ->
            "ساو ټیم او پرنسیپ"

        Cldr.SV ->
            "سالوېډور"

        Cldr.SX ->
            "سینټ مارټین"

        Cldr.SY ->
            "سوریه"

        Cldr.SZ ->
            "اسواټيني"

        Cldr.TC ->
            "د ترکیې او کیکاسو ټاپو"

        Cldr.TD ->
            "چاډ"

        Cldr.TF ->
            "د فرانسې جنوبي سیمې"

        Cldr.TG ->
            "ټوګو"

        Cldr.TH ->
            "تهايلنډ"

        Cldr.TJ ->
            "تاجکستان"

        Cldr.TK ->
            "توکیلو"

        Cldr.TL ->
            "تيمور-ليسټ"

        Cldr.TM ->
            "تورکمنستان"

        Cldr.TN ->
            "تونس"

        Cldr.TO ->
            "تونګا"

        Cldr.TR ->
            "ترکي"

        Cldr.TT ->
            "ټرينيډاډ او ټوباګو"

        Cldr.TV ->
            "توالیو"

        Cldr.TW ->
            "تائيوان"

        Cldr.TZ ->
            "تنزانیا"

        Cldr.UA ->
            "اوکراین"

        Cldr.UG ->
            "یوګانډا"

        Cldr.UM ->
            "د متحده ایالاتو ټاپوګان"

        Cldr.US ->
            "متحده آيالات"

        Cldr.UY ->
            "یوروګوی"

        Cldr.UZ ->
            "اوزبکستان"

        Cldr.VA ->
            "واتیکان ښار"

        Cldr.VC ->
            "سینټ ویسنټینټ او ګرینډینز"

        Cldr.VE ->
            "وینزویلا"

        Cldr.VG ->
            "بریتانوی ویګور ټاپوګان"

        Cldr.VI ->
            "د متحده آيالاتو ورجن ټاپوګان"

        Cldr.VN ->
            "وېتنام"

        Cldr.VU ->
            "واناتو"

        Cldr.WF ->
            "والیس او فوتونا"

        Cldr.WS ->
            "ساماوا"

        Cldr.XK ->
            "کوسوو"

        Cldr.YE ->
            "یمن"

        Cldr.YT ->
            "مايوټ"

        Cldr.ZA ->
            "سویلي افریقا"

        Cldr.ZM ->
            "زیمبیا"

        Cldr.ZW ->
            "زیمبابوی"