module Cldr.Punjabi exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Punjabi.

    AD ਅੰਡੋਰਾ
    AE ਸੰਯੁਕਤ ਅਰਬ ਅਮੀਰਾਤ
    AF ਅਫ਼ਗਾਨਿਸਤਾਨ
    AG ਐਂਟੀਗੁਆ ਅਤੇ ਬਾਰਬੁਡਾ
    AI ਅੰਗੁਇਲਾ
    AL ਅਲਬਾਨੀਆ
    AM ਅਰਮੀਨੀਆ
    AO ਅੰਗੋਲਾ
    AQ ਅੰਟਾਰਕਟਿਕਾ
    AR ਅਰਜਨਟੀਨਾ
    AS ਅਮੈਰੀਕਨ ਸਮੋਆ
    AT ਆਸਟਰੀਆ
    AU ਆਸਟ੍ਰੇਲੀਆ
    AW ਅਰੂਬਾ
    AX ਅਲੈਂਡ ਟਾਪੂ
    AZ ਅਜ਼ਰਬਾਈਜਾਨ
    BA ਬੋਸਨੀਆ ਅਤੇ ਹਰਜ਼ੇਗੋਵੀਨਾ
    BB ਬਾਰਬਾਡੋਸ
    BD ਬੰਗਲਾਦੇਸ਼
    BE ਬੈਲਜੀਅਮ
    BF ਬੁਰਕੀਨਾ ਫ਼ਾਸੋ
    BG ਬੁਲਗਾਰੀਆ
    BH ਬਹਿਰੀਨ
    BI ਬੁਰੁੰਡੀ
    BJ ਬੇਨਿਨ
    BL ਸੇਂਟ ਬਾਰਥੇਲੇਮੀ
    BM ਬਰਮੂਡਾ
    BN ਬਰੂਨੇਈ
    BO ਬੋਲੀਵੀਆ
    BQ ਕੈਰੇਬੀਆਈ ਨੀਦਰਲੈਂਡ
    BR ਬ੍ਰਾਜ਼ੀਲ
    BS ਬਹਾਮਾਸ
    BT ਭੂਟਾਨ
    BV ਬੌਵੇਟ ਟਾਪੂ
    BW ਬੋਤਸਵਾਨਾ
    BY ਬੇਲਾਰੂਸ
    BZ ਬੇਲੀਜ਼
    CA ਕੈਨੇਡਾ
    CC ਕੋਕੋਸ (ਕੀਲਿੰਗ) ਟਾਪੂ
    CD ਕਾਂਗੋ (ਡੀਆਰਸੀ)
    CF ਕੇਂਦਰੀ ਅਫ਼ਰੀਕੀ ਗਣਰਾਜ
    CG ਕਾਂਗੋ ਗਣਰਾਜ
    CH ਸਵਿਟਜ਼ਰਲੈਂਡ
    CI ਕੋਟ ਡੀਵੋਆਰ
    CK ਕੁੱਕ ਟਾਪੂ
    CL ਚਿਲੀ
    CM ਕੈਮਰੂਨ
    CN ਚੀਨ
    CO ਕੋਲੰਬੀਆ
    CR ਕੋਸਟਾ ਰੀਕਾ
    CU ਕਿਊਬਾ
    CV ਕੇਪ ਵਰਡੇ
    CW ਕੁਰਾਕਾਓ
    CX ਕ੍ਰਿਸਮਿਸ ਟਾਪੂ
    CY ਸਾਇਪ੍ਰਸ
    CZ ਚੈੱਕ ਗਣਰਾਜ
    DE ਜਰਮਨੀ
    DJ ਜ਼ੀਬੂਤੀ
    DK ਡੈਨਮਾਰਕ
    DM ਡੋਮੀਨਿਕਾ
    DO ਡੋਮੀਨਿਕਾਈ ਗਣਰਾਜ
    DZ ਅਲਜੀਰੀਆ
    EC ਇਕਵੇਡੋਰ
    EE ਇਸਟੋਨੀਆ
    EG ਮਿਸਰ
    EH ਪੱਛਮੀ ਸਹਾਰਾ
    ER ਇਰੀਟ੍ਰਿਆ
    ES ਸਪੇਨ
    ET ਇਥੋਪੀਆ
    FI ਫਿਨਲੈਂਡ
    FJ ਫ਼ਿਜੀ
    FK ਫ਼ਾਕਲੈਂਡ ਟਾਪੂ
    FM ਮਾਇਕ੍ਰੋਨੇਸ਼ੀਆ
    FO ਫੈਰੋ ਟਾਪੂ
    FR ਫ਼ਰਾਂਸ
    GA ਗਬੋਨ
    GB ਯੂਨਾਈਟਡ ਕਿੰਗਡਮ
    GD ਗ੍ਰੇਨਾਡਾ
    GE ਜਾਰਜੀਆ
    GF ਫਰੈਂਚ ਗੁਇਆਨਾ
    GG ਗਰਨਜੀ
    GH ਘਾਨਾ
    GI ਜਿਬਰਾਲਟਰ
    GL ਗ੍ਰੀਨਲੈਂਡ
    GM ਗੈਂਬੀਆ
    GN ਗਿਨੀ
    GP ਗੁਆਡੇਲੋਪ
    GQ ਭੂ-ਖੰਡੀ ਗਿਨੀ
    GR ਗ੍ਰੀਸ
    GS ਦੱਖਣੀ ਜਾਰਜੀਆ ਅਤੇ ਦੱਖਣੀ ਸੈਂਡਵਿਚ ਟਾਪੂ
    GT ਗੁਆਟੇਮਾਲਾ
    GU ਗੁਆਮ
    GW ਗਿਨੀ-ਬਿਸਾਉ
    GY ਗੁਯਾਨਾ
    HK ਹਾਂਗ ਕਾਂਗ
    HM ਹਰਡ ਤੇ ਮੈਕਡੋਨਾਲਡ ਟਾਪੂ
    HN ਹੋਂਡੁਰਸ
    HR ਕਰੋਏਸ਼ੀਆ
    HT ਹੈਤੀ
    HU ਹੰਗਰੀ
    ID ਇੰਡੋਨੇਸ਼ੀਆ
    IE ਆਇਰਲੈਂਡ
    IL ਇਜ਼ਰਾਈਲ
    IM ਆਇਲ ਆਫ ਮੈਨ
    IN ਭਾਰਤ
    IO ਬਰਤਾਨਵੀ ਹਿੰਦ ਮਹਾਂਸਾਗਰ ਖਿੱਤਾ
    IQ ਇਰਾਕ
    IR ਈਰਾਨ
    IS ਆਈਸਲੈਂਡ
    IT ਇਟਲੀ
    JE ਜਰਸੀ
    JM ਜਮਾਇਕਾ
    JO ਜਾਰਡਨ
    JP ਜਪਾਨ
    KE ਕੀਨੀਆ
    KG ਕਿਰਗਿਜ਼ਸਤਾਨ
    KH ਕੰਬੋਡੀਆ
    KI ਕਿਰਬਾਤੀ
    KM ਕੋਮੋਰੋਸ
    KN ਸੇਂਟ ਕਿਟਸ ਐਂਡ ਨੇਵਿਸ
    KP ਉੱਤਰ ਕੋਰੀਆ
    KR ਦੱਖਣ ਕੋਰੀਆ
    KW ਕੁਵੈਤ
    KY ਕੇਮੈਨ ਟਾਪੂ
    KZ ਕਜ਼ਾਖਸਤਾਨ
    LA ਲਾਓਸ
    LB ਲੈਬਨਾਨ
    LC ਸੇਂਟ ਲੂਸੀਆ
    LI ਲਿਚੇਂਸਟਾਇਨ
    LK ਸ੍ਰੀ ਲੰਕਾ
    LR ਲਾਈਬੀਰੀਆ
    LS ਲੇਸੋਥੋ
    LT ਲਿਥੁਆਨੀਆ
    LU ਲਕਜ਼ਮਬਰਗ
    LV ਲਾਤਵੀਆ
    LY ਲੀਬੀਆ
    MA ਮੋਰੱਕੋ
    MC ਮੋਨਾਕੋ
    MD ਮੋਲਡੋਵਾ
    ME ਮੋਂਟੇਨੇਗਰੋ
    MF ਸੇਂਟ ਮਾਰਟਿਨ
    MG ਮੈਡਾਗਾਸਕਰ
    MH ਮਾਰਸ਼ਲ ਟਾਪੂ
    MK ਉੱਤਰੀ ਮੈਕਡੋਨੀਆ
    ML ਮਾਲੀ
    MM ਮਿਆਂਮਾਰ (ਬਰਮਾ)
    MN ਮੰਗੋਲੀਆ
    MO ਮਕਾਉ
    MP ਉੱਤਰੀ ਮਾਰੀਆਨਾ ਟਾਪੂ
    MQ ਮਾਰਟੀਨਿਕ
    MR ਮੋਰਿਟਾਨੀਆ
    MS ਮੋਂਟਸੇਰਾਤ
    MT ਮਾਲਟਾ
    MU ਮੌਰੀਸ਼ਸ
    MV ਮਾਲਦੀਵ
    MW ਮਲਾਵੀ
    MX ਮੈਕਸੀਕੋ
    MY ਮਲੇਸ਼ੀਆ
    MZ ਮੋਜ਼ਾਮਬੀਕ
    NA ਨਾਮੀਬੀਆ
    NC ਨਿਊ ਕੈਲੇਡੋਨੀਆ
    NE ਨਾਈਜਰ
    NF ਨੋਰਫੌਕ ਟਾਪੂ
    NG ਨਾਈਜੀਰੀਆ
    NI ਨਿਕਾਰਾਗੁਆ
    NL ਨੀਦਰਲੈਂਡ
    NO ਨਾਰਵੇ
    NP ਨੇਪਾਲ
    NR ਨਾਉਰੂ
    NU ਨਿਯੂ
    NZ ਨਿਊਜ਼ੀਲੈਂਡ
    OM ਓਮਾਨ
    PA ਪਨਾਮਾ
    PE ਪੇਰੂ
    PF ਫਰੈਂਚ ਪੋਲੀਨੇਸ਼ੀਆ
    PG ਪਾਪੂਆ ਨਿਊ ਗਿਨੀ
    PH ਫਿਲੀਪੀਨਜ
    PK ਪਾਕਿਸਤਾਨ
    PL ਪੋਲੈਂਡ
    PM ਸੇਂਟ ਪੀਅਰੇ ਐਂਡ ਮਿਕੇਲਨ
    PN ਪਿਟਕੇਰਨ ਟਾਪੂ
    PR ਪਿਊਰਟੋ ਰਿਕੋ
    PS ਫਿਲੀਸਤੀਨ
    PT ਪੁਰਤਗਾਲ
    PW ਪਲਾਉ
    PY ਪੈਰਾਗਵੇ
    QA ਕਤਰ
    RE ਰਿਯੂਨੀਅਨ
    RO ਰੋਮਾਨੀਆ
    RS ਸਰਬੀਆ
    RU ਰੂਸ
    RW ਰਵਾਂਡਾ
    SA ਸਾਊਦੀ ਅਰਬ
    SB ਸੋਲੋਮਨ ਟਾਪੂ
    SC ਸੇਸ਼ਲਸ
    SD ਸੂਡਾਨ
    SE ਸਵੀਡਨ
    SG ਸਿੰਗਾਪੁਰ
    SH ਸੇਂਟ ਹੇਲੇਨਾ
    SI ਸਲੋਵੇਨੀਆ
    SJ ਸਵਾਲਬਰਡ ਅਤੇ ਜਾਨ ਮਾਯੇਨ
    SK ਸਲੋਵਾਕੀਆ
    SL ਸਿਏਰਾ ਲਿਓਨ
    SM ਸੈਨ ਮਰੀਨੋ
    SN ਸੇਨੇਗਲ
    SO ਸੋਮਾਲੀਆ
    SR ਸੂਰੀਨਾਮ
    SS ਦੱਖਣ ਸੁਡਾਨ
    ST ਸਾਓ ਟੋਮ ਅਤੇ ਪ੍ਰਿੰਸੀਪੇ
    SV ਅਲ ਸਲਵਾਡੋਰ
    SX ਸਿੰਟ ਮਾਰਟੀਨ
    SY ਸੀਰੀਆ
    SZ ਇਸਵਾਤੀਨੀ
    TC ਟੁਰਕਸ ਅਤੇ ਕੈਕੋਸ ਟਾਪੂ
    TD ਚਾਡ
    TF ਫਰੈਂਚ ਦੱਖਣੀ ਪ੍ਰਦੇਸ਼
    TG ਟੋਗੋ
    TH ਥਾਈਲੈਂਡ
    TJ ਤਾਜਿਕਿਸਤਾਨ
    TK ਟੋਕੇਲਾਉ
    TL ਪੂਰਬ ਤਿਮੋਰ
    TM ਤੁਰਕਮੇਨਿਸਤਾਨ
    TN ਟਿਊਨੀਸ਼ੀਆ
    TO ਟੌਂਗਾ
    TR ਤੁਰਕੀ
    TT ਟ੍ਰਿਨੀਡਾਡ ਅਤੇ ਟੋਬਾਗੋ
    TV ਟੁਵਾਲੂ
    TW ਤਾਇਵਾਨ
    TZ ਤਨਜ਼ਾਨੀਆ
    UA ਯੂਕਰੇਨ
    UG ਯੂਗਾਂਡਾ
    UM ਯੂ.ਐੱਸ. ਦੂਰ-ਦੁਰਾਡੇ ਟਾਪੂ
    US ਸੰਯੁਕਤ ਰਾਜ
    UY ਉਰੂਗਵੇ
    UZ ਉਜ਼ਬੇਕਿਸਤਾਨ
    VA ਵੈਟੀਕਨ ਸਿਟੀ
    VC ਸੇਂਟ ਵਿਨਸੈਂਟ ਐਂਡ ਗ੍ਰੇਨਾਡੀਨਸ
    VE ਵੇਨੇਜ਼ੂਏਲਾ
    VG ਬ੍ਰਿਟਿਸ਼ ਵਰਜਿਨ ਟਾਪੂ
    VI ਯੂ ਐੱਸ ਵਰਜਿਨ ਟਾਪੂ
    VN ਵੀਅਤਨਾਮ
    VU ਵਾਨੂਆਟੂ
    WF ਵਾਲਿਸ ਅਤੇ ਫੂਟੂਨਾ
    WS ਸਾਮੋਆ
    XK ਕੋਸੋਵੋ
    YE ਯਮਨ
    YT ਮਾਯੋਟੀ
    ZA ਦੱਖਣੀ ਅਫਰੀਕਾ
    ZM ਜ਼ਾਮਬੀਆ
    ZW ਜ਼ਿੰਬਾਬਵੇ
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "ਅੰਡੋਰਾ"

        Cldr.AE ->
            "ਸੰਯੁਕਤ ਅਰਬ ਅਮੀਰਾਤ"

        Cldr.AF ->
            "ਅਫ਼ਗਾਨਿਸਤਾਨ"

        Cldr.AG ->
            "ਐਂਟੀਗੁਆ ਅਤੇ ਬਾਰਬੁਡਾ"

        Cldr.AI ->
            "ਅੰਗੁਇਲਾ"

        Cldr.AL ->
            "ਅਲਬਾਨੀਆ"

        Cldr.AM ->
            "ਅਰਮੀਨੀਆ"

        Cldr.AO ->
            "ਅੰਗੋਲਾ"

        Cldr.AQ ->
            "ਅੰਟਾਰਕਟਿਕਾ"

        Cldr.AR ->
            "ਅਰਜਨਟੀਨਾ"

        Cldr.AS ->
            "ਅਮੈਰੀਕਨ ਸਮੋਆ"

        Cldr.AT ->
            "ਆਸਟਰੀਆ"

        Cldr.AU ->
            "ਆਸਟ੍ਰੇਲੀਆ"

        Cldr.AW ->
            "ਅਰੂਬਾ"

        Cldr.AX ->
            "ਅਲੈਂਡ ਟਾਪੂ"

        Cldr.AZ ->
            "ਅਜ਼ਰਬਾਈਜਾਨ"

        Cldr.BA ->
            "ਬੋਸਨੀਆ ਅਤੇ ਹਰਜ਼ੇਗੋਵੀਨਾ"

        Cldr.BB ->
            "ਬਾਰਬਾਡੋਸ"

        Cldr.BD ->
            "ਬੰਗਲਾਦੇਸ਼"

        Cldr.BE ->
            "ਬੈਲਜੀਅਮ"

        Cldr.BF ->
            "ਬੁਰਕੀਨਾ ਫ਼ਾਸੋ"

        Cldr.BG ->
            "ਬੁਲਗਾਰੀਆ"

        Cldr.BH ->
            "ਬਹਿਰੀਨ"

        Cldr.BI ->
            "ਬੁਰੁੰਡੀ"

        Cldr.BJ ->
            "ਬੇਨਿਨ"

        Cldr.BL ->
            "ਸੇਂਟ ਬਾਰਥੇਲੇਮੀ"

        Cldr.BM ->
            "ਬਰਮੂਡਾ"

        Cldr.BN ->
            "ਬਰੂਨੇਈ"

        Cldr.BO ->
            "ਬੋਲੀਵੀਆ"

        Cldr.BQ ->
            "ਕੈਰੇਬੀਆਈ ਨੀਦਰਲੈਂਡ"

        Cldr.BR ->
            "ਬ੍ਰਾਜ਼ੀਲ"

        Cldr.BS ->
            "ਬਹਾਮਾਸ"

        Cldr.BT ->
            "ਭੂਟਾਨ"

        Cldr.BV ->
            "ਬੌਵੇਟ ਟਾਪੂ"

        Cldr.BW ->
            "ਬੋਤਸਵਾਨਾ"

        Cldr.BY ->
            "ਬੇਲਾਰੂਸ"

        Cldr.BZ ->
            "ਬੇਲੀਜ਼"

        Cldr.CA ->
            "ਕੈਨੇਡਾ"

        Cldr.CC ->
            "ਕੋਕੋਸ (ਕੀਲਿੰਗ) ਟਾਪੂ"

        Cldr.CD ->
            "ਕਾਂਗੋ (ਡੀਆਰਸੀ)"

        Cldr.CF ->
            "ਕੇਂਦਰੀ ਅਫ਼ਰੀਕੀ ਗਣਰਾਜ"

        Cldr.CG ->
            "ਕਾਂਗੋ ਗਣਰਾਜ"

        Cldr.CH ->
            "ਸਵਿਟਜ਼ਰਲੈਂਡ"

        Cldr.CI ->
            "ਕੋਟ ਡੀਵੋਆਰ"

        Cldr.CK ->
            "ਕੁੱਕ ਟਾਪੂ"

        Cldr.CL ->
            "ਚਿਲੀ"

        Cldr.CM ->
            "ਕੈਮਰੂਨ"

        Cldr.CN ->
            "ਚੀਨ"

        Cldr.CO ->
            "ਕੋਲੰਬੀਆ"

        Cldr.CR ->
            "ਕੋਸਟਾ ਰੀਕਾ"

        Cldr.CU ->
            "ਕਿਊਬਾ"

        Cldr.CV ->
            "ਕੇਪ ਵਰਡੇ"

        Cldr.CW ->
            "ਕੁਰਾਕਾਓ"

        Cldr.CX ->
            "ਕ੍ਰਿਸਮਿਸ ਟਾਪੂ"

        Cldr.CY ->
            "ਸਾਇਪ੍ਰਸ"

        Cldr.CZ ->
            "ਚੈੱਕ ਗਣਰਾਜ"

        Cldr.DE ->
            "ਜਰਮਨੀ"

        Cldr.DJ ->
            "ਜ਼ੀਬੂਤੀ"

        Cldr.DK ->
            "ਡੈਨਮਾਰਕ"

        Cldr.DM ->
            "ਡੋਮੀਨਿਕਾ"

        Cldr.DO ->
            "ਡੋਮੀਨਿਕਾਈ ਗਣਰਾਜ"

        Cldr.DZ ->
            "ਅਲਜੀਰੀਆ"

        Cldr.EC ->
            "ਇਕਵੇਡੋਰ"

        Cldr.EE ->
            "ਇਸਟੋਨੀਆ"

        Cldr.EG ->
            "ਮਿਸਰ"

        Cldr.EH ->
            "ਪੱਛਮੀ ਸਹਾਰਾ"

        Cldr.ER ->
            "ਇਰੀਟ੍ਰਿਆ"

        Cldr.ES ->
            "ਸਪੇਨ"

        Cldr.ET ->
            "ਇਥੋਪੀਆ"

        Cldr.FI ->
            "ਫਿਨਲੈਂਡ"

        Cldr.FJ ->
            "ਫ਼ਿਜੀ"

        Cldr.FK ->
            "ਫ਼ਾਕਲੈਂਡ ਟਾਪੂ"

        Cldr.FM ->
            "ਮਾਇਕ੍ਰੋਨੇਸ਼ੀਆ"

        Cldr.FO ->
            "ਫੈਰੋ ਟਾਪੂ"

        Cldr.FR ->
            "ਫ਼ਰਾਂਸ"

        Cldr.GA ->
            "ਗਬੋਨ"

        Cldr.GB ->
            "ਯੂਨਾਈਟਡ ਕਿੰਗਡਮ"

        Cldr.GD ->
            "ਗ੍ਰੇਨਾਡਾ"

        Cldr.GE ->
            "ਜਾਰਜੀਆ"

        Cldr.GF ->
            "ਫਰੈਂਚ ਗੁਇਆਨਾ"

        Cldr.GG ->
            "ਗਰਨਜੀ"

        Cldr.GH ->
            "ਘਾਨਾ"

        Cldr.GI ->
            "ਜਿਬਰਾਲਟਰ"

        Cldr.GL ->
            "ਗ੍ਰੀਨਲੈਂਡ"

        Cldr.GM ->
            "ਗੈਂਬੀਆ"

        Cldr.GN ->
            "ਗਿਨੀ"

        Cldr.GP ->
            "ਗੁਆਡੇਲੋਪ"

        Cldr.GQ ->
            "ਭੂ-ਖੰਡੀ ਗਿਨੀ"

        Cldr.GR ->
            "ਗ੍ਰੀਸ"

        Cldr.GS ->
            "ਦੱਖਣੀ ਜਾਰਜੀਆ ਅਤੇ ਦੱਖਣੀ ਸੈਂਡਵਿਚ ਟਾਪੂ"

        Cldr.GT_ ->
            "ਗੁਆਟੇਮਾਲਾ"

        Cldr.GU ->
            "ਗੁਆਮ"

        Cldr.GW ->
            "ਗਿਨੀ-ਬਿਸਾਉ"

        Cldr.GY ->
            "ਗੁਯਾਨਾ"

        Cldr.HK ->
            "ਹਾਂਗ ਕਾਂਗ"

        Cldr.HM ->
            "ਹਰਡ ਤੇ ਮੈਕਡੋਨਾਲਡ ਟਾਪੂ"

        Cldr.HN ->
            "ਹੋਂਡੁਰਸ"

        Cldr.HR ->
            "ਕਰੋਏਸ਼ੀਆ"

        Cldr.HT ->
            "ਹੈਤੀ"

        Cldr.HU ->
            "ਹੰਗਰੀ"

        Cldr.ID ->
            "ਇੰਡੋਨੇਸ਼ੀਆ"

        Cldr.IE ->
            "ਆਇਰਲੈਂਡ"

        Cldr.IL ->
            "ਇਜ਼ਰਾਈਲ"

        Cldr.IM ->
            "ਆਇਲ ਆਫ ਮੈਨ"

        Cldr.IN ->
            "ਭਾਰਤ"

        Cldr.IO ->
            "ਬਰਤਾਨਵੀ ਹਿੰਦ ਮਹਾਂਸਾਗਰ ਖਿੱਤਾ"

        Cldr.IQ ->
            "ਇਰਾਕ"

        Cldr.IR ->
            "ਈਰਾਨ"

        Cldr.IS ->
            "ਆਈਸਲੈਂਡ"

        Cldr.IT ->
            "ਇਟਲੀ"

        Cldr.JE ->
            "ਜਰਸੀ"

        Cldr.JM ->
            "ਜਮਾਇਕਾ"

        Cldr.JO ->
            "ਜਾਰਡਨ"

        Cldr.JP ->
            "ਜਪਾਨ"

        Cldr.KE ->
            "ਕੀਨੀਆ"

        Cldr.KG ->
            "ਕਿਰਗਿਜ਼ਸਤਾਨ"

        Cldr.KH ->
            "ਕੰਬੋਡੀਆ"

        Cldr.KI ->
            "ਕਿਰਬਾਤੀ"

        Cldr.KM ->
            "ਕੋਮੋਰੋਸ"

        Cldr.KN ->
            "ਸੇਂਟ ਕਿਟਸ ਐਂਡ ਨੇਵਿਸ"

        Cldr.KP ->
            "ਉੱਤਰ ਕੋਰੀਆ"

        Cldr.KR ->
            "ਦੱਖਣ ਕੋਰੀਆ"

        Cldr.KW ->
            "ਕੁਵੈਤ"

        Cldr.KY ->
            "ਕੇਮੈਨ ਟਾਪੂ"

        Cldr.KZ ->
            "ਕਜ਼ਾਖਸਤਾਨ"

        Cldr.LA ->
            "ਲਾਓਸ"

        Cldr.LB ->
            "ਲੈਬਨਾਨ"

        Cldr.LC ->
            "ਸੇਂਟ ਲੂਸੀਆ"

        Cldr.LI ->
            "ਲਿਚੇਂਸਟਾਇਨ"

        Cldr.LK ->
            "ਸ੍ਰੀ ਲੰਕਾ"

        Cldr.LR ->
            "ਲਾਈਬੀਰੀਆ"

        Cldr.LS ->
            "ਲੇਸੋਥੋ"

        Cldr.LT_ ->
            "ਲਿਥੁਆਨੀਆ"

        Cldr.LU ->
            "ਲਕਜ਼ਮਬਰਗ"

        Cldr.LV ->
            "ਲਾਤਵੀਆ"

        Cldr.LY ->
            "ਲੀਬੀਆ"

        Cldr.MA ->
            "ਮੋਰੱਕੋ"

        Cldr.MC ->
            "ਮੋਨਾਕੋ"

        Cldr.MD ->
            "ਮੋਲਡੋਵਾ"

        Cldr.ME ->
            "ਮੋਂਟੇਨੇਗਰੋ"

        Cldr.MF ->
            "ਸੇਂਟ ਮਾਰਟਿਨ"

        Cldr.MG ->
            "ਮੈਡਾਗਾਸਕਰ"

        Cldr.MH ->
            "ਮਾਰਸ਼ਲ ਟਾਪੂ"

        Cldr.MK ->
            "ਉੱਤਰੀ ਮੈਕਡੋਨੀਆ"

        Cldr.ML ->
            "ਮਾਲੀ"

        Cldr.MM ->
            "ਮਿਆਂਮਾਰ (ਬਰਮਾ)"

        Cldr.MN ->
            "ਮੰਗੋਲੀਆ"

        Cldr.MO ->
            "ਮਕਾਉ"

        Cldr.MP ->
            "ਉੱਤਰੀ ਮਾਰੀਆਨਾ ਟਾਪੂ"

        Cldr.MQ ->
            "ਮਾਰਟੀਨਿਕ"

        Cldr.MR ->
            "ਮੋਰਿਟਾਨੀਆ"

        Cldr.MS ->
            "ਮੋਂਟਸੇਰਾਤ"

        Cldr.MT ->
            "ਮਾਲਟਾ"

        Cldr.MU ->
            "ਮੌਰੀਸ਼ਸ"

        Cldr.MV ->
            "ਮਾਲਦੀਵ"

        Cldr.MW ->
            "ਮਲਾਵੀ"

        Cldr.MX ->
            "ਮੈਕਸੀਕੋ"

        Cldr.MY ->
            "ਮਲੇਸ਼ੀਆ"

        Cldr.MZ ->
            "ਮੋਜ਼ਾਮਬੀਕ"

        Cldr.NA ->
            "ਨਾਮੀਬੀਆ"

        Cldr.NC ->
            "ਨਿਊ ਕੈਲੇਡੋਨੀਆ"

        Cldr.NE ->
            "ਨਾਈਜਰ"

        Cldr.NF ->
            "ਨੋਰਫੌਕ ਟਾਪੂ"

        Cldr.NG ->
            "ਨਾਈਜੀਰੀਆ"

        Cldr.NI ->
            "ਨਿਕਾਰਾਗੁਆ"

        Cldr.NL ->
            "ਨੀਦਰਲੈਂਡ"

        Cldr.NO ->
            "ਨਾਰਵੇ"

        Cldr.NP ->
            "ਨੇਪਾਲ"

        Cldr.NR ->
            "ਨਾਉਰੂ"

        Cldr.NU ->
            "ਨਿਯੂ"

        Cldr.NZ ->
            "ਨਿਊਜ਼ੀਲੈਂਡ"

        Cldr.OM ->
            "ਓਮਾਨ"

        Cldr.PA ->
            "ਪਨਾਮਾ"

        Cldr.PE ->
            "ਪੇਰੂ"

        Cldr.PF ->
            "ਫਰੈਂਚ ਪੋਲੀਨੇਸ਼ੀਆ"

        Cldr.PG ->
            "ਪਾਪੂਆ ਨਿਊ ਗਿਨੀ"

        Cldr.PH ->
            "ਫਿਲੀਪੀਨਜ"

        Cldr.PK ->
            "ਪਾਕਿਸਤਾਨ"

        Cldr.PL ->
            "ਪੋਲੈਂਡ"

        Cldr.PM ->
            "ਸੇਂਟ ਪੀਅਰੇ ਐਂਡ ਮਿਕੇਲਨ"

        Cldr.PN ->
            "ਪਿਟਕੇਰਨ ਟਾਪੂ"

        Cldr.PR ->
            "ਪਿਊਰਟੋ ਰਿਕੋ"

        Cldr.PS ->
            "ਫਿਲੀਸਤੀਨ"

        Cldr.PT ->
            "ਪੁਰਤਗਾਲ"

        Cldr.PW ->
            "ਪਲਾਉ"

        Cldr.PY ->
            "ਪੈਰਾਗਵੇ"

        Cldr.QA ->
            "ਕਤਰ"

        Cldr.RE ->
            "ਰਿਯੂਨੀਅਨ"

        Cldr.RO ->
            "ਰੋਮਾਨੀਆ"

        Cldr.RS ->
            "ਸਰਬੀਆ"

        Cldr.RU ->
            "ਰੂਸ"

        Cldr.RW ->
            "ਰਵਾਂਡਾ"

        Cldr.SA ->
            "ਸਾਊਦੀ ਅਰਬ"

        Cldr.SB ->
            "ਸੋਲੋਮਨ ਟਾਪੂ"

        Cldr.SC ->
            "ਸੇਸ਼ਲਸ"

        Cldr.SD ->
            "ਸੂਡਾਨ"

        Cldr.SE ->
            "ਸਵੀਡਨ"

        Cldr.SG ->
            "ਸਿੰਗਾਪੁਰ"

        Cldr.SH ->
            "ਸੇਂਟ ਹੇਲੇਨਾ"

        Cldr.SI ->
            "ਸਲੋਵੇਨੀਆ"

        Cldr.SJ ->
            "ਸਵਾਲਬਰਡ ਅਤੇ ਜਾਨ ਮਾਯੇਨ"

        Cldr.SK ->
            "ਸਲੋਵਾਕੀਆ"

        Cldr.SL ->
            "ਸਿਏਰਾ ਲਿਓਨ"

        Cldr.SM ->
            "ਸੈਨ ਮਰੀਨੋ"

        Cldr.SN ->
            "ਸੇਨੇਗਲ"

        Cldr.SO ->
            "ਸੋਮਾਲੀਆ"

        Cldr.SR ->
            "ਸੂਰੀਨਾਮ"

        Cldr.SS ->
            "ਦੱਖਣ ਸੁਡਾਨ"

        Cldr.ST ->
            "ਸਾਓ ਟੋਮ ਅਤੇ ਪ੍ਰਿੰਸੀਪੇ"

        Cldr.SV ->
            "ਅਲ ਸਲਵਾਡੋਰ"

        Cldr.SX ->
            "ਸਿੰਟ ਮਾਰਟੀਨ"

        Cldr.SY ->
            "ਸੀਰੀਆ"

        Cldr.SZ ->
            "ਇਸਵਾਤੀਨੀ"

        Cldr.TC ->
            "ਟੁਰਕਸ ਅਤੇ ਕੈਕੋਸ ਟਾਪੂ"

        Cldr.TD ->
            "ਚਾਡ"

        Cldr.TF ->
            "ਫਰੈਂਚ ਦੱਖਣੀ ਪ੍ਰਦੇਸ਼"

        Cldr.TG ->
            "ਟੋਗੋ"

        Cldr.TH ->
            "ਥਾਈਲੈਂਡ"

        Cldr.TJ ->
            "ਤਾਜਿਕਿਸਤਾਨ"

        Cldr.TK ->
            "ਟੋਕੇਲਾਉ"

        Cldr.TL ->
            "ਪੂਰਬ ਤਿਮੋਰ"

        Cldr.TM ->
            "ਤੁਰਕਮੇਨਿਸਤਾਨ"

        Cldr.TN ->
            "ਟਿਊਨੀਸ਼ੀਆ"

        Cldr.TO ->
            "ਟੌਂਗਾ"

        Cldr.TR ->
            "ਤੁਰਕੀ"

        Cldr.TT ->
            "ਟ੍ਰਿਨੀਡਾਡ ਅਤੇ ਟੋਬਾਗੋ"

        Cldr.TV ->
            "ਟੁਵਾਲੂ"

        Cldr.TW ->
            "ਤਾਇਵਾਨ"

        Cldr.TZ ->
            "ਤਨਜ਼ਾਨੀਆ"

        Cldr.UA ->
            "ਯੂਕਰੇਨ"

        Cldr.UG ->
            "ਯੂਗਾਂਡਾ"

        Cldr.UM ->
            "ਯੂ.ਐੱਸ. ਦੂਰ-ਦੁਰਾਡੇ ਟਾਪੂ"

        Cldr.US ->
            "ਸੰਯੁਕਤ ਰਾਜ"

        Cldr.UY ->
            "ਉਰੂਗਵੇ"

        Cldr.UZ ->
            "ਉਜ਼ਬੇਕਿਸਤਾਨ"

        Cldr.VA ->
            "ਵੈਟੀਕਨ ਸਿਟੀ"

        Cldr.VC ->
            "ਸੇਂਟ ਵਿਨਸੈਂਟ ਐਂਡ ਗ੍ਰੇਨਾਡੀਨਸ"

        Cldr.VE ->
            "ਵੇਨੇਜ਼ੂਏਲਾ"

        Cldr.VG ->
            "ਬ੍ਰਿਟਿਸ਼ ਵਰਜਿਨ ਟਾਪੂ"

        Cldr.VI ->
            "ਯੂ ਐੱਸ ਵਰਜਿਨ ਟਾਪੂ"

        Cldr.VN ->
            "ਵੀਅਤਨਾਮ"

        Cldr.VU ->
            "ਵਾਨੂਆਟੂ"

        Cldr.WF ->
            "ਵਾਲਿਸ ਅਤੇ ਫੂਟੂਨਾ"

        Cldr.WS ->
            "ਸਾਮੋਆ"

        Cldr.XK ->
            "ਕੋਸੋਵੋ"

        Cldr.YE ->
            "ਯਮਨ"

        Cldr.YT ->
            "ਮਾਯੋਟੀ"

        Cldr.ZA ->
            "ਦੱਖਣੀ ਅਫਰੀਕਾ"

        Cldr.ZM ->
            "ਜ਼ਾਮਬੀਆ"

        Cldr.ZW ->
            "ਜ਼ਿੰਬਾਬਵੇ"