module Cldr.Serbian exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Serbian.

    AD Андора
    AE Уједињени Арапски Емирати
    AF Авганистан
    AG Антигва и Барбуда
    AI Ангвила
    AL Албанија
    AM Јерменија
    AO Ангола
    AQ Антарктик
    AR Аргентина
    AS Америчка Самоа
    AT Аустрија
    AU Аустралија
    AW Аруба
    AX Оландска Острва
    AZ Азербејџан
    BA Босна и Херцеговина
    BB Барбадос
    BD Бангладеш
    BE Белгија
    BF Буркина Фасо
    BG Бугарска
    BH Бахреин
    BI Бурунди
    BJ Бенин
    BL Свети Бартоломеј
    BM Бермуда
    BN Брунеј
    BO Боливија
    BQ Карипска Холандија
    BR Бразил
    BS Бахами
    BT Бутан
    BV Острво Буве
    BW Боцвана
    BY Белорусија
    BZ Белизе
    CA Канада
    CC Кокосова (Килингова) Острва
    CD Конго (ДРК)
    CF Централноафричка Република
    CG Конго (Република)
    CH Швајцарска
    CI Обала Слоноваче (Кот д’Ивоар)
    CK Кукова Острва
    CL Чиле
    CM Камерун
    CN Кина
    CO Колумбија
    CR Костарика
    CU Куба
    CV Зеленортска Острва
    CW Курасао
    CX Божићно Острво
    CY Кипар
    CZ Чешка Република
    DE Немачка
    DJ Џибути
    DK Данска
    DM Доминика
    DO Доминиканска Република
    DZ Алжир
    EC Еквадор
    EE Естонија
    EG Египат
    EH Западна Сахара
    ER Еритреја
    ES Шпанија
    ET Етиопија
    FI Финска
    FJ Фиџи
    FK Фокландска Острва
    FM Микронезија
    FO Фарска Острва
    FR Француска
    GA Габон
    GB Уједињено Краљевство
    GD Гренада
    GE Грузија
    GF Француска Гвајана
    GG Гернзи
    GH Гана
    GI Гибралтар
    GL Гренланд
    GM Гамбија
    GN Гвинеја
    GP Гваделуп
    GQ Екваторијална Гвинеја
    GR Грчка
    GS Јужна Џорџија и Јужна Сендвичка Острва
    GT Гватемала
    GU Гуам
    GW Гвинеја-Бисао
    GY Гвајана
    HK Хонгконг
    HM Острво Херд и Мекдоналдова острва
    HN Хондурас
    HR Хрватска
    HT Хаити
    HU Мађарска
    ID Индонезија
    IE Ирска
    IL Израел
    IM Острво Ман
    IN Индија
    IO Британска територија Индијског океана
    IQ Ирак
    IR Иран
    IS Исланд
    IT Италија
    JE Џерзи
    JM Јамајка
    JO Јордан
    JP Јапан
    KE Кенија
    KG Киргистан
    KH Камбоџа
    KI Кирибати
    KM Коморска Острва
    KN Сент Китс и Невис
    KP Северна Кореја
    KR Јужна Кореја
    KW Кувајт
    KY Кајманска Острва
    KZ Казахстан
    LA Лаос
    LB Либан
    LC Света Луција
    LI Лихтенштајн
    LK Шри Ланка
    LR Либерија
    LS Лесото
    LT Литванија
    LU Луксембург
    LV Летонија
    LY Либија
    MA Мароко
    MC Монако
    MD Молдавија
    ME Црна Гора
    MF Свети Мартин (Француска)
    MG Мадагаскар
    MH Маршалска Острва
    MK Северна Македонија
    ML Мали
    MM Мијанмар (Бурма)
    MN Монголија
    MO Макао
    MP Северна Маријанска Острва
    MQ Мартиник
    MR Мауританија
    MS Монсерат
    MT Малта
    MU Маурицијус
    MV Малдиви
    MW Малави
    MX Мексико
    MY Малезија
    MZ Мозамбик
    NA Намибија
    NC Нова Каледонија
    NE Нигер
    NF Острво Норфок
    NG Нигерија
    NI Никарагва
    NL Холандија
    NO Норвешка
    NP Непал
    NR Науру
    NU Ниуе
    NZ Нови Зеланд
    OM Оман
    PA Панама
    PE Перу
    PF Француска Полинезија
    PG Папуа Нова Гвинеја
    PH Филипини
    PK Пакистан
    PL Пољска
    PM Сен Пјер и Микелон
    PN Питкерн
    PR Порторико
    PS Палестина
    PT Португалија
    PW Палау
    PY Парагвај
    QA Катар
    RE Реинион
    RO Румунија
    RS Србија
    RU Русија
    RW Руанда
    SA Саудијска Арабија
    SB Соломонска Острва
    SC Сејшели
    SD Судан
    SE Шведска
    SG Сингапур
    SH Света Јелена
    SI Словенија
    SJ Свалбард и Јан Мајен
    SK Словачка
    SL Сијера Леоне
    SM Сан Марино
    SN Сенегал
    SO Сомалија
    SR Суринам
    SS Јужни Судан
    ST Сао Томе и Принципе
    SV Салвадор
    SX Свети Мартин (Холандија)
    SY Сирија
    SZ Свазиленд
    TC Острва Туркс и Каикос
    TD Чад
    TF Француске Јужне Територије
    TG Того
    TH Тајланд
    TJ Таџикистан
    TK Токелау
    TL Источни Тимор
    TM Туркменистан
    TN Тунис
    TO Тонга
    TR Турска
    TT Тринидад и Тобаго
    TV Тувалу
    TW Тајван
    TZ Танзанија
    UA Украјина
    UG Уганда
    UM Удаљена острва САД
    US Сједињене Државе
    UY Уругвај
    UZ Узбекистан
    VA Ватикан
    VC Сент Винсент и Гренадини
    VE Венецуела
    VG Британска Девичанска Острва
    VI Америчка Девичанска Острва
    VN Вијетнам
    VU Вануату
    WF Валис и Футуна
    WS Самоа
    XK Косово
    YE Јемен
    YT Мајот
    ZA Јужноафричка Република
    ZM Замбија
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Андора"

        Cldr.AE ->
            "Уједињени Арапски Емирати"

        Cldr.AF ->
            "Авганистан"

        Cldr.AG ->
            "Антигва и Барбуда"

        Cldr.AI ->
            "Ангвила"

        Cldr.AL ->
            "Албанија"

        Cldr.AM ->
            "Јерменија"

        Cldr.AO ->
            "Ангола"

        Cldr.AQ ->
            "Антарктик"

        Cldr.AR ->
            "Аргентина"

        Cldr.AS ->
            "Америчка Самоа"

        Cldr.AT ->
            "Аустрија"

        Cldr.AU ->
            "Аустралија"

        Cldr.AW ->
            "Аруба"

        Cldr.AX ->
            "Оландска Острва"

        Cldr.AZ ->
            "Азербејџан"

        Cldr.BA ->
            "Босна и Херцеговина"

        Cldr.BB ->
            "Барбадос"

        Cldr.BD ->
            "Бангладеш"

        Cldr.BE ->
            "Белгија"

        Cldr.BF ->
            "Буркина Фасо"

        Cldr.BG ->
            "Бугарска"

        Cldr.BH ->
            "Бахреин"

        Cldr.BI ->
            "Бурунди"

        Cldr.BJ ->
            "Бенин"

        Cldr.BL ->
            "Свети Бартоломеј"

        Cldr.BM ->
            "Бермуда"

        Cldr.BN ->
            "Брунеј"

        Cldr.BO ->
            "Боливија"

        Cldr.BQ ->
            "Карипска Холандија"

        Cldr.BR ->
            "Бразил"

        Cldr.BS ->
            "Бахами"

        Cldr.BT ->
            "Бутан"

        Cldr.BV ->
            "Острво Буве"

        Cldr.BW ->
            "Боцвана"

        Cldr.BY ->
            "Белорусија"

        Cldr.BZ ->
            "Белизе"

        Cldr.CA ->
            "Канада"

        Cldr.CC ->
            "Кокосова (Килингова) Острва"

        Cldr.CD ->
            "Конго (ДРК)"

        Cldr.CF ->
            "Централноафричка Република"

        Cldr.CG ->
            "Конго (Република)"

        Cldr.CH ->
            "Швајцарска"

        Cldr.CI ->
            "Обала Слоноваче (Кот д’Ивоар)"

        Cldr.CK ->
            "Кукова Острва"

        Cldr.CL ->
            "Чиле"

        Cldr.CM ->
            "Камерун"

        Cldr.CN ->
            "Кина"

        Cldr.CO ->
            "Колумбија"

        Cldr.CR ->
            "Костарика"

        Cldr.CU ->
            "Куба"

        Cldr.CV ->
            "Зеленортска Острва"

        Cldr.CW ->
            "Курасао"

        Cldr.CX ->
            "Божићно Острво"

        Cldr.CY ->
            "Кипар"

        Cldr.CZ ->
            "Чешка Република"

        Cldr.DE ->
            "Немачка"

        Cldr.DJ ->
            "Џибути"

        Cldr.DK ->
            "Данска"

        Cldr.DM ->
            "Доминика"

        Cldr.DO ->
            "Доминиканска Република"

        Cldr.DZ ->
            "Алжир"

        Cldr.EC ->
            "Еквадор"

        Cldr.EE ->
            "Естонија"

        Cldr.EG ->
            "Египат"

        Cldr.EH ->
            "Западна Сахара"

        Cldr.ER ->
            "Еритреја"

        Cldr.ES ->
            "Шпанија"

        Cldr.ET ->
            "Етиопија"

        Cldr.FI ->
            "Финска"

        Cldr.FJ ->
            "Фиџи"

        Cldr.FK ->
            "Фокландска Острва"

        Cldr.FM ->
            "Микронезија"

        Cldr.FO ->
            "Фарска Острва"

        Cldr.FR ->
            "Француска"

        Cldr.GA ->
            "Габон"

        Cldr.GB ->
            "Уједињено Краљевство"

        Cldr.GD ->
            "Гренада"

        Cldr.GE ->
            "Грузија"

        Cldr.GF ->
            "Француска Гвајана"

        Cldr.GG ->
            "Гернзи"

        Cldr.GH ->
            "Гана"

        Cldr.GI ->
            "Гибралтар"

        Cldr.GL ->
            "Гренланд"

        Cldr.GM ->
            "Гамбија"

        Cldr.GN ->
            "Гвинеја"

        Cldr.GP ->
            "Гваделуп"

        Cldr.GQ ->
            "Екваторијална Гвинеја"

        Cldr.GR ->
            "Грчка"

        Cldr.GS ->
            "Јужна Џорџија и Јужна Сендвичка Острва"

        Cldr.GT_ ->
            "Гватемала"

        Cldr.GU ->
            "Гуам"

        Cldr.GW ->
            "Гвинеја-Бисао"

        Cldr.GY ->
            "Гвајана"

        Cldr.HK ->
            "Хонгконг"

        Cldr.HM ->
            "Острво Херд и Мекдоналдова острва"

        Cldr.HN ->
            "Хондурас"

        Cldr.HR ->
            "Хрватска"

        Cldr.HT ->
            "Хаити"

        Cldr.HU ->
            "Мађарска"

        Cldr.ID ->
            "Индонезија"

        Cldr.IE ->
            "Ирска"

        Cldr.IL ->
            "Израел"

        Cldr.IM ->
            "Острво Ман"

        Cldr.IN ->
            "Индија"

        Cldr.IO ->
            "Британска територија Индијског океана"

        Cldr.IQ ->
            "Ирак"

        Cldr.IR ->
            "Иран"

        Cldr.IS ->
            "Исланд"

        Cldr.IT ->
            "Италија"

        Cldr.JE ->
            "Џерзи"

        Cldr.JM ->
            "Јамајка"

        Cldr.JO ->
            "Јордан"

        Cldr.JP ->
            "Јапан"

        Cldr.KE ->
            "Кенија"

        Cldr.KG ->
            "Киргистан"

        Cldr.KH ->
            "Камбоџа"

        Cldr.KI ->
            "Кирибати"

        Cldr.KM ->
            "Коморска Острва"

        Cldr.KN ->
            "Сент Китс и Невис"

        Cldr.KP ->
            "Северна Кореја"

        Cldr.KR ->
            "Јужна Кореја"

        Cldr.KW ->
            "Кувајт"

        Cldr.KY ->
            "Кајманска Острва"

        Cldr.KZ ->
            "Казахстан"

        Cldr.LA ->
            "Лаос"

        Cldr.LB ->
            "Либан"

        Cldr.LC ->
            "Света Луција"

        Cldr.LI ->
            "Лихтенштајн"

        Cldr.LK ->
            "Шри Ланка"

        Cldr.LR ->
            "Либерија"

        Cldr.LS ->
            "Лесото"

        Cldr.LT_ ->
            "Литванија"

        Cldr.LU ->
            "Луксембург"

        Cldr.LV ->
            "Летонија"

        Cldr.LY ->
            "Либија"

        Cldr.MA ->
            "Мароко"

        Cldr.MC ->
            "Монако"

        Cldr.MD ->
            "Молдавија"

        Cldr.ME ->
            "Црна Гора"

        Cldr.MF ->
            "Свети Мартин (Француска)"

        Cldr.MG ->
            "Мадагаскар"

        Cldr.MH ->
            "Маршалска Острва"

        Cldr.MK ->
            "Северна Македонија"

        Cldr.ML ->
            "Мали"

        Cldr.MM ->
            "Мијанмар (Бурма)"

        Cldr.MN ->
            "Монголија"

        Cldr.MO ->
            "Макао"

        Cldr.MP ->
            "Северна Маријанска Острва"

        Cldr.MQ ->
            "Мартиник"

        Cldr.MR ->
            "Мауританија"

        Cldr.MS ->
            "Монсерат"

        Cldr.MT ->
            "Малта"

        Cldr.MU ->
            "Маурицијус"

        Cldr.MV ->
            "Малдиви"

        Cldr.MW ->
            "Малави"

        Cldr.MX ->
            "Мексико"

        Cldr.MY ->
            "Малезија"

        Cldr.MZ ->
            "Мозамбик"

        Cldr.NA ->
            "Намибија"

        Cldr.NC ->
            "Нова Каледонија"

        Cldr.NE ->
            "Нигер"

        Cldr.NF ->
            "Острво Норфок"

        Cldr.NG ->
            "Нигерија"

        Cldr.NI ->
            "Никарагва"

        Cldr.NL ->
            "Холандија"

        Cldr.NO ->
            "Норвешка"

        Cldr.NP ->
            "Непал"

        Cldr.NR ->
            "Науру"

        Cldr.NU ->
            "Ниуе"

        Cldr.NZ ->
            "Нови Зеланд"

        Cldr.OM ->
            "Оман"

        Cldr.PA ->
            "Панама"

        Cldr.PE ->
            "Перу"

        Cldr.PF ->
            "Француска Полинезија"

        Cldr.PG ->
            "Папуа Нова Гвинеја"

        Cldr.PH ->
            "Филипини"

        Cldr.PK ->
            "Пакистан"

        Cldr.PL ->
            "Пољска"

        Cldr.PM ->
            "Сен Пјер и Микелон"

        Cldr.PN ->
            "Питкерн"

        Cldr.PR ->
            "Порторико"

        Cldr.PS ->
            "Палестина"

        Cldr.PT ->
            "Португалија"

        Cldr.PW ->
            "Палау"

        Cldr.PY ->
            "Парагвај"

        Cldr.QA ->
            "Катар"

        Cldr.RE ->
            "Реинион"

        Cldr.RO ->
            "Румунија"

        Cldr.RS ->
            "Србија"

        Cldr.RU ->
            "Русија"

        Cldr.RW ->
            "Руанда"

        Cldr.SA ->
            "Саудијска Арабија"

        Cldr.SB ->
            "Соломонска Острва"

        Cldr.SC ->
            "Сејшели"

        Cldr.SD ->
            "Судан"

        Cldr.SE ->
            "Шведска"

        Cldr.SG ->
            "Сингапур"

        Cldr.SH ->
            "Света Јелена"

        Cldr.SI ->
            "Словенија"

        Cldr.SJ ->
            "Свалбард и Јан Мајен"

        Cldr.SK ->
            "Словачка"

        Cldr.SL ->
            "Сијера Леоне"

        Cldr.SM ->
            "Сан Марино"

        Cldr.SN ->
            "Сенегал"

        Cldr.SO ->
            "Сомалија"

        Cldr.SR ->
            "Суринам"

        Cldr.SS ->
            "Јужни Судан"

        Cldr.ST ->
            "Сао Томе и Принципе"

        Cldr.SV ->
            "Салвадор"

        Cldr.SX ->
            "Свети Мартин (Холандија)"

        Cldr.SY ->
            "Сирија"

        Cldr.SZ ->
            "Свазиленд"

        Cldr.TC ->
            "Острва Туркс и Каикос"

        Cldr.TD ->
            "Чад"

        Cldr.TF ->
            "Француске Јужне Територије"

        Cldr.TG ->
            "Того"

        Cldr.TH ->
            "Тајланд"

        Cldr.TJ ->
            "Таџикистан"

        Cldr.TK ->
            "Токелау"

        Cldr.TL ->
            "Источни Тимор"

        Cldr.TM ->
            "Туркменистан"

        Cldr.TN ->
            "Тунис"

        Cldr.TO ->
            "Тонга"

        Cldr.TR ->
            "Турска"

        Cldr.TT ->
            "Тринидад и Тобаго"

        Cldr.TV ->
            "Тувалу"

        Cldr.TW ->
            "Тајван"

        Cldr.TZ ->
            "Танзанија"

        Cldr.UA ->
            "Украјина"

        Cldr.UG ->
            "Уганда"

        Cldr.UM ->
            "Удаљена острва САД"

        Cldr.US ->
            "Сједињене Државе"

        Cldr.UY ->
            "Уругвај"

        Cldr.UZ ->
            "Узбекистан"

        Cldr.VA ->
            "Ватикан"

        Cldr.VC ->
            "Сент Винсент и Гренадини"

        Cldr.VE ->
            "Венецуела"

        Cldr.VG ->
            "Британска Девичанска Острва"

        Cldr.VI ->
            "Америчка Девичанска Острва"

        Cldr.VN ->
            "Вијетнам"

        Cldr.VU ->
            "Вануату"

        Cldr.WF ->
            "Валис и Футуна"

        Cldr.WS ->
            "Самоа"

        Cldr.XK ->
            "Косово"

        Cldr.YE ->
            "Јемен"

        Cldr.YT ->
            "Мајот"

        Cldr.ZA ->
            "Јужноафричка Република"

        Cldr.ZM ->
            "Замбија"

        Cldr.ZW ->
            "Зимбабве"