module Cldr.Sindhi exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Sindhi.

    AD اندورا
    AE متحده عرب امارات
    AF افغانستان
    AG انٽيگا ۽ باربد
    AI انگويلا
    AL البانيا
    AM ارمینیا
    AO انگولا
    AQ انٽارڪٽيڪا
    AR ارجنٽينا
    AS آمريڪي ساموا
    AT آسٽريا
    AU آسٽريليا
    AW عروبا
    AX الند ٻيٽ
    AZ آذربائيجان
    BA بوسنيا ۽ هرزوگووينا
    BB باربڊوس
    BD بنگلاديش
    BE بيلجيم
    BF برڪينا فاسو
    BG بلغاريا
    BH بحرين
    BI برونڊي
    BJ بينن
    BL سینٽ برٿلیمی
    BM برمودا
    BN برونائي
    BO بوليويا
    BQ ڪيريبين نيدرلينڊ
    BR برازيل
    BS باهاماس
    BT ڀوٽان
    BV بووٽ ٻيٽ
    BW بوٽسوانا
    BY بیلارس
    BZ بيليز
    CA ڪينيڊا
    CC ڪوڪوس ٻيٽ
    CD ڪانگو -ڪنشاسا
    CF وچ آفريقي جمهوريه
    CG ڪانگو - برازاویل
    CH سوئزرلينڊ
    CI ڪوٽي ويرا
    CK ڪوڪ ٻيٽ
    CL چلي
    CM ڪيمرون
    CN چين
    CO ڪولمبيا
    CR ڪوسٽا ريڪا
    CU ڪيوبا
    CV ڪيپ وردي
    CW ڪيوراسائو
    CX ڪرسمس ٻيٽ
    CY سائپرس
    CZ چيڪيا
    DE جرمني
    DJ ڊجبيوتي
    DK ڊينمارڪ
    DM ڊومينيڪا
    DO ڊومينيڪن جمهوريه
    DZ الجيريا
    EC ايڪواڊور
    EE ايسٽونيا
    EG مصر
    EH اولهه صحارا
    ER ايريٽيريا
    ES اسپين
    ET ايٿوپيا
    FI فن لينڊ
    FJ فجي
    FK فاڪ لينڊ ٻيٽ
    FM مائڪرونيشيا
    FO فارو ٻيٽ
    FR فرانس
    GA گبون
    GB برطانيہ
    GD گرينڊا
    GE جارجيا
    GF فرانسيسي گيانا
    GG گورنسي
    GH گهانا
    GI جبرالٽر
    GL گرين لينڊ
    GM گيمبيا
    GN گني
    GP گواڊیلوپ
    GQ ايڪوٽوريل گائينا
    GR يونان
    GS ڏکڻ جارجيا ۽ ڏکڻ سينڊوچ ٻيٽ
    GT گوئٽي مالا
    GU گوام
    GW گني بسائو
    GY گيانا
    HK هانگ ڪانگ SAR
    HM هرڊ ۽ مڪڊونلڊ ٻيٽ
    HN هنڊورس
    HR ڪروئيشيا
    HT هيٽي
    HU هنگري
    ID انڊونيشيا
    IE آئرلينڊ
    IL اسرائيل
    IM انسانن جو ٻيٽ
    IN ڀارت
    IO برطانوي هندي سمنڊ خطو
    IQ عراق
    IR ايران
    IS آئس لينڊ
    IT اٽلي
    JE جرسي
    JM جميڪا
    JO اردن
    JP جاپان
    KE ڪينيا
    KG ڪرغستان
    KH ڪمبوڊيا
    KI ڪرباتي
    KM ڪوموروس
    KN سينٽ ڪٽس و نيوس
    KP اتر ڪوريا
    KR ڏکڻ ڪوريا
    KW ڪويت
    KY ڪي مين ٻيٽ
    KZ قازقستان
    LA لائوس
    LB لبنان
    LC سينٽ لوسيا
    LI لچي ٽينسٽين
    LK سري لنڪا
    LR لائبیریا
    LS ليسوٿو
    LT لٿونيا
    LU لگزمبرگ
    LV لاتويا
    LY لبيا
    MA مراڪش
    MC موناڪو
    MD مالدووا
    ME مونٽي نيگرو
    MF سينٽ مارٽن
    MG مدگاسڪر
    MH مارشل ٻيٽ
    MK اتر مقدونيا
    ML مالي
    MM ميانمار (برما)
    MN منگوليا
    MO مڪائو SAR چين
    MP اتريان ماريانا ٻيٽ
    MQ مارتينڪ
    MR موريتانيا
    MS مونٽسراٽ
    MT مالٽا
    MU موريشس
    MV مالديپ
    MW مالاوي
    MX ميڪسيڪو
    MY ملائيشيا
    MZ موزمبیق
    NA نيميبيا
    NC نیو ڪالیڊونیا
    NE نائيجر
    NF نورفوڪ ٻيٽ
    NG نائيجيريا
    NI نڪراگوا
    NL نيدرلينڊ
    NO ناروي
    NP نيپال
    NR نائورو
    NU نووي
    NZ نيو زيلينڊ
    OM عمان
    PA پناما
    PE پيرو
    PF فرانسيسي پولينيشيا
    PG پاپوا نیو گني
    PH فلپائن
    PK پاڪستان
    PL پولينڊ
    PM سینٽ پیئر و میڪوئیلون
    PN پٽڪئرن ٻيٽ
    PR پيوئرٽو ريڪو
    PS فلسطيني علائقا
    PT پرتگال
    PW پلائو
    PY پيراگوءِ
    QA قطر
    RE ري يونين
    RO رومانيا
    RS سربيا
    RU روس
    RW روانڊا
    SA سعودي عرب
    SB سولومون ٻيٽَ
    SC شي شلز
    SD سوڊان
    SE سوئيڊن
    SG سنگاپور
    SH سينٽ ھيلينا
    SI سلوینیا
    SJ سوالبارڊ ۽ جان ماین
    SK سلوواڪيا
    SL سيرا ليون
    SM سین مرینو
    SN سينيگال
    SO سوماليا
    SR سورينام
    SS ڏکڻ سوڊان
    ST سائو ٽوم ۽ پرنسپیي
    SV ال سلواڊور
    SX سنٽ مارٽن
    SY شام
    SZ ايسواٽني
    TC ترڪ ۽ ڪيڪوس ٻيٽ
    TD چاڊ
    TF فرانسيسي ڏاکڻي علائقا
    TG ٽوگو
    TH ٿائيليند
    TJ تاجڪستان
    TK ٽوڪلائو
    TL تيمور ليستي
    TM ترڪمانستان
    TN تيونيسيا
    TO ٽونگا
    TR ترڪييي
    TT ٽريني ڊيڊ ۽ ٽوباگو ٻيٽ
    TV توالو
    TW تائیوان
    TZ تنزانيا
    UA يوڪرين
    UG يوگنڊا
    UM آمريڪي خارجي ٻيٽ
    US آمريڪا جون گڏيل رياستون
    UY يوروگوءِ
    UZ ازبڪستان
    VA ويٽڪين سٽي
    VC سینٽ ونسنت ۽ گریناڊینز
    VE وينزويلا
    VG برطانوي ورجن ٻيٽ
    VI آمريڪي ورجن ٻيٽ
    VN ويتنام
    VU وينيٽيو
    WF والس ۽ فتونا
    WS ساموا
    XK ڪوسووو
    YE يمن
    YT مياتي
    ZA ڏکڻ آفريقا
    ZM زيمبيا
    ZW زمبابوي
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "اندورا"

        Cldr.AE ->
            "متحده عرب امارات"

        Cldr.AF ->
            "افغانستان"

        Cldr.AG ->
            "انٽيگا ۽ باربد"

        Cldr.AI ->
            "انگويلا"

        Cldr.AL ->
            "البانيا"

        Cldr.AM ->
            "ارمینیا"

        Cldr.AO ->
            "انگولا"

        Cldr.AQ ->
            "انٽارڪٽيڪا"

        Cldr.AR ->
            "ارجنٽينا"

        Cldr.AS ->
            "آمريڪي ساموا"

        Cldr.AT ->
            "آسٽريا"

        Cldr.AU ->
            "آسٽريليا"

        Cldr.AW ->
            "عروبا"

        Cldr.AX ->
            "الند ٻيٽ"

        Cldr.AZ ->
            "آذربائيجان"

        Cldr.BA ->
            "بوسنيا ۽ هرزوگووينا"

        Cldr.BB ->
            "باربڊوس"

        Cldr.BD ->
            "بنگلاديش"

        Cldr.BE ->
            "بيلجيم"

        Cldr.BF ->
            "برڪينا فاسو"

        Cldr.BG ->
            "بلغاريا"

        Cldr.BH ->
            "بحرين"

        Cldr.BI ->
            "برونڊي"

        Cldr.BJ ->
            "بينن"

        Cldr.BL ->
            "سینٽ برٿلیمی"

        Cldr.BM ->
            "برمودا"

        Cldr.BN ->
            "برونائي"

        Cldr.BO ->
            "بوليويا"

        Cldr.BQ ->
            "ڪيريبين نيدرلينڊ"

        Cldr.BR ->
            "برازيل"

        Cldr.BS ->
            "باهاماس"

        Cldr.BT ->
            "ڀوٽان"

        Cldr.BV ->
            "بووٽ ٻيٽ"

        Cldr.BW ->
            "بوٽسوانا"

        Cldr.BY ->
            "بیلارس"

        Cldr.BZ ->
            "بيليز"

        Cldr.CA ->
            "ڪينيڊا"

        Cldr.CC ->
            "ڪوڪوس ٻيٽ"

        Cldr.CD ->
            "ڪانگو -ڪنشاسا"

        Cldr.CF ->
            "وچ آفريقي جمهوريه"

        Cldr.CG ->
            "ڪانگو - برازاویل"

        Cldr.CH ->
            "سوئزرلينڊ"

        Cldr.CI ->
            "ڪوٽي ويرا"

        Cldr.CK ->
            "ڪوڪ ٻيٽ"

        Cldr.CL ->
            "چلي"

        Cldr.CM ->
            "ڪيمرون"

        Cldr.CN ->
            "چين"

        Cldr.CO ->
            "ڪولمبيا"

        Cldr.CR ->
            "ڪوسٽا ريڪا"

        Cldr.CU ->
            "ڪيوبا"

        Cldr.CV ->
            "ڪيپ وردي"

        Cldr.CW ->
            "ڪيوراسائو"

        Cldr.CX ->
            "ڪرسمس ٻيٽ"

        Cldr.CY ->
            "سائپرس"

        Cldr.CZ ->
            "چيڪيا"

        Cldr.DE ->
            "جرمني"

        Cldr.DJ ->
            "ڊجبيوتي"

        Cldr.DK ->
            "ڊينمارڪ"

        Cldr.DM ->
            "ڊومينيڪا"

        Cldr.DO ->
            "ڊومينيڪن جمهوريه"

        Cldr.DZ ->
            "الجيريا"

        Cldr.EC ->
            "ايڪواڊور"

        Cldr.EE ->
            "ايسٽونيا"

        Cldr.EG ->
            "مصر"

        Cldr.EH ->
            "اولهه صحارا"

        Cldr.ER ->
            "ايريٽيريا"

        Cldr.ES ->
            "اسپين"

        Cldr.ET ->
            "ايٿوپيا"

        Cldr.FI ->
            "فن لينڊ"

        Cldr.FJ ->
            "فجي"

        Cldr.FK ->
            "فاڪ لينڊ ٻيٽ"

        Cldr.FM ->
            "مائڪرونيشيا"

        Cldr.FO ->
            "فارو ٻيٽ"

        Cldr.FR ->
            "فرانس"

        Cldr.GA ->
            "گبون"

        Cldr.GB ->
            "برطانيہ"

        Cldr.GD ->
            "گرينڊا"

        Cldr.GE ->
            "جارجيا"

        Cldr.GF ->
            "فرانسيسي گيانا"

        Cldr.GG ->
            "گورنسي"

        Cldr.GH ->
            "گهانا"

        Cldr.GI ->
            "جبرالٽر"

        Cldr.GL ->
            "گرين لينڊ"

        Cldr.GM ->
            "گيمبيا"

        Cldr.GN ->
            "گني"

        Cldr.GP ->
            "گواڊیلوپ"

        Cldr.GQ ->
            "ايڪوٽوريل گائينا"

        Cldr.GR ->
            "يونان"

        Cldr.GS ->
            "ڏکڻ جارجيا ۽ ڏکڻ سينڊوچ ٻيٽ"

        Cldr.GT_ ->
            "گوئٽي مالا"

        Cldr.GU ->
            "گوام"

        Cldr.GW ->
            "گني بسائو"

        Cldr.GY ->
            "گيانا"

        Cldr.HK ->
            "هانگ ڪانگ SAR"

        Cldr.HM ->
            "هرڊ ۽ مڪڊونلڊ ٻيٽ"

        Cldr.HN ->
            "هنڊورس"

        Cldr.HR ->
            "ڪروئيشيا"

        Cldr.HT ->
            "هيٽي"

        Cldr.HU ->
            "هنگري"

        Cldr.ID ->
            "انڊونيشيا"

        Cldr.IE ->
            "آئرلينڊ"

        Cldr.IL ->
            "اسرائيل"

        Cldr.IM ->
            "انسانن جو ٻيٽ"

        Cldr.IN ->
            "ڀارت"

        Cldr.IO ->
            "برطانوي هندي سمنڊ خطو"

        Cldr.IQ ->
            "عراق"

        Cldr.IR ->
            "ايران"

        Cldr.IS ->
            "آئس لينڊ"

        Cldr.IT ->
            "اٽلي"

        Cldr.JE ->
            "جرسي"

        Cldr.JM ->
            "جميڪا"

        Cldr.JO ->
            "اردن"

        Cldr.JP ->
            "جاپان"

        Cldr.KE ->
            "ڪينيا"

        Cldr.KG ->
            "ڪرغستان"

        Cldr.KH ->
            "ڪمبوڊيا"

        Cldr.KI ->
            "ڪرباتي"

        Cldr.KM ->
            "ڪوموروس"

        Cldr.KN ->
            "سينٽ ڪٽس و نيوس"

        Cldr.KP ->
            "اتر ڪوريا"

        Cldr.KR ->
            "ڏکڻ ڪوريا"

        Cldr.KW ->
            "ڪويت"

        Cldr.KY ->
            "ڪي مين ٻيٽ"

        Cldr.KZ ->
            "قازقستان"

        Cldr.LA ->
            "لائوس"

        Cldr.LB ->
            "لبنان"

        Cldr.LC ->
            "سينٽ لوسيا"

        Cldr.LI ->
            "لچي ٽينسٽين"

        Cldr.LK ->
            "سري لنڪا"

        Cldr.LR ->
            "لائبیریا"

        Cldr.LS ->
            "ليسوٿو"

        Cldr.LT_ ->
            "لٿونيا"

        Cldr.LU ->
            "لگزمبرگ"

        Cldr.LV ->
            "لاتويا"

        Cldr.LY ->
            "لبيا"

        Cldr.MA ->
            "مراڪش"

        Cldr.MC ->
            "موناڪو"

        Cldr.MD ->
            "مالدووا"

        Cldr.ME ->
            "مونٽي نيگرو"

        Cldr.MF ->
            "سينٽ مارٽن"

        Cldr.MG ->
            "مدگاسڪر"

        Cldr.MH ->
            "مارشل ٻيٽ"

        Cldr.MK ->
            "اتر مقدونيا"

        Cldr.ML ->
            "مالي"

        Cldr.MM ->
            "ميانمار (برما)"

        Cldr.MN ->
            "منگوليا"

        Cldr.MO ->
            "مڪائو SAR چين"

        Cldr.MP ->
            "اتريان ماريانا ٻيٽ"

        Cldr.MQ ->
            "مارتينڪ"

        Cldr.MR ->
            "موريتانيا"

        Cldr.MS ->
            "مونٽسراٽ"

        Cldr.MT ->
            "مالٽا"

        Cldr.MU ->
            "موريشس"

        Cldr.MV ->
            "مالديپ"

        Cldr.MW ->
            "مالاوي"

        Cldr.MX ->
            "ميڪسيڪو"

        Cldr.MY ->
            "ملائيشيا"

        Cldr.MZ ->
            "موزمبیق"

        Cldr.NA ->
            "نيميبيا"

        Cldr.NC ->
            "نیو ڪالیڊونیا"

        Cldr.NE ->
            "نائيجر"

        Cldr.NF ->
            "نورفوڪ ٻيٽ"

        Cldr.NG ->
            "نائيجيريا"

        Cldr.NI ->
            "نڪراگوا"

        Cldr.NL ->
            "نيدرلينڊ"

        Cldr.NO ->
            "ناروي"

        Cldr.NP ->
            "نيپال"

        Cldr.NR ->
            "نائورو"

        Cldr.NU ->
            "نووي"

        Cldr.NZ ->
            "نيو زيلينڊ"

        Cldr.OM ->
            "عمان"

        Cldr.PA ->
            "پناما"

        Cldr.PE ->
            "پيرو"

        Cldr.PF ->
            "فرانسيسي پولينيشيا"

        Cldr.PG ->
            "پاپوا نیو گني"

        Cldr.PH ->
            "فلپائن"

        Cldr.PK ->
            "پاڪستان"

        Cldr.PL ->
            "پولينڊ"

        Cldr.PM ->
            "سینٽ پیئر و میڪوئیلون"

        Cldr.PN ->
            "پٽڪئرن ٻيٽ"

        Cldr.PR ->
            "پيوئرٽو ريڪو"

        Cldr.PS ->
            "فلسطيني علائقا"

        Cldr.PT ->
            "پرتگال"

        Cldr.PW ->
            "پلائو"

        Cldr.PY ->
            "پيراگوءِ"

        Cldr.QA ->
            "قطر"

        Cldr.RE ->
            "ري يونين"

        Cldr.RO ->
            "رومانيا"

        Cldr.RS ->
            "سربيا"

        Cldr.RU ->
            "روس"

        Cldr.RW ->
            "روانڊا"

        Cldr.SA ->
            "سعودي عرب"

        Cldr.SB ->
            "سولومون ٻيٽَ"

        Cldr.SC ->
            "شي شلز"

        Cldr.SD ->
            "سوڊان"

        Cldr.SE ->
            "سوئيڊن"

        Cldr.SG ->
            "سنگاپور"

        Cldr.SH ->
            "سينٽ ھيلينا"

        Cldr.SI ->
            "سلوینیا"

        Cldr.SJ ->
            "سوالبارڊ ۽ جان ماین"

        Cldr.SK ->
            "سلوواڪيا"

        Cldr.SL ->
            "سيرا ليون"

        Cldr.SM ->
            "سین مرینو"

        Cldr.SN ->
            "سينيگال"

        Cldr.SO ->
            "سوماليا"

        Cldr.SR ->
            "سورينام"

        Cldr.SS ->
            "ڏکڻ سوڊان"

        Cldr.ST ->
            "سائو ٽوم ۽ پرنسپیي"

        Cldr.SV ->
            "ال سلواڊور"

        Cldr.SX ->
            "سنٽ مارٽن"

        Cldr.SY ->
            "شام"

        Cldr.SZ ->
            "ايسواٽني"

        Cldr.TC ->
            "ترڪ ۽ ڪيڪوس ٻيٽ"

        Cldr.TD ->
            "چاڊ"

        Cldr.TF ->
            "فرانسيسي ڏاکڻي علائقا"

        Cldr.TG ->
            "ٽوگو"

        Cldr.TH ->
            "ٿائيليند"

        Cldr.TJ ->
            "تاجڪستان"

        Cldr.TK ->
            "ٽوڪلائو"

        Cldr.TL ->
            "تيمور ليستي"

        Cldr.TM ->
            "ترڪمانستان"

        Cldr.TN ->
            "تيونيسيا"

        Cldr.TO ->
            "ٽونگا"

        Cldr.TR ->
            "ترڪييي"

        Cldr.TT ->
            "ٽريني ڊيڊ ۽ ٽوباگو ٻيٽ"

        Cldr.TV ->
            "توالو"

        Cldr.TW ->
            "تائیوان"

        Cldr.TZ ->
            "تنزانيا"

        Cldr.UA ->
            "يوڪرين"

        Cldr.UG ->
            "يوگنڊا"

        Cldr.UM ->
            "آمريڪي خارجي ٻيٽ"

        Cldr.US ->
            "آمريڪا جون گڏيل رياستون"

        Cldr.UY ->
            "يوروگوءِ"

        Cldr.UZ ->
            "ازبڪستان"

        Cldr.VA ->
            "ويٽڪين سٽي"

        Cldr.VC ->
            "سینٽ ونسنت ۽ گریناڊینز"

        Cldr.VE ->
            "وينزويلا"

        Cldr.VG ->
            "برطانوي ورجن ٻيٽ"

        Cldr.VI ->
            "آمريڪي ورجن ٻيٽ"

        Cldr.VN ->
            "ويتنام"

        Cldr.VU ->
            "وينيٽيو"

        Cldr.WF ->
            "والس ۽ فتونا"

        Cldr.WS ->
            "ساموا"

        Cldr.XK ->
            "ڪوسووو"

        Cldr.YE ->
            "يمن"

        Cldr.YT ->
            "مياتي"

        Cldr.ZA ->
            "ڏکڻ آفريقا"

        Cldr.ZM ->
            "زيمبيا"

        Cldr.ZW ->
            "زمبابوي"