module Cldr.Tamil exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "அன்டோரா"

        Cldr.AE ->
            "ஐக்கிய அரபு எமிரேட்ஸ்"

        Cldr.AF ->
            "ஆஃப்கானிஸ்தான்"

        Cldr.AG ->
            "ஆண்டிகுவா மற்றும் பார்புடா"

        Cldr.AI ->
            "அங்கியுலா"

        Cldr.AL ->
            "அல்பேனியா"

        Cldr.AM ->
            "அர்மேனியா"

        Cldr.AO ->
            "அங்கோலா"

        Cldr.AQ ->
            "அண்டார்டிகா"

        Cldr.AR ->
            "அர்ஜென்டினா"

        Cldr.AS ->
            "அமெரிக்க சமோவா"

        Cldr.AT ->
            "ஆஸ்திரியா"

        Cldr.AU ->
            "ஆஸ்திரேலியா"

        Cldr.AW ->
            "அரூபா"

        Cldr.AX ->
            "ஆலந்து தீவுகள்"

        Cldr.AZ ->
            "அசர்பைஜான்"

        Cldr.BA ->
            "போஸ்னியா & ஹெர்ஸகோவினா"

        Cldr.BB ->
            "பார்படாஸ்"

        Cldr.BD ->
            "பங்களாதேஷ்"

        Cldr.BE ->
            "பெல்ஜியம்"

        Cldr.BF ->
            "புர்கினா ஃபாஸோ"

        Cldr.BG ->
            "பல்கேரியா"

        Cldr.BH ->
            "பஹ்ரைன்"

        Cldr.BI ->
            "புருண்டி"

        Cldr.BJ ->
            "பெனின்"

        Cldr.BL ->
            "செயின்ட் பார்தேலெமி"

        Cldr.BM ->
            "பெர்முடா"

        Cldr.BN ->
            "புருனே"

        Cldr.BO ->
            "பொலிவியா"

        Cldr.BQ ->
            "கரீபியன் நெதர்லாந்து"

        Cldr.BR ->
            "பிரேசில்"

        Cldr.BS ->
            "பஹாமாஸ்"

        Cldr.BT ->
            "பூடான்"

        Cldr.BV ->
            "பொவேட் தீவு"

        Cldr.BW ->
            "போட்ஸ்வானா"

        Cldr.BY ->
            "பெலாரஸ்"

        Cldr.BZ ->
            "பெலிஸ்"

        Cldr.CA ->
            "கனடா"

        Cldr.CC ->
            "கோகோஸ் (கீலிங்) தீவுகள்"

        Cldr.CD ->
            "காங்கோ - கின்ஷாசா"

        Cldr.CF ->
            "மத்திய ஆப்ரிக்கக் குடியரசு"

        Cldr.CG ->
            "காங்கோ - ப்ராஸாவில்லே"

        Cldr.CH ->
            "ஸ்விட்சர்லாந்து"

        Cldr.CI ->
            "கோட் தி’வாயர்"

        Cldr.CK ->
            "குக் தீவுகள்"

        Cldr.CL ->
            "சிலி"

        Cldr.CM ->
            "கேமரூன்"

        Cldr.CN ->
            "சீனா"

        Cldr.CO ->
            "கொலம்பியா"

        Cldr.CR ->
            "கோஸ்டாரிகா"

        Cldr.CU ->
            "கியூபா"

        Cldr.CV ->
            "கேப் வெர்டே"

        Cldr.CW ->
            "குராகவ்"

        Cldr.CX ->
            "கிறிஸ்துமஸ் தீவு"

        Cldr.CY ->
            "சைப்ரஸ்"

        Cldr.CZ ->
            "செசியா"

        Cldr.DE ->
            "ஜெர்மனி"

        Cldr.DJ ->
            "ஜிபௌட்டி"

        Cldr.DK ->
            "டென்மார்க்"

        Cldr.DM ->
            "டொமினிகா"

        Cldr.DO ->
            "டொமினிகன் குடியரசு"

        Cldr.DZ ->
            "அல்ஜீரியா"

        Cldr.EC ->
            "ஈக்வடார்"

        Cldr.EE ->
            "எஸ்டோனியா"

        Cldr.EG ->
            "எகிப்து"

        Cldr.EH ->
            "மேற்கு சஹாரா"

        Cldr.ER ->
            "எரிட்ரியா"

        Cldr.ES ->
            "ஸ்பெயின்"

        Cldr.ET ->
            "எத்தியோப்பியா"

        Cldr.FI ->
            "பின்லாந்து"

        Cldr.FJ ->
            "ஃபிஜி"

        Cldr.FK ->
            "ஃபாக்லாந்து தீவுகள்"

        Cldr.FM ->
            "மைக்ரோனேஷியா"

        Cldr.FO ->
            "ஃபாரோ தீவுகள்"

        Cldr.FR ->
            "பிரான்ஸ்"

        Cldr.GA ->
            "கேபான்"

        Cldr.GB ->
            "யுனைடெட் கிங்டம்"

        Cldr.GD ->
            "கிரனெடா"

        Cldr.GE ->
            "ஜார்ஜியா"

        Cldr.GF ->
            "பிரெஞ்சு கயானா"

        Cldr.GG ->
            "கெர்ன்சி"

        Cldr.GH ->
            "கானா"

        Cldr.GI ->
            "ஜிப்ரால்டர்"

        Cldr.GL ->
            "கிரீன்லாந்து"

        Cldr.GM ->
            "காம்பியா"

        Cldr.GN ->
            "கினியா"

        Cldr.GP ->
            "க்வாதேலோப்"

        Cldr.GQ ->
            "ஈக்வடோரியல் கினியா"

        Cldr.GR ->
            "கிரீஸ்"

        Cldr.GS ->
            "தெற்கு ஜார்ஜியா மற்றும் தெற்கு சாண்ட்விச் தீவுகள்"

        Cldr.GT_ ->
            "கவுதமாலா"

        Cldr.GU ->
            "குவாம்"

        Cldr.GW ->
            "கினியா-பிஸ்ஸாவ்"

        Cldr.GY ->
            "கயானா"

        Cldr.HK ->
            "ஹாங்காங் எஸ்ஏஆர் சீனா"

        Cldr.HM ->
            "ஹேர்ட் மற்றும் மெக்டொனால்டு தீவுகள்"

        Cldr.HN ->
            "ஹோண்டூராஸ்"

        Cldr.HR ->
            "குரோஷியா"

        Cldr.HT ->
            "ஹைட்டி"

        Cldr.HU ->
            "ஹங்கேரி"

        Cldr.ID ->
            "இந்தோனேசியா"

        Cldr.IE ->
            "அயர்லாந்து"

        Cldr.IL ->
            "இஸ்ரேல்"

        Cldr.IM ->
            "ஐல் ஆஃப் மேன்"

        Cldr.IN ->
            "இந்தியா"

        Cldr.IO ->
            "பிரிட்டிஷ் இந்தியப் பெருங்கடல் பிரதேசம்"

        Cldr.IQ ->
            "ஈராக்"

        Cldr.IR ->
            "ஈரான்"

        Cldr.IS ->
            "ஐஸ்லாந்து"

        Cldr.IT ->
            "இத்தாலி"

        Cldr.JE ->
            "ஜெர்சி"

        Cldr.JM ->
            "ஜமைகா"

        Cldr.JO ->
            "ஜோர்டான்"

        Cldr.JP ->
            "ஜப்பான்"

        Cldr.KE ->
            "கென்யா"

        Cldr.KG ->
            "கிர்கிஸ்தான்"

        Cldr.KH ->
            "கம்போடியா"

        Cldr.KI ->
            "கிரிபாட்டி"

        Cldr.KM ->
            "கோமரோஸ்"

        Cldr.KN ->
            "செயின்ட் கிட்ஸ் & நெவிஸ்"

        Cldr.KP ->
            "வட கொரியா"

        Cldr.KR ->
            "தென் கொரியா"

        Cldr.KW ->
            "குவைத்"

        Cldr.KY ->
            "கெய்மென் தீவுகள்"

        Cldr.KZ ->
            "கஸகஸ்தான்"

        Cldr.LA ->
            "லாவோஸ்"

        Cldr.LB ->
            "லெபனான்"

        Cldr.LC ->
            "செயின்ட் லூசியா"

        Cldr.LI ->
            "லிச்செண்ஸ்டெய்ன்"

        Cldr.LK ->
            "இலங்கை"

        Cldr.LR ->
            "லைபீரியா"

        Cldr.LS ->
            "லெசோதோ"

        Cldr.LT_ ->
            "லிதுவேனியா"

        Cldr.LU ->
            "லக்ஸ்சம்பர்க்"

        Cldr.LV ->
            "லாட்வியா"

        Cldr.LY ->
            "லிபியா"

        Cldr.MA ->
            "மொராக்கோ"

        Cldr.MC ->
            "மொனாக்கோ"

        Cldr.MD ->
            "மால்டோவா"

        Cldr.ME ->
            "மான்டேனெக்ரோ"

        Cldr.MF ->
            "செயின்ட் மார்ட்டீன்"

        Cldr.MG ->
            "மடகாஸ்கர்"

        Cldr.MH ->
            "மார்ஷல் தீவுகள்"

        Cldr.MK ->
            "வடக்கு மாசிடோனியா"

        Cldr.ML ->
            "மாலி"

        Cldr.MM ->
            "மியான்மார் (பர்மா)"

        Cldr.MN ->
            "மங்கோலியா"

        Cldr.MO ->
            "மகாவ் எஸ்ஏஆர் சீனா"

        Cldr.MP ->
            "வடக்கு மரியானா தீவுகள்"

        Cldr.MQ ->
            "மார்டினிக்"

        Cldr.MR ->
            "மௌரிடானியா"

        Cldr.MS ->
            "மாண்ட்செராட்"

        Cldr.MT ->
            "மால்டா"

        Cldr.MU ->
            "மொரிசியஸ்"

        Cldr.MV ->
            "மாலத்தீவு"

        Cldr.MW ->
            "மலாவி"

        Cldr.MX ->
            "மெக்சிகோ"

        Cldr.MY ->
            "மலேசியா"

        Cldr.MZ ->
            "மொசாம்பிக்"

        Cldr.NA ->
            "நமீபியா"

        Cldr.NC ->
            "நியூ கேலிடோனியா"

        Cldr.NE ->
            "நைஜர்"

        Cldr.NF ->
            "நார்ஃபோக் தீவு"

        Cldr.NG ->
            "நைஜீரியா"

        Cldr.NI ->
            "நிகரகுவா"

        Cldr.NL ->
            "நெதர்லாந்து"

        Cldr.NO ->
            "நார்வே"

        Cldr.NP ->
            "நேபாளம்"

        Cldr.NR ->
            "நௌரு"

        Cldr.NU ->
            "நியுவே"

        Cldr.NZ ->
            "நியூசிலாந்து"

        Cldr.OM ->
            "ஓமன்"

        Cldr.PA ->
            "பனாமா"

        Cldr.PE ->
            "பெரு"

        Cldr.PF ->
            "பிரெஞ்சு பாலினேஷியா"

        Cldr.PG ->
            "பப்புவா நியூ கினியா"

        Cldr.PH ->
            "பிலிப்பைன்ஸ்"

        Cldr.PK ->
            "பாகிஸ்தான்"

        Cldr.PL ->
            "போலந்து"

        Cldr.PM ->
            "செயின்ட் பியர் & மிக்வேலான்"

        Cldr.PN ->
            "பிட்கெய்ர்ன் தீவுகள்"

        Cldr.PR ->
            "பியூர்டோ ரிகோ"

        Cldr.PS ->
            "பாலஸ்தீனிய பிரதேசங்கள்"

        Cldr.PT ->
            "போர்ச்சுக்கல்"

        Cldr.PW ->
            "பாலோ"

        Cldr.PY ->
            "பராகுவே"

        Cldr.QA ->
            "கத்தார்"

        Cldr.RE ->
            "ரீயூனியன்"

        Cldr.RO ->
            "ருமேனியா"

        Cldr.RS ->
            "செர்பியா"

        Cldr.RU ->
            "ரஷ்யா"

        Cldr.RW ->
            "ருவாண்டா"

        Cldr.SA ->
            "சவுதி அரேபியா"

        Cldr.SB ->
            "சாலமன் தீவுகள்"

        Cldr.SC ->
            "சீஷெல்ஸ்"

        Cldr.SD ->
            "சூடான்"

        Cldr.SE ->
            "ஸ்வீடன்"

        Cldr.SG ->
            "சிங்கப்பூர்"

        Cldr.SH ->
            "செயின்ட் ஹெலெனா"

        Cldr.SI ->
            "ஸ்லோவேனியா"

        Cldr.SJ ->
            "ஸ்வல்பார்டு & ஜான் மேயன்"

        Cldr.SK ->
            "ஸ்லோவாகியா"

        Cldr.SL ->
            "சியாரா லியோன்"

        Cldr.SM ->
            "சான் மரினோ"

        Cldr.SN ->
            "செனெகல்"

        Cldr.SO ->
            "சோமாலியா"

        Cldr.SR ->
            "சுரினாம்"

        Cldr.SS ->
            "தெற்கு சூடான்"

        Cldr.ST ->
            "சாவ் தோம் & ப்ரின்சிபி"

        Cldr.SV ->
            "எல் சால்வடார்"

        Cldr.SX ->
            "சின்ட் மார்டென்"

        Cldr.SY ->
            "சிரியா"

        Cldr.SZ ->
            "எஸ்வாட்டீனி"

        Cldr.TC ->
            "டர்க்ஸ் & கைகோஸ் தீவுகள்"

        Cldr.TD ->
            "சாட்"

        Cldr.TF ->
            "பிரெஞ்சு தெற்கு பிரதேசங்கள்"

        Cldr.TG ->
            "டோகோ"

        Cldr.TH ->
            "தாய்லாந்து"

        Cldr.TJ ->
            "தஜிகிஸ்தான்"

        Cldr.TK ->
            "டோகேலோ"

        Cldr.TL ->
            "திமோர்-லெஸ்தே"

        Cldr.TM ->
            "துர்க்மெனிஸ்தான்"

        Cldr.TN ->
            "டுனிசியா"

        Cldr.TO ->
            "டோங்கா"

        Cldr.TR ->
            "துருக்கியே"

        Cldr.TT ->
            "டிரினிடாட் & டொபாகோ"

        Cldr.TV ->
            "துவாலு"

        Cldr.TW ->
            "தைவான்"

        Cldr.TZ ->
            "தான்சானியா"

        Cldr.UA ->
            "உக்ரைன்"

        Cldr.UG ->
            "உகாண்டா"

        Cldr.UM ->
            "யூ.எஸ். வெளிப்புறத் தீவுகள்"

        Cldr.US ->
            "அமெரிக்கா"

        Cldr.UY ->
            "உருகுவே"

        Cldr.UZ ->
            "உஸ்பெகிஸ்தான்"

        Cldr.VA ->
            "வாடிகன் நகரம்"

        Cldr.VC ->
            "செயின்ட் வின்சென்ட் & கிரெனடைன்ஸ்"

        Cldr.VE ->
            "வெனிசுலா"

        Cldr.VG ->
            "பிரிட்டீஷ் கன்னித் தீவுகள்"

        Cldr.VI ->
            "யூ.எஸ். கன்னித் தீவுகள்"

        Cldr.VN ->
            "வியட்நாம்"

        Cldr.VU ->
            "வனுவாட்டு"

        Cldr.WF ->
            "வாலிஸ் மற்றும் ஃபுடுனா"

        Cldr.WS ->
            "சமோவா"

        Cldr.XK ->
            "கொசோவோ"

        Cldr.YE ->
            "ஏமன்"

        Cldr.YT ->
            "மயோட்"

        Cldr.ZA ->
            "தென் ஆப்பிரிக்கா"

        Cldr.ZM ->
            "ஜாம்பியா"

        Cldr.ZW ->
            "ஜிம்பாப்வே"