module Cldr.Telugu exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "ఆండోరా"

        Cldr.AE ->
            "యునైటెడ్ అరబ్ ఎమిరేట్స్"

        Cldr.AF ->
            "ఆఫ్ఘనిస్తాన్"

        Cldr.AG ->
            "ఆంటిగ్వా మరియు బార్బుడా"

        Cldr.AI ->
            "ఆంగ్విల్లా"

        Cldr.AL ->
            "అల్బేనియా"

        Cldr.AM ->
            "ఆర్మేనియా"

        Cldr.AO ->
            "అంగోలా"

        Cldr.AQ ->
            "అంటార్కిటికా"

        Cldr.AR ->
            "అర్జెంటీనా"

        Cldr.AS ->
            "అమెరికన్ సమోవా"

        Cldr.AT ->
            "ఆస్ట్రియా"

        Cldr.AU ->
            "ఆస్ట్రేలియా"

        Cldr.AW ->
            "అరుబా"

        Cldr.AX ->
            "ఆలాండ్ దీవులు"

        Cldr.AZ ->
            "అజర్బైజాన్"

        Cldr.BA ->
            "బోస్నియా మరియు హెర్జిగోవినా"

        Cldr.BB ->
            "బార్బడోస్"

        Cldr.BD ->
            "బంగ్లాదేశ్"

        Cldr.BE ->
            "బెల్జియం"

        Cldr.BF ->
            "బుర్కినా ఫాసో"

        Cldr.BG ->
            "బల్గేరియా"

        Cldr.BH ->
            "బహ్రెయిన్"

        Cldr.BI ->
            "బురుండి"

        Cldr.BJ ->
            "బెనిన్"

        Cldr.BL ->
            "సెయింట్ బర్థెలిమి"

        Cldr.BM ->
            "బెర్ముడా"

        Cldr.BN ->
            "బ్రూనే"

        Cldr.BO ->
            "బొలీవియా"

        Cldr.BQ ->
            "కరీబియన్ నెదర్లాండ్స్"

        Cldr.BR ->
            "బ్రెజిల్"

        Cldr.BS ->
            "బహామాస్"

        Cldr.BT ->
            "భూటాన్"

        Cldr.BV ->
            "బువై దీవి"

        Cldr.BW ->
            "బోట్స్వానా"

        Cldr.BY ->
            "బెలారస్"

        Cldr.BZ ->
            "బెలిజ్"

        Cldr.CA ->
            "కెనడా"

        Cldr.CC ->
            "కోకోస్ (కీలింగ్) దీవులు"

        Cldr.CD ->
            "కాంగో- కిన్షాసా"

        Cldr.CF ->
            "సెంట్రల్ ఆఫ్రికన్ రిపబ్లిక్"

        Cldr.CG ->
            "కాంగో- బ్రాజావిల్లి"

        Cldr.CH ->
            "స్విట్జర్లాండ్"

        Cldr.CI ->
            "కోట్ డి ఐవోర్"

        Cldr.CK ->
            "కుక్ దీవులు"

        Cldr.CL ->
            "చిలీ"

        Cldr.CM ->
            "కామెరూన్"

        Cldr.CN ->
            "చైనా"

        Cldr.CO ->
            "కొలంబియా"

        Cldr.CR ->
            "కోస్టా రికా"

        Cldr.CU ->
            "క్యూబా"

        Cldr.CV ->
            "కేప్ వెర్డె"

        Cldr.CW ->
            "క్యూరసో"

        Cldr.CX ->
            "క్రిస్మస్ దీవి"

        Cldr.CY ->
            "సైప్రస్"

        Cldr.CZ ->
            "చెకియా"

        Cldr.DE ->
            "జర్మనీ"

        Cldr.DJ ->
            "జిబౌటి"

        Cldr.DK ->
            "డెన్మార్క్"

        Cldr.DM ->
            "డొమినికా"

        Cldr.DO ->
            "డొమినికన్ రిపబ్లిక్"

        Cldr.DZ ->
            "అల్జీరియా"

        Cldr.EC ->
            "ఈక్వడార్"

        Cldr.EE ->
            "ఎస్టోనియా"

        Cldr.EG ->
            "ఈజిప్ట్"

        Cldr.EH ->
            "పడమటి సహారా"

        Cldr.ER ->
            "ఎరిట్రియా"

        Cldr.ES ->
            "స్పెయిన్"

        Cldr.ET ->
            "ఇథియోపియా"

        Cldr.FI ->
            "ఫిన్లాండ్"

        Cldr.FJ ->
            "ఫిజీ"

        Cldr.FK ->
            "ఫాక్‌ల్యాండ్ దీవులు"

        Cldr.FM ->
            "మైక్రోనేషియా"

        Cldr.FO ->
            "ఫారో దీవులు"

        Cldr.FR ->
            "ఫ్రాన్స్‌"

        Cldr.GA ->
            "గేబన్"

        Cldr.GB ->
            "యునైటెడ్ కింగ్‌డమ్"

        Cldr.GD ->
            "గ్రెనడా"

        Cldr.GE ->
            "జార్జియా"

        Cldr.GF ->
            "ఫ్రెంచ్ గియానా"

        Cldr.GG ->
            "గర్న్‌సీ"

        Cldr.GH ->
            "ఘనా"

        Cldr.GI ->
            "జిబ్రాల్టర్"

        Cldr.GL ->
            "గ్రీన్‌ల్యాండ్"

        Cldr.GM ->
            "గాంబియా"

        Cldr.GN ->
            "గినియా"

        Cldr.GP ->
            "గ్వాడెలోప్"

        Cldr.GQ ->
            "ఈక్వటోరియల్ గినియా"

        Cldr.GR ->
            "గ్రీస్"

        Cldr.GS ->
            "దక్షిణ జార్జియా మరియు దక్షిణ శాండ్విచ్ దీవులు"

        Cldr.GT_ ->
            "గ్వాటిమాలా"

        Cldr.GU ->
            "గ్వామ్"

        Cldr.GW ->
            "గినియా-బిస్సావ్"

        Cldr.GY ->
            "గయానా"

        Cldr.HK ->
            "హాంకాంగ్ ఎస్ఏఆర్ చైనా"

        Cldr.HM ->
            "హెర్డ్ దీవి మరియు మెక్‌డొనాల్డ్ దీవులు"

        Cldr.HN ->
            "హోండురాస్"

        Cldr.HR ->
            "క్రొయేషియా"

        Cldr.HT ->
            "హైటి"

        Cldr.HU ->
            "హంగేరీ"

        Cldr.ID ->
            "ఇండోనేషియా"

        Cldr.IE ->
            "ఐర్లాండ్"

        Cldr.IL ->
            "ఇజ్రాయెల్"

        Cldr.IM ->
            "ఐల్ ఆఫ్ మాన్"

        Cldr.IN ->
            "భారతదేశం"

        Cldr.IO ->
            "బ్రిటిష్ హిందూ మహాసముద్ర ప్రాంతం"

        Cldr.IQ ->
            "ఇరాక్"

        Cldr.IR ->
            "ఇరాన్"

        Cldr.IS ->
            "ఐస్లాండ్"

        Cldr.IT ->
            "ఇటలీ"

        Cldr.JE ->
            "జెర్సీ"

        Cldr.JM ->
            "జమైకా"

        Cldr.JO ->
            "జోర్డాన్"

        Cldr.JP ->
            "జపాన్"

        Cldr.KE ->
            "కెన్యా"

        Cldr.KG ->
            "కిర్గిజిస్తాన్"

        Cldr.KH ->
            "కంబోడియా"

        Cldr.KI ->
            "కిరిబాటి"

        Cldr.KM ->
            "కొమొరోస్"

        Cldr.KN ->
            "సెయింట్ కిట్స్ మరియు నెవిస్"

        Cldr.KP ->
            "ఉత్తర కొరియా"

        Cldr.KR ->
            "దక్షిణ కొరియా"

        Cldr.KW ->
            "కువైట్"

        Cldr.KY ->
            "కేమాన్ దీవులు"

        Cldr.KZ ->
            "కజకిస్తాన్"

        Cldr.LA ->
            "లావోస్"

        Cldr.LB ->
            "లెబనాన్"

        Cldr.LC ->
            "సెయింట్ లూసియా"

        Cldr.LI ->
            "లిక్టెన్‌స్టెయిన్"

        Cldr.LK ->
            "శ్రీలంక"

        Cldr.LR ->
            "లైబీరియా"

        Cldr.LS ->
            "లెసోతో"

        Cldr.LT_ ->
            "లిథువేనియా"

        Cldr.LU ->
            "లక్సెంబర్గ్"

        Cldr.LV ->
            "లాత్వియా"

        Cldr.LY ->
            "లిబియా"

        Cldr.MA ->
            "మొరాకో"

        Cldr.MC ->
            "మొనాకో"

        Cldr.MD ->
            "మోల్డోవా"

        Cldr.ME ->
            "మాంటెనెగ్రో"

        Cldr.MF ->
            "సెయింట్ మార్టిన్"

        Cldr.MG ->
            "మడగాస్కర్"

        Cldr.MH ->
            "మార్షల్ దీవులు"

        Cldr.MK ->
            "ఉత్తర మాసిడోనియా"

        Cldr.ML ->
            "మాలి"

        Cldr.MM ->
            "మయన్మార్"

        Cldr.MN ->
            "మంగోలియా"

        Cldr.MO ->
            "మకావ్ ఎస్ఏఆర్ చైనా"

        Cldr.MP ->
            "ఉత్తర మరియానా దీవులు"

        Cldr.MQ ->
            "మార్టినీక్"

        Cldr.MR ->
            "మౌరిటేనియా"

        Cldr.MS ->
            "మాంట్సెరాట్"

        Cldr.MT ->
            "మాల్టా"

        Cldr.MU ->
            "మారిషస్"

        Cldr.MV ->
            "మాల్దీవులు"

        Cldr.MW ->
            "మలావీ"

        Cldr.MX ->
            "మెక్సికో"

        Cldr.MY ->
            "మలేషియా"

        Cldr.MZ ->
            "మొజాంబిక్"

        Cldr.NA ->
            "నమీబియా"

        Cldr.NC ->
            "క్రొత్త కాలెడోనియా"

        Cldr.NE ->
            "నైజర్"

        Cldr.NF ->
            "నార్ఫోక్ దీవి"

        Cldr.NG ->
            "నైజీరియా"

        Cldr.NI ->
            "నికరాగువా"

        Cldr.NL ->
            "నెదర్లాండ్స్"

        Cldr.NO ->
            "నార్వే"

        Cldr.NP ->
            "నేపాల్"

        Cldr.NR ->
            "నౌరు"

        Cldr.NU ->
            "నియూ"

        Cldr.NZ ->
            "న్యూజిలాండ్"

        Cldr.OM ->
            "ఓమన్"

        Cldr.PA ->
            "పనామా"

        Cldr.PE ->
            "పెరూ"

        Cldr.PF ->
            "ఫ్రెంచ్ పోలినీషియా"

        Cldr.PG ->
            "పాపువా న్యూ గినియా"

        Cldr.PH ->
            "ఫిలిప్పైన్స్"

        Cldr.PK ->
            "పాకిస్తాన్"

        Cldr.PL ->
            "పోలాండ్"

        Cldr.PM ->
            "సెయింట్ పియెర్ మరియు మికెలాన్"

        Cldr.PN ->
            "పిట్‌కెయిర్న్ దీవులు"

        Cldr.PR ->
            "ప్యూర్టో రికో"

        Cldr.PS ->
            "పాలస్తీనియన్ ప్రాంతాలు"

        Cldr.PT ->
            "పోర్చుగల్"

        Cldr.PW ->
            "పాలావ్"

        Cldr.PY ->
            "పరాగ్వే"

        Cldr.QA ->
            "ఖతార్"

        Cldr.RE ->
            "రీయూనియన్"

        Cldr.RO ->
            "రోమేనియా"

        Cldr.RS ->
            "సెర్బియా"

        Cldr.RU ->
            "రష్యా"

        Cldr.RW ->
            "రువాండా"

        Cldr.SA ->
            "సౌదీ అరేబియా"

        Cldr.SB ->
            "సోలమన్ దీవులు"

        Cldr.SC ->
            "సీషెల్స్"

        Cldr.SD ->
            "సూడాన్"

        Cldr.SE ->
            "స్వీడన్"

        Cldr.SG ->
            "సింగపూర్"

        Cldr.SH ->
            "సెయింట్ హెలెనా"

        Cldr.SI ->
            "స్లోవేనియా"

        Cldr.SJ ->
            "స్వాల్‌బార్డ్ మరియు జాన్ మాయెన్"

        Cldr.SK ->
            "స్లొవేకియా"

        Cldr.SL ->
            "సియెర్రా లియాన్"

        Cldr.SM ->
            "శాన్ మారినో"

        Cldr.SN ->
            "సెనెగల్"

        Cldr.SO ->
            "సోమాలియా"

        Cldr.SR ->
            "సూరినామ్"

        Cldr.SS ->
            "దక్షిణ సూడాన్"

        Cldr.ST ->
            "సావో టోమ్ మరియు ప్రిన్సిపి"

        Cldr.SV ->
            "ఎల్ సాల్వడోర్"

        Cldr.SX ->
            "సింట్ మార్టెన్"

        Cldr.SY ->
            "సిరియా"

        Cldr.SZ ->
            "ఈస్వాటిని"

        Cldr.TC ->
            "టర్క్స్ మరియు కైకోస్ దీవులు"

        Cldr.TD ->
            "చాద్"

        Cldr.TF ->
            "ఫ్రెంచ్ దక్షిణ ప్రాంతాలు"

        Cldr.TG ->
            "టోగో"

        Cldr.TH ->
            "థాయిలాండ్"

        Cldr.TJ ->
            "తజికిస్తాన్"

        Cldr.TK ->
            "టోకెలావ్"

        Cldr.TL ->
            "టిమోర్-లెస్టె"

        Cldr.TM ->
            "టర్క్‌మెనిస్తాన్"

        Cldr.TN ->
            "ట్యునీషియా"

        Cldr.TO ->
            "టోంగా"

        Cldr.TR ->
            "తుర్కియె"

        Cldr.TT ->
            "ట్రినిడాడ్ మరియు టొబాగో"

        Cldr.TV ->
            "టువాలు"

        Cldr.TW ->
            "తైవాన్"

        Cldr.TZ ->
            "టాంజానియా"

        Cldr.UA ->
            "ఉక్రెయిన్"

        Cldr.UG ->
            "ఉగాండా"

        Cldr.UM ->
            "సంయుక్త రాజ్య అమెరికా బయట ఉన్న దీవులు"

        Cldr.US ->
            "యునైటెడ్ స్టేట్స్"

        Cldr.UY ->
            "ఉరుగ్వే"

        Cldr.UZ ->
            "ఉజ్బెకిస్తాన్"

        Cldr.VA ->
            "వాటికన్ నగరం"

        Cldr.VC ->
            "సెయింట్ విన్సెంట్ మరియు గ్రెనడీన్స్"

        Cldr.VE ->
            "వెనిజులా"

        Cldr.VG ->
            "బ్రిటిష్ వర్జిన్ దీవులు"

        Cldr.VI ->
            "యు.ఎస్. వర్జిన్ దీవులు"

        Cldr.VN ->
            "వియత్నాం"

        Cldr.VU ->
            "వనాటు"

        Cldr.WF ->
            "వాల్లిస్ మరియు ఫుటునా"

        Cldr.WS ->
            "సమోవా"

        Cldr.XK ->
            "కొసోవో"

        Cldr.YE ->
            "యెమెన్"

        Cldr.YT ->
            "మాయొట్"

        Cldr.ZA ->
            "దక్షిణ ఆఫ్రికా"

        Cldr.ZM ->
            "జాంబియా"

        Cldr.ZW ->
            "జింబాబ్వే"