module Cldr.Urdu exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr


{-| Name for `CountryCode` in Urdu.

    AD انڈورا
    AE متحدہ عرب امارات
    AF افغانستان
    AG انٹیگوا اور باربودا
    AI انگوئیلا
    AL البانیہ
    AM آرمینیا
    AO انگولا
    AQ انٹارکٹیکا
    AR ارجنٹینا
    AS امریکی ساموآ
    AT آسٹریا
    AU آسٹریلیا
    AW اروبا
    AX آلینڈ آئلینڈز
    AZ آذربائیجان
    BA بوسنیا اور ہرزیگووینا
    BB بارباڈوس
    BD بنگلہ دیش
    BE بیلجیم
    BF برکینا فاسو
    BG بلغاریہ
    BH بحرین
    BI برونڈی
    BJ بینن
    BL سینٹ برتھلیمی
    BM برمودا
    BN برونائی
    BO بولیویا
    BQ کریبیائی نیدرلینڈز
    BR برازیل
    BS بہاماس
    BT بھوٹان
    BV بؤویٹ آئلینڈ
    BW بوتسوانا
    BY بیلاروس
    BZ بیلائز
    CA کینیڈا
    CC کوکوس (کیلنگ) جزائر
    CD کانگو (DRC)
    CF وسط افریقی جمہوریہ
    CG کانگو (جمہوریہ)
    CH سوئٹزر لینڈ
    CI کوٹ ڈی آئیوری
    CK کک آئلینڈز
    CL چلی
    CM کیمرون
    CN چین
    CO کولمبیا
    CR کوسٹا ریکا
    CU کیوبا
    CV کیپ ورڈی
    CW کیوراکاؤ
    CX جزیرہ کرسمس
    CY قبرص
    CZ چیک جمہوریہ
    DE جرمنی
    DJ جبوتی
    DK ڈنمارک
    DM ڈومنیکا
    DO جمہوریہ ڈومينيکن
    DZ الجیریا
    EC ایکواڈور
    EE اسٹونیا
    EG مصر
    EH مغربی صحارا
    ER اریٹیریا
    ES ہسپانیہ
    ET ایتھوپیا
    FI فن لینڈ
    FJ فجی
    FK فاکلینڈ جزائر
    FM مائکرونیشیا
    FO جزائر فارو
    FR فرانس
    GA گیبون
    GB سلطنت متحدہ
    GD گریناڈا
    GE جارجیا
    GF فرینچ گیانا
    GG گوئرنسی
    GH گھانا
    GI جبل الطارق
    GL گرین لینڈ
    GM گیمبیا
    GN گنی
    GP گواڈیلوپ
    GQ استوائی گیانا
    GR یونان
    GS جنوبی جارجیا اور جنوبی سینڈوچ جزائر
    GT گواٹے مالا
    GU گوام
    GW گنی بساؤ
    GY گیانا
    HK ہانگ کانگ
    HM ہیرڈ جزیرہ و میکڈولینڈ جزائر
    HN ہونڈاروس
    HR کروشیا
    HT ہیٹی
    HU ہنگری
    ID انڈونیشیا
    IE آئرلینڈ
    IL اسرائیل
    IM آئل آف مین
    IN بھارت
    IO برطانوی بحر ہند کا علاقہ
    IQ عراق
    IR ایران
    IS آئس لینڈ
    IT اٹلی
    JE جرسی
    JM جمائیکا
    JO اردن
    JP جاپان
    KE کینیا
    KG کرغزستان
    KH کمبوڈیا
    KI کریباتی
    KM کوموروس
    KN سینٹ کٹس اور نیویس
    KP شمالی کوریا
    KR جنوبی کوریا
    KW کویت
    KY کیمین آئلینڈز
    KZ قزاخستان
    LA لاؤس
    LB لبنان
    LC سینٹ لوسیا
    LI لیشٹنسٹائن
    LK سری لنکا
    LR لائبیریا
    LS لیسوتھو
    LT لیتھونیا
    LU لکسمبرگ
    LV لٹویا
    LY لیبیا
    MA مراکش
    MC موناکو
    MD مالدووا
    ME مونٹے نیگرو
    MF سینٹ مارٹن
    MG مڈغاسکر
    MH مارشل آئلینڈز
    MK شمالی مقدونیہ
    ML مالی
    MM میانمار (برما)
    MN منگولیا
    MO مکاؤ
    MP شمالی ماریانا آئلینڈز
    MQ مارٹینک
    MR موریطانیہ
    MS مونٹسیراٹ
    MT مالٹا
    MU ماریشس
    MV مالدیپ
    MW ملاوی
    MX میکسیکو
    MY ملائشیا
    MZ موزمبیق
    NA نامیبیا
    NC نیو کلیڈونیا
    NE نائجر
    NF نارفوک آئلینڈ
    NG نائجیریا
    NI نکاراگووا
    NL نیدر لینڈز
    NO ناروے
    NP نیپال
    NR نؤرو
    NU نیئو
    NZ نیوزی لینڈ
    OM عمان
    PA پانامہ
    PE پیرو
    PF فرانسیسی پولینیشیا
    PG پاپوآ نیو گنی
    PH فلپائن
    PK پاکستان
    PL پولینڈ
    PM سینٹ پیئر اور میکلیئون
    PN پٹکائرن جزائر
    PR پیورٹو ریکو
    PS فلسطین
    PT پرتگال
    PW پلاؤ
    PY پیراگوئے
    QA قطر
    RE ری یونین
    RO رومانیہ
    RS سربیا
    RU روس
    RW روانڈا
    SA سعودی عرب
    SB سولومن آئلینڈز
    SC سشلیز
    SD سوڈان
    SE سویڈن
    SG سنگاپور
    SH سینٹ ہیلینا
    SI سلووینیا
    SJ سوالبرڈ اور جان ماین
    SK سلوواکیہ
    SL سیرالیون
    SM سان مارینو
    SN سینیگل
    SO صومالیہ
    SR سورینام
    SS جنوبی سوڈان
    ST ساؤ ٹومے اور پرنسپے
    SV ال سلواڈور
    SX سنٹ مارٹن
    SY شام
    SZ سواتنی
    TC ٹرکس اور کیکوس جزائر
    TD چاڈ
    TF فرانسیسی جنوبی خطے
    TG ٹوگو
    TH تھائی لینڈ
    TJ تاجکستان
    TK ٹوکیلاؤ
    TL مشرقی تیمور
    TM ترکمانستان
    TN تونس
    TO ٹونگا
    TR ترکیہ
    TT ترینیداد اور ٹوباگو
    TV ٹووالو
    TW تائیوان
    TZ تنزانیہ
    UA یوکرین
    UG یوگنڈا
    UM امریکہ سے باہر کے چھوٹے جزائز
    US ریاست ہائے متحدہ امریکہ
    UY یوروگوئے
    UZ ازبکستان
    VA ویٹیکن سٹی
    VC سینٹ ونسنٹ اور گرینیڈائنز
    VE وینزوئیلا
    VG برٹش ورجن آئلینڈز
    VI امریکی ورجن آئلینڈز
    VN ویتنام
    VU وینوآٹو
    WF ویلیز اور فیوٹیونا
    WS ساموآ
    XK کوسووو
    YE یمن
    YT مایوٹ
    ZA جنوبی افریقہ
    ZM زامبیا
    ZW زمبابوے
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "انڈورا"

        Cldr.AE ->
            "متحدہ عرب امارات"

        Cldr.AF ->
            "افغانستان"

        Cldr.AG ->
            "انٹیگوا اور باربودا"

        Cldr.AI ->
            "انگوئیلا"

        Cldr.AL ->
            "البانیہ"

        Cldr.AM ->
            "آرمینیا"

        Cldr.AO ->
            "انگولا"

        Cldr.AQ ->
            "انٹارکٹیکا"

        Cldr.AR ->
            "ارجنٹینا"

        Cldr.AS ->
            "امریکی ساموآ"

        Cldr.AT ->
            "آسٹریا"

        Cldr.AU ->
            "آسٹریلیا"

        Cldr.AW ->
            "اروبا"

        Cldr.AX ->
            "آلینڈ آئلینڈز"

        Cldr.AZ ->
            "آذربائیجان"

        Cldr.BA ->
            "بوسنیا اور ہرزیگووینا"

        Cldr.BB ->
            "بارباڈوس"

        Cldr.BD ->
            "بنگلہ دیش"

        Cldr.BE ->
            "بیلجیم"

        Cldr.BF ->
            "برکینا فاسو"

        Cldr.BG ->
            "بلغاریہ"

        Cldr.BH ->
            "بحرین"

        Cldr.BI ->
            "برونڈی"

        Cldr.BJ ->
            "بینن"

        Cldr.BL ->
            "سینٹ برتھلیمی"

        Cldr.BM ->
            "برمودا"

        Cldr.BN ->
            "برونائی"

        Cldr.BO ->
            "بولیویا"

        Cldr.BQ ->
            "کریبیائی نیدرلینڈز"

        Cldr.BR ->
            "برازیل"

        Cldr.BS ->
            "بہاماس"

        Cldr.BT ->
            "بھوٹان"

        Cldr.BV ->
            "بؤویٹ آئلینڈ"

        Cldr.BW ->
            "بوتسوانا"

        Cldr.BY ->
            "بیلاروس"

        Cldr.BZ ->
            "بیلائز"

        Cldr.CA ->
            "کینیڈا"

        Cldr.CC ->
            "کوکوس (کیلنگ) جزائر"

        Cldr.CD ->
            "کانگو (DRC)"

        Cldr.CF ->
            "وسط افریقی جمہوریہ"

        Cldr.CG ->
            "کانگو (جمہوریہ)"

        Cldr.CH ->
            "سوئٹزر لینڈ"

        Cldr.CI ->
            "کوٹ ڈی آئیوری"

        Cldr.CK ->
            "کک آئلینڈز"

        Cldr.CL ->
            "چلی"

        Cldr.CM ->
            "کیمرون"

        Cldr.CN ->
            "چین"

        Cldr.CO ->
            "کولمبیا"

        Cldr.CR ->
            "کوسٹا ریکا"

        Cldr.CU ->
            "کیوبا"

        Cldr.CV ->
            "کیپ ورڈی"

        Cldr.CW ->
            "کیوراکاؤ"

        Cldr.CX ->
            "جزیرہ کرسمس"

        Cldr.CY ->
            "قبرص"

        Cldr.CZ ->
            "چیک جمہوریہ"

        Cldr.DE ->
            "جرمنی"

        Cldr.DJ ->
            "جبوتی"

        Cldr.DK ->
            "ڈنمارک"

        Cldr.DM ->
            "ڈومنیکا"

        Cldr.DO ->
            "جمہوریہ ڈومينيکن"

        Cldr.DZ ->
            "الجیریا"

        Cldr.EC ->
            "ایکواڈور"

        Cldr.EE ->
            "اسٹونیا"

        Cldr.EG ->
            "مصر"

        Cldr.EH ->
            "مغربی صحارا"

        Cldr.ER ->
            "اریٹیریا"

        Cldr.ES ->
            "ہسپانیہ"

        Cldr.ET ->
            "ایتھوپیا"

        Cldr.FI ->
            "فن لینڈ"

        Cldr.FJ ->
            "فجی"

        Cldr.FK ->
            "فاکلینڈ جزائر"

        Cldr.FM ->
            "مائکرونیشیا"

        Cldr.FO ->
            "جزائر فارو"

        Cldr.FR ->
            "فرانس"

        Cldr.GA ->
            "گیبون"

        Cldr.GB ->
            "سلطنت متحدہ"

        Cldr.GD ->
            "گریناڈا"

        Cldr.GE ->
            "جارجیا"

        Cldr.GF ->
            "فرینچ گیانا"

        Cldr.GG ->
            "گوئرنسی"

        Cldr.GH ->
            "گھانا"

        Cldr.GI ->
            "جبل الطارق"

        Cldr.GL ->
            "گرین لینڈ"

        Cldr.GM ->
            "گیمبیا"

        Cldr.GN ->
            "گنی"

        Cldr.GP ->
            "گواڈیلوپ"

        Cldr.GQ ->
            "استوائی گیانا"

        Cldr.GR ->
            "یونان"

        Cldr.GS ->
            "جنوبی جارجیا اور جنوبی سینڈوچ جزائر"

        Cldr.GT_ ->
            "گواٹے مالا"

        Cldr.GU ->
            "گوام"

        Cldr.GW ->
            "گنی بساؤ"

        Cldr.GY ->
            "گیانا"

        Cldr.HK ->
            "ہانگ کانگ"

        Cldr.HM ->
            "ہیرڈ جزیرہ و میکڈولینڈ جزائر"

        Cldr.HN ->
            "ہونڈاروس"

        Cldr.HR ->
            "کروشیا"

        Cldr.HT ->
            "ہیٹی"

        Cldr.HU ->
            "ہنگری"

        Cldr.ID ->
            "انڈونیشیا"

        Cldr.IE ->
            "آئرلینڈ"

        Cldr.IL ->
            "اسرائیل"

        Cldr.IM ->
            "آئل آف مین"

        Cldr.IN ->
            "بھارت"

        Cldr.IO ->
            "برطانوی بحر ہند کا علاقہ"

        Cldr.IQ ->
            "عراق"

        Cldr.IR ->
            "ایران"

        Cldr.IS ->
            "آئس لینڈ"

        Cldr.IT ->
            "اٹلی"

        Cldr.JE ->
            "جرسی"

        Cldr.JM ->
            "جمائیکا"

        Cldr.JO ->
            "اردن"

        Cldr.JP ->
            "جاپان"

        Cldr.KE ->
            "کینیا"

        Cldr.KG ->
            "کرغزستان"

        Cldr.KH ->
            "کمبوڈیا"

        Cldr.KI ->
            "کریباتی"

        Cldr.KM ->
            "کوموروس"

        Cldr.KN ->
            "سینٹ کٹس اور نیویس"

        Cldr.KP ->
            "شمالی کوریا"

        Cldr.KR ->
            "جنوبی کوریا"

        Cldr.KW ->
            "کویت"

        Cldr.KY ->
            "کیمین آئلینڈز"

        Cldr.KZ ->
            "قزاخستان"

        Cldr.LA ->
            "لاؤس"

        Cldr.LB ->
            "لبنان"

        Cldr.LC ->
            "سینٹ لوسیا"

        Cldr.LI ->
            "لیشٹنسٹائن"

        Cldr.LK ->
            "سری لنکا"

        Cldr.LR ->
            "لائبیریا"

        Cldr.LS ->
            "لیسوتھو"

        Cldr.LT_ ->
            "لیتھونیا"

        Cldr.LU ->
            "لکسمبرگ"

        Cldr.LV ->
            "لٹویا"

        Cldr.LY ->
            "لیبیا"

        Cldr.MA ->
            "مراکش"

        Cldr.MC ->
            "موناکو"

        Cldr.MD ->
            "مالدووا"

        Cldr.ME ->
            "مونٹے نیگرو"

        Cldr.MF ->
            "سینٹ مارٹن"

        Cldr.MG ->
            "مڈغاسکر"

        Cldr.MH ->
            "مارشل آئلینڈز"

        Cldr.MK ->
            "شمالی مقدونیہ"

        Cldr.ML ->
            "مالی"

        Cldr.MM ->
            "میانمار (برما)"

        Cldr.MN ->
            "منگولیا"

        Cldr.MO ->
            "مکاؤ"

        Cldr.MP ->
            "شمالی ماریانا آئلینڈز"

        Cldr.MQ ->
            "مارٹینک"

        Cldr.MR ->
            "موریطانیہ"

        Cldr.MS ->
            "مونٹسیراٹ"

        Cldr.MT ->
            "مالٹا"

        Cldr.MU ->
            "ماریشس"

        Cldr.MV ->
            "مالدیپ"

        Cldr.MW ->
            "ملاوی"

        Cldr.MX ->
            "میکسیکو"

        Cldr.MY ->
            "ملائشیا"

        Cldr.MZ ->
            "موزمبیق"

        Cldr.NA ->
            "نامیبیا"

        Cldr.NC ->
            "نیو کلیڈونیا"

        Cldr.NE ->
            "نائجر"

        Cldr.NF ->
            "نارفوک آئلینڈ"

        Cldr.NG ->
            "نائجیریا"

        Cldr.NI ->
            "نکاراگووا"

        Cldr.NL ->
            "نیدر لینڈز"

        Cldr.NO ->
            "ناروے"

        Cldr.NP ->
            "نیپال"

        Cldr.NR ->
            "نؤرو"

        Cldr.NU ->
            "نیئو"

        Cldr.NZ ->
            "نیوزی لینڈ"

        Cldr.OM ->
            "عمان"

        Cldr.PA ->
            "پانامہ"

        Cldr.PE ->
            "پیرو"

        Cldr.PF ->
            "فرانسیسی پولینیشیا"

        Cldr.PG ->
            "پاپوآ نیو گنی"

        Cldr.PH ->
            "فلپائن"

        Cldr.PK ->
            "پاکستان"

        Cldr.PL ->
            "پولینڈ"

        Cldr.PM ->
            "سینٹ پیئر اور میکلیئون"

        Cldr.PN ->
            "پٹکائرن جزائر"

        Cldr.PR ->
            "پیورٹو ریکو"

        Cldr.PS ->
            "فلسطین"

        Cldr.PT ->
            "پرتگال"

        Cldr.PW ->
            "پلاؤ"

        Cldr.PY ->
            "پیراگوئے"

        Cldr.QA ->
            "قطر"

        Cldr.RE ->
            "ری یونین"

        Cldr.RO ->
            "رومانیہ"

        Cldr.RS ->
            "سربیا"

        Cldr.RU ->
            "روس"

        Cldr.RW ->
            "روانڈا"

        Cldr.SA ->
            "سعودی عرب"

        Cldr.SB ->
            "سولومن آئلینڈز"

        Cldr.SC ->
            "سشلیز"

        Cldr.SD ->
            "سوڈان"

        Cldr.SE ->
            "سویڈن"

        Cldr.SG ->
            "سنگاپور"

        Cldr.SH ->
            "سینٹ ہیلینا"

        Cldr.SI ->
            "سلووینیا"

        Cldr.SJ ->
            "سوالبرڈ اور جان ماین"

        Cldr.SK ->
            "سلوواکیہ"

        Cldr.SL ->
            "سیرالیون"

        Cldr.SM ->
            "سان مارینو"

        Cldr.SN ->
            "سینیگل"

        Cldr.SO ->
            "صومالیہ"

        Cldr.SR ->
            "سورینام"

        Cldr.SS ->
            "جنوبی سوڈان"

        Cldr.ST ->
            "ساؤ ٹومے اور پرنسپے"

        Cldr.SV ->
            "ال سلواڈور"

        Cldr.SX ->
            "سنٹ مارٹن"

        Cldr.SY ->
            "شام"

        Cldr.SZ ->
            "سواتنی"

        Cldr.TC ->
            "ٹرکس اور کیکوس جزائر"

        Cldr.TD ->
            "چاڈ"

        Cldr.TF ->
            "فرانسیسی جنوبی خطے"

        Cldr.TG ->
            "ٹوگو"

        Cldr.TH ->
            "تھائی لینڈ"

        Cldr.TJ ->
            "تاجکستان"

        Cldr.TK ->
            "ٹوکیلاؤ"

        Cldr.TL ->
            "مشرقی تیمور"

        Cldr.TM ->
            "ترکمانستان"

        Cldr.TN ->
            "تونس"

        Cldr.TO ->
            "ٹونگا"

        Cldr.TR ->
            "ترکیہ"

        Cldr.TT ->
            "ترینیداد اور ٹوباگو"

        Cldr.TV ->
            "ٹووالو"

        Cldr.TW ->
            "تائیوان"

        Cldr.TZ ->
            "تنزانیہ"

        Cldr.UA ->
            "یوکرین"

        Cldr.UG ->
            "یوگنڈا"

        Cldr.UM ->
            "امریکہ سے باہر کے چھوٹے جزائز"

        Cldr.US ->
            "ریاست ہائے متحدہ امریکہ"

        Cldr.UY ->
            "یوروگوئے"

        Cldr.UZ ->
            "ازبکستان"

        Cldr.VA ->
            "ویٹیکن سٹی"

        Cldr.VC ->
            "سینٹ ونسنٹ اور گرینیڈائنز"

        Cldr.VE ->
            "وینزوئیلا"

        Cldr.VG ->
            "برٹش ورجن آئلینڈز"

        Cldr.VI ->
            "امریکی ورجن آئلینڈز"

        Cldr.VN ->
            "ویتنام"

        Cldr.VU ->
            "وینوآٹو"

        Cldr.WF ->
            "ویلیز اور فیوٹیونا"

        Cldr.WS ->
            "ساموآ"

        Cldr.XK ->
            "کوسووو"

        Cldr.YE ->
            "یمن"

        Cldr.YT ->
            "مایوٹ"

        Cldr.ZA ->
            "جنوبی افریقہ"

        Cldr.ZM ->
            "زامبیا"

        Cldr.ZW ->
            "زمبابوے"