module Cldr.Greek.Polytonic exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr
import Cldr.Greek


{-| Name for `CountryCode` in Greek (Polytonic).

    AD Ἀνδόρα
    AE Ἠνωμένα Ἀραβικὰ Ἐμιράτα
    AF Ἀφγανιστάν
    AG Ἀντίγκουα καὶ Μπαρμπούντα
    AI Ἀνγκουίλα
    AL Ἀλβανία
    AM Ἀρμενία
    AO Ἀνγκόλα
    AQ Ἀνταρκτική
    AR Ἀργεντινή
    AS Ἀμερικανικὴ Σαμόα
    AT Αὐστρία
    AU Αὐστραλία
    AW Ἀρούμπα
    AX Νήσοι Όλαντ
    AZ Ἀζερμπαϊτζάν
    BA Βοσνία - Ἐρζεγοβίνη
    BB Μπαρμπέιντος
    BD Μπανγκλαντές
    BE Βέλγιο
    BF Μπουρκίνα Φάσο
    BG Βουλγαρία
    BH Μπαχρέιν
    BI Μπουρούντι
    BJ Μπενίν
    BL Άγιος Βαρθολομαίος
    BM Βερμοῦδες
    BN Μπρουνέι
    BO Βολιβία
    BQ Ολλανδία Καραϊβικής
    BR Βραζιλία
    BS Μπαχάμες
    BT Μπουτάν
    BV Νῆσος Μπουβέ
    BW Μποτσουάνα
    BY Λευκορωσία
    BZ Μπελίζ
    CA Καναδάς
    CC Νῆσοι Κόκος (Κήλινγκ)
    CD Κονγκό (ΛΔΚ)
    CF Κεντροαφρικανικὴ Δημοκρατία
    CG Κονγκό (Δημοκρατία)
    CH Ἑλβετία
    CI Ακτή Ελεφαντοστού
    CK Νῆσοι Κούκ
    CL Χιλή
    CM Καμερούν
    CN Κίνα
    CO Κολομβία
    CR Κόστα Ρίκα
    CU Κούβα
    CV Πράσινο Ακρωτήριο
    CW Κουρασάο
    CX Νῆσος Χριστουγέννων
    CY Κύπρος
    CZ Τσεχική Δημοκρατία
    DE Γερμανία
    DJ Τζιμπουτί
    DK Δανία
    DM Ντομίνικα
    DO Δομινικανὴ Δημοκρατία
    DZ Ἀλγερία
    EC Ἰσημερινός
    EE Ἐσθονία
    EG Αἴγυπτος
    EH Δυτικὴ Σαχάρα
    ER Ἐρυθραία
    ES Ἱσπανία
    ET Αἰθιοπία
    FI Φινλανδία
    FJ Φίτζι
    FK Νήσοι Φόκλαντ
    FM Μικρονησία, Ὁμόσπονδες Πολιτεῖες τῆς
    FO Νῆσοι Φερόες
    FR Γαλλία
    GA Γκαμπόν
    GB Ἡνωμένο Βασίλειο
    GD Γρενάδα
    GE Γεωργία
    GF Γαλλικὴ Γουιάνα
    GG Γκέρνζι
    GH Γκάνα
    GI Γιβραλτάρ
    GL Γροιλανδία
    GM Γκάμπια
    GN Γουινέα
    GP Γουαδελούπη
    GQ Ἰσημερινὴ Γουινέα
    GR Ἑλλάδα
    GS Νήσοι Νότια Γεωργία και Νότιες Σάντουιτς
    GT Γουατεμάλα
    GU Γκουάμ
    GW Γουινέα Μπισάου
    GY Γουιάνα
    HK Χονγκ Κονγκ
    HM Νῆσοι Χὲρντ καὶ Μακντόναλντ
    HN Ὁνδούρα
    HR Κροατία
    HT Ἁϊτή
    HU Οὑγγαρία
    ID Ἰνδονησία
    IE Ἰρλανδία
    IL Ἰσραήλ
    IM Νήσος του Μαν
    IN Ἰνδία
    IO Βρετανικὰ Ἐδάφη Ἰνδικοῦ Ὠκεανοῦ
    IQ Ἰράκ
    IR Ἰράν, Ἰσλαμικὴ Δημοκρατία τοῦ
    IS Ἰσλανδία
    IT Ἰταλία
    JE Τζέρζι
    JM Τζαμάικα
    JO Ἰορδανία
    JP Ἰαπωνία
    KE Κένυα
    KG Κιργιστάν
    KH Καμπότζη
    KI Κιριμπάτι
    KM Κομόρες
    KN Σαὶντ Κὶτς καὶ Νέβις
    KP Βόρεια Κορέα
    KR Νότια Κορέα
    KW Κουβέιτ
    KY Νῆσοι Κέιμαν
    KZ Καζακστάν
    LA Λατινικὴ Ἀμερική
    LB Λίβανος
    LC Ἁγία Λουκία
    LI Λιχτενστάιν
    LK Σρὶ Λάνκα
    LR Λιβερία
    LS Λεσότο
    LT Λιθουανία
    LU Λουξεμβοῦργο
    LV Λετονία
    LY Λιβύη
    MA Μαρόκο
    MC Μονακό
    MD Μολδαβία, Δημοκρατία τῆς
    ME Μαυροβούνιο
    MF Άγιος Μαρτίνος (Γαλλικό τμήμα)
    MG Μαδαγασκάρη
    MH Νῆσοι Μάρσαλ
    MK Βόρεια Μακεδονία
    ML Μαλί
    MM Μιανμάρ (Βιρμανία)
    MN Μογγολία
    MO Μακάο
    MP Νῆσοι Βόρειες Μαριάνες
    MQ Μαρτινίκα
    MR Μαυριτανία
    MS Μονσεράτ
    MT Μάλτα
    MU Μαυρίκιος
    MV Μαλδίβες
    MW Μαλάουι
    MX Μεξικό
    MY Μαλαισία
    MZ Μοζαμβίκη
    NA Ναμίμπια
    NC Νέα Καληδονία
    NE Νίγηρας
    NF Νῆσος Νόρφολκ
    NG Νιγηρία
    NI Νικαράγουα
    NL Ὁλλανδία
    NO Νορβηγία
    NP Νεπάλ
    NR Ναουρού
    NU Νιούε
    NZ Νέα Ζηλανδία
    OM Ὀμάν
    PA Παναμάς
    PE Περού
    PF Γαλλικὴ Πολυνησία
    PG Παπούα Νέα Γουινέα
    PH Φιλιππίνες
    PK Πακιστάν
    PL Πολωνία
    PM Σαὶντ Πιὲρ καὶ Μικελόν
    PN Νήσοι Πίτκερν
    PR Πουέρτο Ρίκο
    PS Παλαιστίνη
    PT Πορτογαλία
    PW Παλάου
    PY Παραγουάη
    QA Κατάρ
    RE Ρεϊνιόν
    RO Ρουμανία
    RS Σερβία
    RU Ρωσία
    RW Ρουάντα
    SA Σαουδικὴ Ἀραβία
    SB Νῆσοι Σολομῶντος
    SC Σεϋχέλλες
    SD Σουδάν
    SE Σουηδία
    SG Σιγκαπούρη
    SH Ἁγία Ἑλένη
    SI Σλοβενία
    SJ Νῆσοι Σβάλμπαρ καὶ Γιὰν Μαγιέν
    SK Σλοβακία
    SL Σιέρα Λεόνε
    SM Ἅγιος Μαρίνος
    SN Σενεγάλη
    SO Σομαλία
    SR Σουρινάμ
    SS Νότιο Σουδάν
    ST Σάο Τομὲ καὶ Πρίνσιπε
    SV Ἒλ Σαλβαδόρ
    SX Άγιος Μαρτίνος (Ολλανδικό τμήμα)
    SY Συρία, Ἀραβικὴ Δημοκρατία τῆς
    SZ Εσουατίνι
    TC Νῆσοι Τὲρκς καὶ Κάικος
    TD Τσάντ
    TF Γαλλικὰ Νότια Ἐδάφη
    TG Τόγκο
    TH Ταϊλάνδη
    TJ Τατζικιστάν
    TK Τοκελάου
    TL Ανατολικό Τιμόρ
    TM Τουρκμενιστάν
    TN Τυνησία
    TO Τόνγκα
    TR Τουρκία
    TT Τρινιδὰδ καὶ Τομπάγκο
    TV Τουβαλού
    TW Ταϊβάν
    TZ Τανζανία
    UA Οὐκρανία
    UG Οὐγκάντα
    UM Ἀπομακρυσμένες Νησίδες τῶν Ἡνωμένων Πολιτειῶν
    US Ἡνωμένες Πολιτεῖες
    UY Οὐρουγουάη
    UZ Οὐζμπεκιστάν
    VA Ἁγία Ἕδρα (Βατικανό)
    VC Ἅγιος Βικέντιος καὶ Γρεναδίνες
    VE Βενεζουέλα
    VG Βρετανικὲς Παρθένοι Νῆσοι
    VI Ἀμερικανικὲς Παρθένοι Νῆσοι
    VN Βιετνάμ
    VU Βανουάτου
    WF Νῆσοι Οὐάλλις καὶ Φουτουνά
    WS Σαμόα
    XK Κοσσυφοπέδιο
    YE Ὑεμένη
    YT Μαγιότ
    ZA Νότια Ἀφρική
    ZM Ζάμπια
    ZW Ζιμπάμπουε
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AD ->
            "Ἀνδόρα"

        Cldr.AE ->
            "Ἠνωμένα Ἀραβικὰ Ἐμιράτα"

        Cldr.AF ->
            "Ἀφγανιστάν"

        Cldr.AG ->
            "Ἀντίγκουα καὶ Μπαρμπούντα"

        Cldr.AI ->
            "Ἀνγκουίλα"

        Cldr.AL ->
            "Ἀλβανία"

        Cldr.AM ->
            "Ἀρμενία"

        Cldr.AO ->
            "Ἀνγκόλα"

        Cldr.AQ ->
            "Ἀνταρκτική"

        Cldr.AR ->
            "Ἀργεντινή"

        Cldr.AS ->
            "Ἀμερικανικὴ Σαμόα"

        Cldr.AT ->
            "Αὐστρία"

        Cldr.AU ->
            "Αὐστραλία"

        Cldr.AW ->
            "Ἀρούμπα"

        Cldr.AZ ->
            "Ἀζερμπαϊτζάν"

        Cldr.BA ->
            "Βοσνία - Ἐρζεγοβίνη"

        Cldr.BM ->
            "Βερμοῦδες"

        Cldr.BV ->
            "Νῆσος Μπουβέ"

        Cldr.CC ->
            "Νῆσοι Κόκος (Κήλινγκ)"

        Cldr.CF ->
            "Κεντροαφρικανικὴ Δημοκρατία"

        Cldr.CH ->
            "Ἑλβετία"

        Cldr.CK ->
            "Νῆσοι Κούκ"

        Cldr.CX ->
            "Νῆσος Χριστουγέννων"

        Cldr.DO ->
            "Δομινικανὴ Δημοκρατία"

        Cldr.DZ ->
            "Ἀλγερία"

        Cldr.EC ->
            "Ἰσημερινός"

        Cldr.EE ->
            "Ἐσθονία"

        Cldr.EG ->
            "Αἴγυπτος"

        Cldr.EH ->
            "Δυτικὴ Σαχάρα"

        Cldr.ER ->
            "Ἐρυθραία"

        Cldr.ES ->
            "Ἱσπανία"

        Cldr.ET ->
            "Αἰθιοπία"

        Cldr.FM ->
            "Μικρονησία, Ὁμόσπονδες Πολιτεῖες τῆς"

        Cldr.FO ->
            "Νῆσοι Φερόες"

        Cldr.GB ->
            "Ἡνωμένο Βασίλειο"

        Cldr.GF ->
            "Γαλλικὴ Γουιάνα"

        Cldr.GQ ->
            "Ἰσημερινὴ Γουινέα"

        Cldr.GR ->
            "Ἑλλάδα"

        Cldr.HM ->
            "Νῆσοι Χὲρντ καὶ Μακντόναλντ"

        Cldr.HN ->
            "Ὁνδούρα"

        Cldr.HT ->
            "Ἁϊτή"

        Cldr.HU ->
            "Οὑγγαρία"

        Cldr.ID ->
            "Ἰνδονησία"

        Cldr.IE ->
            "Ἰρλανδία"

        Cldr.IL ->
            "Ἰσραήλ"

        Cldr.IN ->
            "Ἰνδία"

        Cldr.IO ->
            "Βρετανικὰ Ἐδάφη Ἰνδικοῦ Ὠκεανοῦ"

        Cldr.IQ ->
            "Ἰράκ"

        Cldr.IR ->
            "Ἰράν, Ἰσλαμικὴ Δημοκρατία τοῦ"

        Cldr.IS ->
            "Ἰσλανδία"

        Cldr.IT ->
            "Ἰταλία"

        Cldr.JO ->
            "Ἰορδανία"

        Cldr.JP ->
            "Ἰαπωνία"

        Cldr.KN ->
            "Σαὶντ Κὶτς καὶ Νέβις"

        Cldr.KY ->
            "Νῆσοι Κέιμαν"

        Cldr.LA ->
            "Λατινικὴ Ἀμερική"

        Cldr.LC ->
            "Ἁγία Λουκία"

        Cldr.LK ->
            "Σρὶ Λάνκα"

        Cldr.LU ->
            "Λουξεμβοῦργο"

        Cldr.MD ->
            "Μολδαβία, Δημοκρατία τῆς"

        Cldr.MH ->
            "Νῆσοι Μάρσαλ"

        Cldr.ML ->
            "Μαλί"

        Cldr.MP ->
            "Νῆσοι Βόρειες Μαριάνες"

        Cldr.NF ->
            "Νῆσος Νόρφολκ"

        Cldr.NL ->
            "Ὁλλανδία"

        Cldr.OM ->
            "Ὀμάν"

        Cldr.PF ->
            "Γαλλικὴ Πολυνησία"

        Cldr.PM ->
            "Σαὶντ Πιὲρ καὶ Μικελόν"

        Cldr.SA ->
            "Σαουδικὴ Ἀραβία"

        Cldr.SB ->
            "Νῆσοι Σολομῶντος"

        Cldr.SH ->
            "Ἁγία Ἑλένη"

        Cldr.SJ ->
            "Νῆσοι Σβάλμπαρ καὶ Γιὰν Μαγιέν"

        Cldr.SM ->
            "Ἅγιος Μαρίνος"

        Cldr.ST ->
            "Σάο Τομὲ καὶ Πρίνσιπε"

        Cldr.SV ->
            "Ἒλ Σαλβαδόρ"

        Cldr.SY ->
            "Συρία, Ἀραβικὴ Δημοκρατία τῆς"

        Cldr.TC ->
            "Νῆσοι Τὲρκς καὶ Κάικος"

        Cldr.TD ->
            "Τσάντ"

        Cldr.TF ->
            "Γαλλικὰ Νότια Ἐδάφη"

        Cldr.TT ->
            "Τρινιδὰδ καὶ Τομπάγκο"

        Cldr.UA ->
            "Οὐκρανία"

        Cldr.UG ->
            "Οὐγκάντα"

        Cldr.UM ->
            "Ἀπομακρυσμένες Νησίδες τῶν Ἡνωμένων Πολιτειῶν"

        Cldr.US ->
            "Ἡνωμένες Πολιτεῖες"

        Cldr.UY ->
            "Οὐρουγουάη"

        Cldr.UZ ->
            "Οὐζμπεκιστάν"

        Cldr.VA ->
            "Ἁγία Ἕδρα (Βατικανό)"

        Cldr.VC ->
            "Ἅγιος Βικέντιος καὶ Γρεναδίνες"

        Cldr.VG ->
            "Βρετανικὲς Παρθένοι Νῆσοι"

        Cldr.VI ->
            "Ἀμερικανικὲς Παρθένοι Νῆσοι"

        Cldr.WF ->
            "Νῆσοι Οὐάλλις καὶ Φουτουνά"

        Cldr.YE ->
            "Ὑεμένη"

        Cldr.ZA ->
            "Νότια Ἀφρική"

        _ ->
            Cldr.Greek.countryCodeToName countryCode