module Cldr.Serbian.Cyrillic.BosniaAndHerzegovina exposing (countryCodeToName)

{-| 
@docs countryCodeToName
-}


import Cldr
import Cldr.Serbian.Cyrillic


{-| Name for `CountryCode` in Serbian (Cyrillic) - Bosnia & Herzegovina.

    AD Андора
    AE Уједињени Арапски Емирати
    AF Авганистан
    AG Антигва и Барбуда
    AI Ангвила
    AL Албанија
    AM Јерменија
    AO Ангола
    AQ Антарктик
    AR Аргентина
    AS Америчка Самоа
    AT Аустрија
    AU Аустралија
    AW Аруба
    AX Оландска острва
    AZ Азербејџан
    BA Босна и Херцеговина
    BB Барбадос
    BD Бангладеш
    BE Белгија
    BF Буркина Фасо
    BG Бугарска
    BH Бахреин
    BI Бурунди
    BJ Бенин
    BL Сен Бартелеми
    BM Бермуда
    BN Брунеји
    BO Боливија
    BQ Карипска Холандија
    BR Бразил
    BS Бахами
    BT Бутан
    BV острво Буве
    BW Боцвана
    BY Бјелорусија
    BZ Белизе
    CA Канада
    CC Кокосова (Килинг) острва
    CD Конго (ДРК)
    CF Централноафричка Република
    CG Конго (Република)
    CH Швајцарска
    CI Обала Слоноваче (Кот д’Ивоар)
    CK Кукова Острва
    CL Чиле
    CM Камерун
    CN Кина
    CO Колумбија
    CR Костарика
    CU Куба
    CV Зеленортска Острва
    CW Курасао
    CX Божићно Острво
    CY Кипар
    CZ Чешка Република
    DE Њемачка
    DJ Џибути
    DK Данска
    DM Доминика
    DO Доминиканска Република
    DZ Алжир
    EC Еквадор
    EE Естонија
    EG Египат
    EH Западна Сахара
    ER Еритреја
    ES Шпанија
    ET Етиопија
    FI Финска
    FJ Фиџи
    FK Фокландска острва
    FM Микронезија
    FO Фарска острва
    FR Француска
    GA Габон
    GB Уједињено Краљевство
    GD Гренада
    GE Грузија
    GF Француска Гвајана
    GG Гернзи
    GH Гана
    GI Гибралтар
    GL Гренланд
    GM Гамбија
    GN Гвинеја
    GP Гваделуп
    GQ Екваторијална Гвинеја
    GR Грчка
    GS Јужна Џорџија и Јужна Сендвичка острва
    GT Гватемала
    GU Гвам
    GW Гвинеја Бисао
    GY Гвајана
    HK Хонгконг
    HM острво Херд и острва Макдоналд
    HN Хондурас
    HR Хрватска
    HT Хаити
    HU Мађарска
    ID Индонезија
    IE Ирска
    IL Израел
    IM Острво Ман
    IN Индија
    IO Британска територија Индијског океана
    IQ Ирак
    IR Иран
    IS Исланд
    IT Италија
    JE Џерзи
    JM Јамајка
    JO Јордан
    JP Јапан
    KE Кенија
    KG Киргистан
    KH Камбоџа
    KI Кирибати
    KM Комори
    KN Сент Китс и Невис
    KP Сјеверна Кореја
    KR Јужна Кореја
    KW Кувајт
    KY Кајманска Острва
    KZ Казахстан
    LA Лаос
    LB Либан
    LC Света Луција
    LI Лихтенштајн
    LK Шри Ланка
    LR Либерија
    LS Лесото
    LT Литванија
    LU Луксембург
    LV Летонија
    LY Либија
    MA Мароко
    MC Монако
    MD Молдавија
    ME Црна Гора
    MF Свети Мартин (Француска)
    MG Мадагаскар
    MH Маршалска Острва
    MK Сјеверна Македонија
    ML Мали
    MM Мјанмар (Бурма)
    MN Монголија
    MO Макао
    MP Сјеверна Маријанска острва
    MQ Мартиник
    MR Мауританија
    MS Монсерат
    MT Малта
    MU Маурицијус
    MV Малдиви
    MW Малави
    MX Мексико
    MY Малезија
    MZ Мозамбик
    NA Намибија
    NC Нова Каледонија
    NE Нигер
    NF острво Норфок
    NG Нигерија
    NI Никарагва
    NL Холандија
    NO Норвешка
    NP Непал
    NR Науру
    NU Нијуе
    NZ Нови Зеланд
    OM Оман
    PA Панама
    PE Перу
    PF Француска Полинезија
    PG Папуа Нова Гвинеја
    PH Филипини
    PK Пакистан
    PL Пољска
    PM Сен Пјер и Микелон
    PN Питкерн
    PR Порторико
    PS Палестина
    PT Португалија
    PW Палау
    PY Парагвај
    QA Катар
    RE Реунион
    RO Румунија
    RS Србија
    RU Русија
    RW Руанда
    SA Саудијска Арабија
    SB Соломонска Острва
    SC Сејшели
    SD Судан
    SE Шведска
    SG Сингапур
    SH Света Јелена
    SI Словенија
    SJ Свалбард и Јан Мајен
    SK Словачка
    SL Сијера Леоне
    SM Сан Марино
    SN Сенегал
    SO Сомалија
    SR Суринам
    SS Јужни Судан
    ST Сао Томе и Принципе
    SV Салвадор
    SX Свети Мартин (Холандија)
    SY Сирија
    SZ Свазиленд
    TC Острва Туркс и Каикос
    TD Чад
    TF Француске јужне територије
    TG Того
    TH Тајланд
    TJ Таџикистан
    TK Токелау
    TL Источни Тимор
    TM Туркменистан
    TN Тунис
    TO Тонга
    TR Турска
    TT Тринидад и Тобаго
    TV Тувалу
    TW Тајван
    TZ Танзанија
    UA Украјина
    UG Уганда
    UM Спољна острва САД
    US Сједињене Државе
    UY Уругвај
    UZ Узбекистан
    VA Ватикан
    VC Свети Винсент и Гренадини
    VE Венецуела
    VG Британска Дјевичанска острва
    VI Америчка Дјевичанска острва
    VN Вијетнам
    VU Вануату
    WF Валис и Футуна
    WS Самоа
    XK Косово
    YE Јемен
    YT Мајот
    ZA Јужноафричка Република
    ZM Замбија
    ZW Зимбабве
-}
countryCodeToName : Cldr.CountryCode -> String
countryCodeToName countryCode =
    case countryCode of
        Cldr.AX ->
            "Оландска острва"

        Cldr.BL ->
            "Сен Бартелеми"

        Cldr.BN ->
            "Брунеји"

        Cldr.BV ->
            "острво Буве"

        Cldr.BY ->
            "Бјелорусија"

        Cldr.CC ->
            "Кокосова (Килинг) острва"

        Cldr.DE ->
            "Њемачка"

        Cldr.FK ->
            "Фокландска острва"

        Cldr.FO ->
            "Фарска острва"

        Cldr.GS ->
            "Јужна Џорџија и Јужна Сендвичка острва"

        Cldr.GU ->
            "Гвам"

        Cldr.GW ->
            "Гвинеја Бисао"

        Cldr.HM ->
            "острво Херд и острва Макдоналд"

        Cldr.KM ->
            "Комори"

        Cldr.KP ->
            "Сјеверна Кореја"

        Cldr.MK ->
            "Сјеверна Македонија"

        Cldr.MM ->
            "Мјанмар (Бурма)"

        Cldr.MP ->
            "Сјеверна Маријанска острва"

        Cldr.NF ->
            "острво Норфок"

        Cldr.NU ->
            "Нијуе"

        Cldr.RE ->
            "Реунион"

        Cldr.TF ->
            "Француске јужне територије"

        Cldr.UM ->
            "Спољна острва САД"

        Cldr.VC ->
            "Свети Винсент и Гренадини"

        Cldr.VG ->
            "Британска Дјевичанска острва"

        Cldr.VI ->
            "Америчка Дјевичанска острва"

        _ ->
            Cldr.Serbian.Cyrillic.countryCodeToName countryCode